{
  "doc_id": "00432b7f-30c4-4496-964e-df2a5ccedc81",
  "pages": [
    {
      "page_number": 1,
      "text": "Institution of Railway Signal Engineers\na\nBack to basics: Interlocking\nmiewee Francis How ag “ef\na\nThis, the third in a series of articles on ‘back 2.When a train has been given authority to move:\nto basics’ themes, looks at the essentials ¢ — points in the section of track are prevented\nof ‘interlocking’. Interlocking is central from being moved, and\nto railway signalling, as It ensures that 。 other trains are prevented from entering the\nthe components of a signalling system same section of track\nact together in a manner which is safe\nfor the routing and movement of trains. until the train has passed through the\nWhole books could be written about the section of route.\nsubject, and this article is no more than an There is more to interlocking than this, as we shall\nintroduction, intended for IRSE members see, but this is the essence of what it is all about.\nnew to the industry rather than those who\nare experienced in specifying, designing and What does interlocking not do?\n“Interlocking testing signalling systems. Interlocking does not check that everything is safe\n, , ; ; for the passage of a train. A section of railway track\ndoes not check This article focuses primarily on the technology must be safe for the passage of trains in many\nthat everythin used for interlocking. Next month there will be other ways as well. For instance, the distance\ny g a further article, in which we will look at the ¥\nis safe for the f ‘onali f . locki hat j 1 between the rails must be correct, the track-bed\nunctiona ity oran interlocking — what it actually must be capable of supporting the weight of a\npassage of a does in practice. train, and the train's cross-sectional dimensions\ntrain” What is interlocking? (the dynamic envelope) must be compatible with\n. , , , the positioning of items Such as platforms and\nIfyou ask a signal engineer about interlocking, bridges, so that the train will not hit them. These\nthey may well point to an equipment room full can also cause collision or derailment — but\nof Te ot a cabinet of compu equipment they are not generally the concern of the signal\nIna “lic te dio \"a, OF Permaps rt. fart [Work engineer. Railway engineers have other methods\nUndernoath a lever frame ina signal box. Itis for ensuring the integrity of these other features\n_ hich trai fet .\ntrue that all these things are ‘interlockings’, but upon which train safety depends\n‘interlocking’ is defined as a feature of a control Interlocking safety\nsystem that makes ie ae of two functions Interlocking functions (such as moving a set of\nmut CeRencen nt © oe Or rallway points or clearing a signal) must be executed only\neet Ing. eis ng vi to Th trains when it is safe to do so. Industrial control systems\nsare trom sp hose int | me © primary (of which railway signalling is an example) are\nPurposes 9 。 ese interlocking features are designed to meet a specified ‘safety integrity level’\nto ensure that: (SIL). There are five such levels, from 0 to 4, and\n1. Before a train is given authority to move along the interlocking functions in a modern main line or\na section of track from one signal to the next: metro railway signalling system must usually meet\n。 points are in the correct position (to SIL 4 requirements — the highest level possible.\navoid derailment). ae eae ee ketnoce of an unsafe failure is\n。 there are no trains already on the track (to y ,\navoid collision), and The underlying safety principle traditionally\n。 — nocontflicting train movements are already associated with railway signalling, and particularly\nauthorised (also to avoid collision). with the interlocking, is known as the ‘fail-safe\n16",
      "source_file": "8_Interlocking.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 2,
      "text": "IRSE News | Issue 265 | April 2020\nprinciple. This means that if an interlocking system have left the section — without any knowledge of\ndevelops a fault, it is designed so that it will fail in whether in practice it had done so!\n\na manner which stops trains, by putting signals Not surprisingly, it didn’t take long for accidents\nto danger. This fail-safe property is achieved in\n, , , to demonstrate the need for safer ways of\nvarious ways, including the use of inherently fail- 。 . ;\n, , controlling the movement of trains. This article\nsafe components, the design of the interlocking ; .\ndoes not explore the evolution of railway\nlogic, and the system architecture. ; . .\nsignalling, but there were some key milestones\nIt is important to note that ‘fail-safe’ does not in its development which are worth noting. One\nmean that the signalling of trains is 100% safe. This was the introduction of the electric telegraph, so\nis partly because in practice the occurrence of that someone at one end of section of railway line\nunsafe failures cannot be completely eliminated, could communicate with someone at the other\nand partly because if trains have been stopped end. This eliminated the need for ‘time interval\nby a (safe) failure of the signalling system, the working’ by enabling the person controlling entry\nmovement of trains then depends largely upon to a section of line to receive positive confirmation\nthe application of operational procedures, with the | when the whole of the preceding train had left the\nassociated risk of human error. section and therefore the line was again ‘clear’.\nNot all parts of a signalling system need to be A second crucial development was the\nultra-safe. In modern systems the use of high introduction of the signal box, to enable signals\nintegrity (SIL 4) design techniques is usually and points to be controlled from one place.\nrestricted to those parts of the system which are Previously the setting up of a route for a train had\nessential for safety — including the interlocking relied upon people walking about on the track to\nfunctionality. Other parts, such as the control move points and operate signals. Centralisation\npanel or desk, are usually of a lower integrity of these activities was not only more efficient and\n(typically SIL O to SIL 2). You might wonder why reduced the possibility of misunderstanding, it\nwe do not design all parts of the signalling system also facilitated the introduction of ‘interlocking’\nto achieve SIL 4 levels of safety. The answer is — mechanical equipment in the signal box that\nFigure 1 - The that designing systems to meet high levels of helped to prevent mistakes being made by\nChippenham, UK, factory _ safety integrity is complex, time-consuming the signaller when moving points or operating\nof Westinghouse Brake and expensive, and can lead to lower levels signals. Even in the age of computerisation, it is\n8 Saxby Signal Company ”of reliability. remarkable to look back at how railway engineers\nin 1927. Some 60 years f the 19th t , ted hanical loai\nafter the invention of the A little history of the century invented mechanical logic\ninterlocking skilled teams ae systems that largely overcame the risk of human\nwere still assembling When railways first appeared, they had no error when signalling trains.\ncomplex lever frames — signalling in the form that we would recognise So. th d for the introducti\nsome of which are still in today. The concept of a signal box did not exist, 0, ane Way Was Paved TOF ine introcucnion\nuse today. , , of ‘interlocking’ according to a defined set of\ny ; signals were very rudimentary (originally just a , .\nPhoto W85S Archive/ , , ~ , principles or rules — which for the most part still\n; man with a flag), and giving permission for a train\nChippenham Museum & ; ; apply today, albeit they vary in some respects from\n| to enter a section of track relied simply upon , ,\nHeritage Centre. . , , , 。 , railway to railway.\nallowing sufficient time for the preceding train to\n—_— OT 一 了\n. 、 , 二 } _ ;\n_ * 、 | :@ a »\n| 由 aa a\nSO ‘ “4a EAT TS 区 . OR oa j\nwae a |\nrin ww A: py amt\n: rr“一一一: 本 > s°\n. oo _ —. — < _ -~\n17",
      "source_file": "8_Interlocking.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 3,
      "text": "IRSE News | Issue 265 | April 2020\nInterlocking technologies Gradually engineers began to introduce simple\nMechanical interlocking electro-mechanical locking in combination\nwith the mechanical locking, to prevent a lever\nThe earliest form of interlocking was purely from being moved unless its electric lock was\nmechanical. Signal boxes were usually two storey — energised. Energisation of the lock (via an\nbuildings, with the signaller working upstairs electrical circuit) required other levers to be\nand the interlocking downstairs. To allow a electrically proved to be in the correct position.\ntrain to move, the signaller would operate large Further conditions were progressively added to\nlevers, separate ones being provided for each the lock circuits to improve safety, such as the\nset of points and for each signal. These levers requirement for relevant track circuits to be clear\nwere directly connected via mechanical rods before a signal or set of points could be moved.\nand/or wires to the points and signals outside,\nand therefore could require considerable Safety features were also added to the block\neffort to move. systems that controlled the movement of trains\nbetween neighbouring signal boxes, to prevent a\nOn the ground floor of the signal box, underneath _signaller from sending a train from the area that he\nthe levers, was an arrangement of metal bars that controlled to that of the next signal box unless it\nwere connected to the levers, with other bars at was safe to do so.\nright-angles to the first. The physical interlocking\nof the two sets of bars prevented the signaller Mechanically interlocked signal boxes are still in\nfrom moving a lever unless other levers were in use on railways in many parts of the world, well\nthe correct position. So, for instance, he could over 125 years since they were introduced.\nnot move a signal lever to allow a train to move\nunless the relevant points levers were in the\ncorrect position.\nHow does mechanical interlocking work?\nA flat metal bar (called a tappet) is of one lever is prevented or permitted the notch in the tappet of Lever 4 and\nattached to the end (tail) of each lever. according to whether a locking piece is is not free to move out of it. Thus Lever\nAll the tappets are held within a locking — held in a notch in the tappet, or is clear 1 locks Lever 4. The converse is also\nbox, so that each one moves in one of (or free to move out of) the notch. true. If Lever 1 is normal and Lever 4 is\ndirection when the corresponding lever The use of bevelled edges enables a reverse, Lever 4 locks Lever 1 normal,\nis pulled to its reverse position, and in tappet, when free to move, to force the as shown in Figure 2c (this is called\nthe opposite direction when the lever is locking piece out of the notch. reciprocal locking and is an inherent\npushed back to its normal position. . , feature of mechanical locking). Much\nIn Figure 2a below, when Lever 1 is ;\n, more complicated locking arrangements\nTo create a lock, a bevelled notch is cut — pulled from normal to reverse, the\n, , , , , - can be created than the simple one\nin the side of a tappet, and a locking tappet will move in the direction of the . ,\n, , ae , shown, with levers being locked in both\npiece (sometimes called a nib) is cut arrow. The positions of the tappets and ~ ,\n, , , normal and reverse positions by multiple\nto fit the notch. If a horizontal bar is locking pieces will then be as shown in ; ;\n; . . , , other levers, and with locking of one\nplaced in the locking box with one Figure 2b, and Lever 4 is locked in the . ~ ,\n, . ws lever by another being conditional on\nend connected to the locking piece, normal position. It cannot be moved the position of a third lever\nand the other end is connected to because the second locking piece P\nanother locking piece, the movement (connected to the first) has engaged in\nTappet connected Tappet connected\nto Lever 1 to Lever 4\n1 4 4 1\nConnecting\nbar\n1 4\nLocking nibs\nFigure 2a Figure 2b Figure 2c\n18",
      "source_file": "8_Interlocking.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 4,
      "text": "IRSE News | Issue 265 | April 2020\nTM <3 af oa . i. = RE 00 lees me es | my pre ,\nsae Ke. SR ee Sot. a\n2, ag ile AES EPP so\nFigure 3 - The Electrical interlocking smaller, and were often designed to plug into\nbased signalling allowed The advantages of using electrical locking bases to which all the wiring was connected, so\ncontrol centres to move became even more evident when colour light making it easy to replace a faulty one as well as\nto the use of complex signals and electric point machines began to be enabling hundreds or even thousands of them to\npanels. These UK introduced. Mechanical locking could be entirely be housed in a much smaller space. All the wiring\nexamples are from Carlisle replaced by electric locking, and large levers were 210 the relays and their bases were mounted on\n(left) and London Bridge no longer necessary for operating points and vertical racks, and a large interlocking might have\n(right) power signal boxes, signals, since no great physical effort was required dozens of such racks, all housed in a ‘relay room’.\ncommissioned in the , , ,\n1970s. by the signaller to switch an electric signal Not sure what a relay is?\nPhotos WB&S Archive/ or point machine. A relay is an electromechanical switch, with an\nChippenham Museum & Early all-electric signal boxes used miniature electromagnetic coil, an armature and various\nHeritage Centre. , re , ,\nmechanical levers on a desk, replicating in contacts. When the coil is energised, the armature\na more modern form the row of levers in moves and closes a number of contacts (‘front’ or\nmechanical boxes. This evolution led in time to ‘normally open’ contacts) and opens others (‘back’\nthe introduction of control panels, with switches or ‘normally closed’ contacts). These contacts\nand buttons on the panel being used to set are used in other circuits to create the logic\nwhole routes from one signal to the next, without conditions for operating other relays, powering\nthe signaller needing to set the points in the point machines, illuminating the aspects of signals\nce roaches to relay route individually. etc. When the coil is de-energised the armature\ndesign. Below, the type N ”The ‘route setting’ approach eventually became returns to Its original position, opening the front\nrelay, bottom the typeC. —_— the preferred form of control. The role of the contacts and closing the back contacts.\n5e0ec5 0 interlocking was crucial in this. Instead of being Relay interlocking architecture and design\na passive system for determining whether it was The architecture of relay interlockings varies from\nsafe to operate a set of points or a signal (as railway to railway (even within a single country),\nPe | mechanical locking had been), it became an active and from country to country. We are not going\n| aos -_- system that interpreted and acted on requests to explore all the variations here, but it is worth\n| ion * ; received from the control panel. In simple form, understanding a little about the basic design\ni oo the request to seta route from one signal to the philosophies that characterise almost all relay\nor next is set up by the signaller using switches and interlockings.\n. att buttons on the control panel (which has a diagram\nI Nt ‘ty of the track layout on it). The interlocking then In the early days all relay interlockings were ‘free\na moves the relevant points provided it is safe todo — wired’. With this approach, each circuit, whatever\nso, checks that the track is clear of other trains, its purpose or function, was individually designed\nand clears the entrance signal for the route. and wired, usually in accordance with a set of\ntemplated (standard) circuits. In time an alternative\nRelays approach emerged, whereby manufacturers\n: The fundamental building block of the traditional provided a range of factory-wired, pre-tested\nos aS 2 route-setting interlocking is the relay. Before the sets of relays known as ‘geographical’ units. Each\na ee Se relay interlocking gained prominence, relays had type of unit was designed to provide the standard\n~ ae, a) af : , already been used for track circuits and for other interlocking functions required for a specific\na, a + q simple circuits in mechanical and early electric combination of signals, points and train detection\n*. , 4 signal boxes. These relays had generally been sections. By connecting the appropriate units\n| R | in relatively large devices, often designed to sit on together (usually with plug-coupled cables) to\n1 Load tl shelves. But as relay interlockings became more mimic the actual layout of the track and signalling,\npopular, relays were progressively made physically the required route-setting functionality could be\n19",
      "source_file": "8_Interlocking.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 5,
      "text": "IRSE News | Issue 265 | April 2020\nFigure 5 - Route rela a . an. Wa ie Sr lens” “kK .\ninterlockings have ” AIP a Sa EM Sa. | yo ce 下 一 、 二 Uy ; | NE\nbeen very successful “as \"ee aa RS | me Iya 4 ! = ‘tab st |\nina huge range of ir aae | ay . |, re’ 一 yd . _ BE ATT its\napplications world-wide. rr | : - dat 1 oe 一 E | _ abe | KEY\nIn this example from the ] | bab. \\ 7 | OR en . A | if\noriginal Singapore MRT -Te ” @iag | 1; ee , oa) ‘- mS EY\nseneme Ce Tceroc ng 上 ae We Ka 2 at i} | meee -§ E | 了 £ Bran Wa\nis interfaced to code : Sines % $ -上 se vey -- my\ntrack circuits allowing SG eR TYTT TTT . a | ‘ uty “ai 1 Ts 1\na high performance - ° . fs . aa ve 六\nautomatic train protection oe 时 pate \"Ts ee | ae _— we 四 [一了\nand automatic train ”了 -人 FESS\noperation system to be ) = Baas oss SE ;\n. 7 6 一 to ‘ , ite @ 4 ~»\nimplemented. 2 ”em - ew. | a] “a\nPhoto WBES Archive/ SET ae st: SP eee an ~ ETT i.\nHertage Centre. wee | ge BRM Se a\nol 本 盈 绩人 ae — pene ® 1° VE\no-t ' [ t wet , - 1 z tee -\n| n> Gene mee ee a - ~\nbuilt up relatively easily. There are advantages and with the passage of the trains. By contrast, the\ndisadvantages with both approaches, including dependable fail-safe nature of the type N relay\ncost, flexibility, soeed of design and testing. makes it generally unnecessary to include this\nSecondly, the relay interlocking circuits (both additional complexity.\nfree-wired and geographical types) vary in form In all interlockings the circuits are designed to\naccording to the type of relay used. There are, exploit the safety characteristics of the relays.\nbroadly speaking, two generic types of relay used Usually this is done by requiring a relay to be\nfor all interlockings. One type is inherently ‘fail- energised to allow a less restrictive state (e.g. to\n“ safe’, meaning that if the coil is de-energised, the allow a signal to show a proceed aspect, or to\nA route relay front contacts will always open, and it is virtually allow a set of points to move). If the relay or the\ninterlocking is, iN impossible for a failure to occur whereby front power supply fails, or there is a disconnection in\neffect, a and back contacts are in the ‘closed’ position at the circuit, the relay de-energises, so causing the\n。 the same time. The use of non-welding materials signalling equipment to revert to a safer state.\nhard-wired for the contacts makes it im |\npossible for a contact . .\nparallel to weld in the closed position. This type of relay Computer-based interlockings (CBI)\nprocessing logic is known generically as type N in UIC standard With the development of electronic logic gates in\nmachine.” 736i. The best-known family of signalling relays the form of integrated circuits, and subsequently\n; in this category is probably the BR930 series, the with the emergence of the microprocessor and\ndevelopment of which, incidentally, involved the programmable logic controllers (PLCs), it was a\nIRSE. There are at least 200 variations of this same natural step to see how this technology could\nbasic relay, with different operating characteristics | be applied to interlockings. Early experimental\n(slow to energise, slow to de-energise etc), installations were implemented in the 1960s\ndifferent numbers and types of contacts, and and 1970s, but it was in the mid-1980s that\ndifferent operating voltages. the electronic software-based interlocking first\nbecame a reality. One of the best known of\nThe other generic type of relay used in some these was SSI - the ‘Solid State Interlocking’,\ninterlocking systems is known as type C in UIC developed in the UK.\nstandard 736i. It is not guaranteed to behave in\nthe inherently fail-safe manner described above. The use of software-driven electronic logic\nSpecifically, it is possible for a contact to weld presented a whole new set of challenges for\nso that it remains closed when it should be open system designers. A route relay interlocking is,\nalthough, as with a type N relay, the mechanical in effect, a hard-wired parallel processing logic\ndesign prevents any front and back contacts being machine. If it goes wrong it could initiate unsafe\nclosed at the same time, even if welding occurs (a _—_ actions, but the potential failure modes and\nfeature known as ‘forcibly guided’ contacts).Such their causes are well-understood and, by good\nrelays have the advantage of being considerably design practice and by testing it to make sure\nless expensive and smaller. But in order for the the locking conforms to the application rules,\ninterlocking as a whole to behave in a fail-safe the probability of an unsafe failure is very low. A\nmanner, the circuits are more complicated as computer-based interlocking (CBI), which makes\na consequence of using additional contacts to use of microprocessors, is another matter entirely,\nprove that relays have de-energised correctly, however. Microprocessors comprise hardware and\nand because of the need to check that the embedded software, and these are not designed\ncircuits are operating in the correct sequence to meet the high integrity safety requirements\n20",
      "source_file": "8_Interlocking.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 6,
      "text": "IRSE News | Issue 265 | April 2020\nProcessing Processing Processing Processing Processing Processing\nchannel A channel B channel A channel B channel C channel D\nVote ©\nAction 7\nAction\nFigure 6 — Achieving safety and availability in\ninterlocking systems typically involves the adoption of , , ,\none of the architectures shown here. Processing Processing Processing\nchannel A channel B channel C\nAbove left, ‘two out of two’ requires both processing\nchannels to determine a course of action which will\nonly be carried out if both agree. If either fails then the\nsystem shuts down to a safe state.\nAbove right, duplicating two sets of ‘two out of two’ Vote\nand switching between the two pairs increases system\navailability.\nRight, ‘two out of three’ uses three processing channels. Action\nAt least two channels must agree on an action before it\nis taken, but failure of a single channel will not lead toa\nshut down.\nnecessary for an interlocking. Failure modes of dependable. A simple electronic comparator that\nmicroprocessor-based systems are much more is monitoring the two outputs is not sufficient.\ncomplex and unpredictable than in relay logic, Secondly, there is the problem of common mode\nand their causes can be difficult to trace. These failure. Since both channels are executing the\ncauses include electrical interference, unstable same task, there could be processor problems\nsupply voltages, poor programming (leading or programming errors which would affect both\nto memory stack overflows, race conditions, channels in the same way. In such circumstances\ndeadlock, etc), derived requirement errors and there would be no disagreement between the\nmanufacturing defects. outputs presented to the comparator, and the\n, tem woul n ntly not shut down.\nThe architecture of the software-based syste ould consequently not shut do\ninterlocking must be designed so that the overall There are various solutions to these problems, of\n“Failure modes of _ level of safety is at least as safe as the best relay course, and different system manufacturers adopt\nmicroprocessor- interlocking, despite the relatively low integrity of different approaches. These may involve:\nthe component parts and the complexity of their , ,\nbased systems | 1 1 。 using different hardware and/or software for\nfailure modes. The basic approach is to have two as\n. ; . the two channels to reduce the likelinood of\nare much more separate processing channels in the interlocking, a oo\n; common mode failure (often called ‘diversity’).\ncomplex and each one executing the route requests from the\ndictabl control panel (or desk/VDU) in accordance with * more complex cross-checking of internal\nunpre Ictable the signalling principles and application rules for states, inputs and outputs between the two\nthan in relay the particular track and signalling layout. This is channels in order to detect faults.\nlogic.” known as a ‘two out of two’ (2002) configuration. * more than one mechanism by which a\nIn the event of a difference in the outputs from shutdown can be enforced (and employing\nthe channels (indicating an error has occurred), special hardware for the purpose).\nthe system shuts itself down and a safe state is These mechanisms are not without their\nenforced. In most systems lineside signals return difficulties. For instance, a lack of synchronisation\nto danger (stop) and points cannot be moved. (differences in timing) of processing in the two\nIn practice, achieving a safe shutdown is not channels can cause the two channel outputs\nquite as simple as it might at first appear. Firstly, to be different for short periods of time, even\nthe part of the system that compares the outputs though each channel is behaving correctly. These\nof the two channels and shuts the interlocking short-term differences may be interpreted by any\ndown in the event of a difference must be highly cross-checking as an error and cause a shutdown,\ncreating a serious threat to reliability.\n21",
      "source_file": "8_Interlocking.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 7,
      "text": "IRSE News | Issue 265 | April 2020\nFigure 7 — Most\ncomputer-based Project specific signalling logic\ninterlockings split configuring system to a specific\ntheir software and scheme plan and layout\nconfiguration into a Spe 。 gs ic\ncifi on log\n人moer oflayers, enaping c applicati Signalling logic and rules, typically\nto be used in many entered once per railway, common\ndifferent applications. re across all applications on that railway\nGeneric application softwa\nOperating system, created as part\nof product development, common\nGeneric product software across all railways where product used\nReliability of CBls Configuring CBls\nThe reliability of computer-based interlockings All interlockings must be configured for the\nis almost as important as their intrinsic safety. A particular track and signalling layout required\nfault in a relay interlocking (such as a failure of — a task generally performed by a signal\na relay) may cause a small number of routes to design engineer. In the case of computer-\nbe inoperable, but it is very unlikely to render the based interlockings, he or she has to produce\nwhole interlocking unusable and thus stop all configuration logic (program code and/or data) —\ntrains. But a computer-based interlocking that a process commonly known as ‘data preparation’.\ndetects a processing fault may shut itself down , eT , aT\ncompletely, stopping all trains in the area of The concepts of free wired and ‘geographical\nna: relay interlockings have their equivalents in\ncontrol. Most modern CBls therefore have built-in ; ;\nredundancy to improve reliability computer-based interlockings, each with their\nadvantages and disadvantages. Both make use\nOne approach is to have three processing of the duplication and redundancy techniques\nchannels in the interlocking, instead of two. If described above to achieve required levels of\none channel disagrees with the other two, a safety and reliability.\nmajority voting system shuts it down and the ; ; ;\n\" interlocking continues operating with the two The free-wired equivalent typically uses general\nThe safety ~ , | purpose safety PLCs which are configured for\n” remaining channels. This configuration is known h fi 7 | t Anotation k\nof the railway as ‘Two out of Three’ (‘2003’) and was popular ACN SPECING FallWay laYOur. A NOLANON KNOWN\n. 。 。 , as ‘Ladder Logic’ is frequently used to configure\nIS critically in early CBls when computers were expensive, the system, although it is also possible to use\nd because it used less hardware than the alternative y ‘ 9 . P ae\nependent not 1 fundamental Boolean logic or more sophisticated\narrangement described below. There is a marginal PLC proarammina lanquaaes. Ladder loaic\nonly upon the safety disbenefit in this arrangement, because prog g tanguages. ce tog\ncore interlocking _ very rarely it could be that one channel is correct resembles a conventional circuit diagram that\nand the other two are in error. In addition. if has switches, relay coils and contacts, and other\nproduct but the same software is used in all three channels electrical elements such as counters, latches and\nalso upon the then common mode failure remains a risk and timers. It ts therefore intuitively easy to produce by\ncorrectness producing three diverse sets of code and/or someone familiar with relay circuits.\nof the specific hardware to avoid such failures would be very The equivalent of a geographical relay\nlicati data/ expensive and create an even greater risk of interlocking uses a more conventional form\napp Ica lon data timing issues. However, the other safeguards built of microprocessor-based computer. The core\nlogic into the systems makes these issues extremely system (the ‘generic product’) is customised by\nunlikely in practice. incorporating standard software modules which\nAlternatively, some interlockings have a complete define how basic track and signalling elements\n, . operate in accordance with the signalling\nduplication of the two channels (i.e., two sets, , Rae\n, , , principles for the railway on which it is to be\neach comprising two channels) — a configuration .\n, : , used. This hardware and software package is the\nknown as ‘Duplicated Two out of Two’ (2X2002). ; i\n; ves . . signalling manufacturers interlocking country/\nIf one set identifies a disagreement between its ; , , ;\na ; client-specific product (known as the ‘generic\nchannels, it is shut down and the other set (which , . .\n, , , , , application’). The signal design engineer then\nis in effect a ‘hot standby’) continues to operate ae , .\n, , produces application data which defines how\nthe railway. This tends to be a more popular , «ps\n; . . a the country/client-specific software modules\narrangement in modern interlockings, as it is ; ;\n, are configured to represent the particular track\neasier to implement than 2003 and the cost of the ; , ,\nae . , , and signalling layout (known as the ‘specific\nadditional hardware is not such a big issue as it oe, .\nused to be. The set of hardware and software that application). The data format Is usually proprietary\nis acting as the hot standby must have all the same to each manufacturer's system.\ninputs and be kept in complete synchronism with In both types of interlocking, the safety of the\nthe controlling set otherwise the changeover will railway is critically dependent not only upon\nnot be seamless and some form of initialisation the core interlocking product but also upon the\nprocess will be required. correctness of the specific application data/logic,\nwhich is why so much effort goes into checking\nand testing it.\n22",
      "source_file": "8_Interlocking.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 8,
      "text": "IRSE News | Issue 265 | April 2020\nHigh integrity 2 Multicore cable,\nmulticore cable, 3 datalink or\ndatalink or 3 transmission\ntransmission ao system\nsystem\nNeighbouring\n1 U 。\ninterlockings Interlocking\nHigh integrity\nmulticore cable,\ndatalink or\ntransmission\nsystem\nHigh integrity High integrity High integrity\ncables cables cables\nPoints Train detection Signals Points Train detection Signals Points Train detection Signals\nFigure 8 — The Nowadays a large proportion of the data and Interlocking to control panel/desk\nAeroCAng forms re logic for computer-based interlockings can be interface\n‘safety layer’ of a railway\nsignalling system, generated Soe om ne signalling The signaller controls the movement of trains\nreceiving information sc “hey tore ca ment aes ele onthe. either by use of a control panel or by using a\nfrom and relaying status cant lo ore coal int i oe el Ns at 和 control desk and workstation. A panel is equipped\nto a control centre, onal or Ce whicPC Ing be de 50 if with a representation of the track layout, on which\ncommunicating with signalling scneme WAICT Cannot De Gesigned are buttons and switches for setting routes etc,\nadjacent interlockings, automatically. Simulation and automated testing and indications to show him or her information\nand controlling trackside ificati\nobjects. , sod ats eau’ the an of manus verineation including what routes are set, the positions of\naNd validation TEquIred. BECAUSE INENocKings trains and the aspects of signals. In the case of\nprimarily implement a set of logical rules they are a control desk and workstation, the signaller\nparticularly well suited to testing and validation has the same information presented to him/\nUSING formal methods and automation. Most her on screen and sets routes etc by use of a\nof the major interlocking suppliers have now keyboard and mouse.\nadopted these methods in some form and as\na result the number of errors found by more The interface with the interlocking is therefore\nconventional testing, particularly in the field, has two-way, with route requests being sent from\nreduced very significantly. the control panel/desk to the interlocking and\n. information from the interlocking being sent to\nThe interfaces between an the control panel/workstation. There is usually\ninterlocking and other sub-systems some sort of interface sub-system (either relays or\nIn a modern signalling system, an interlocking software-based) between the two.\ninterfaces with a number of other sub-systems. A typical control panel/desk will communicate\nThe three most important interfaces are with with several interlockings, as the geographical\nthe trackside equipment, with the control panel area covered by the control panel/desk is often\n(or computer workstation), and with other larger than that covered by a single interlocking.\nneighbouring interlockings. There are of course Where all the interlockings are housed in\nother interfaces, but we are not attempting the same building as the control panel/desk,\nhere to describe the architecture of a complete the communication with the interlockings is\nsignalling system, so they are not explored achieved either by multi-core cables or by a data\nin this article.\n23",
      "source_file": "8_Interlocking.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 9,
      "text": "IRSE News | Issue 265 | April 2020\n= & ns 4 - RAR\nPa ry re a 了 | ——— ee\noF nt se% 有 eee “—o,\ni ~~ “4h\nwn i\nDY\nFigure 9 - The use communications bus. If some of the interlockings circuits for operating the signals, moving points,\nof computer-based are in buildings some distance from the control indicating the occupancy or otherwise of a track\nmeriocking, and centre, then some form of remote control and circuit to the interlocking etc. The interlocking\nuse of nennork indication system (using, for instance, time- depends upon the integrity of these circuits in\ncommunications, division multiplexing) is often used to connect order to function safely.\ninterlockings to the control centre to reduce the , ,\ncontrol systems to amount of cabling required In the case of computer-based interlockings, the\nbe implemented, as items of trackside equipment are normally (but not\nin thi , It is important to note that all these always) connected to nearby object controllers\nin this example from aon .\nHong Kong MTR. communication links are not safety-critical (i.e. which provide the power for the equipment, pass\nThe interlocking they do not have to be SIL 4). The interlocking the interlocking commands to the equipment and\ncontinues to ensure ensures the safety of train movements even if receive equipment status information for sending\nthat the signalling there is a fault or failure in the communications back to the interlocking. The object controllers\n(Sareenforcec , links or interface sub-systems. That said, the are connected to the trackside equipment by high\nthe non-vital control interfaces and communications links must be as integrity cables as described above, and to the\nsystem above allows reliable as possible, both for normal working and interlocking via a communications datalink. Just\nthe railway to be in degraded mode situations. In both cases, the as with relay interlockings, the integrity of the\ny y g grity\noperated optimally. control panel or workstation is presenting the communication link is vital for the safe operation\ng\nPhoto Francis How. signaller with information about the railway, upon ”of the interlocking. The object controllers\nwhich he or she makes decisions regarding the therefore generally have a 2002 configuration\nmovement of trains. to ensure safety, and the datalink uses highly\nMany modern signalling systems include secure coding techniques to prevent (or detect)\n; 3 ng Sy corruption of the transmitted data. In some\nAutomatic Route Setting (ARS), a sub-system , ,\n. manufacturers’ systems the communications\nwhich automatically sets routes ahead of each rotocol is proprietary to their product. but\ntrain based on the timetable and, where conflicts P ot IS POP ry tO P , ,\n。 , increasing use is now being made of IP addressing\narise (eg because of late running), on a set of rules , , ;\n二 , , , techniques. Manufacturers still use their own\n“Just as for prioritisation of train movements. This relieves ,\n, , , safety and applications protocols, although the\nith rel the signallers of much of their routine work. So European EULYNX project is promoting open\nWI re ay far as the interlocking is concerned, however, it stardards for interfaces to educe si nana\ninterlockings, receives and acts on ARS route-setting requests life cvcle costs ‘ 3 3\nthe integrity in the same way as if the requests had come from y ,\nof the the signaller and the control panel/workstation. Interlocking to interlocking interface\nCommunication Interlocking to trackside equipment Interlockings must be able to interface with\n” _ interface neighbouring interlockings, because almost\nlink is vital for inevi | |\nIn the case of a relay interlocking, in most inevitably at the geographical boundaries there\nsafe operation’ y g.\" will be routes that have their entrance signal in\nP systems the items of trackside equipment (signals , ,\nints, track circuits etc) ted to th ′ the area controlled by one interlocking and their\ner ang oy rt ee Cc) are bles. with 4 dic ted exit signal in the area controlled by another.\nmer Ing 他 mu 站 The al a dedicate The route setting process is initiated by the\nPair OF Cores Tor each circuit, 1 ne cables are interlocking responsible for the entrance signal,\ngenerally specified an cnS COeC c men but requires action by, and information from, the\nte thee sckeide ern S, DO t adi 1 res! ot other interlocking in order for the complete route\nO MIE TACKSIGe ENVITONMENL, and in terms OF to be declared ‘set’, before the entrance signal is\nthe integrity and separation of each core. This is allowed to clear\nnecessary because they are carrying safety critical\n24",
      "source_file": "8_Interlocking.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 10,
      "text": "IRSE News | Issue 265 | April 2020\nIt is common practice, so far as possible, metros, anumber of systems already combine\nto arrange the geographical boundaries of the functions of interlocking and track-train\ninterlockings to occur on sections of plain line, messaging within the same system.\nwhere the interlocking arrangements for each A second possibility, and one that is already\ncross-boundary route are very straightforward. ; .\n, , , , being explored, is to use cloud technology\nHowever, this is not always possible, particularly , , . .\n, for interlocking. This has various advantages,\nin places such as complex station areas where , 。 aa ,\n, including cost, flexibility and, potentially,\nmore than one interlocking is required. In a: .\n, , , resilience. It also comes with challenges, not the\nthe case of relay interlockings, the interface a are ;\ni ; , least of which is maintaining cyber-security (and\ngenerally takes the form of high integrity multi- a\n, , ; therefore safety as well as reliability).\ncore Cables to link circuits in the two equipment\nbuildings — the same sort of cables as are used to Thirdly, we may see a move towards distributed\nconnect the relay interlockings with their items of interlocking functionality. In recent years the trend\ntrackside equipment. has been to place computer-based interlockings\n, , together in a single location (often co-located\nIn the case of computer-based interlockings, a ; . ,\n, . , with the control centre). In time this may change,\nhigh integrity datalink is used for the interface ; ; ; ;\n, , , with some interlocking functions shared between\n(bearing in mind that the two interlockings may ; , .\n. , , , , the train-borne and trackside systems. Indeed, it\nwell be in physically adjacent cabinets in an ldb d that this is already h ;\nipment room rather than in separate buildings) could be argued that this !s already Nappening to a\nedule | ) ‘limited extent with CBTC and ERTMS.\nHowever, the interfacing arrangements tend\nto be more complex than in the case of relay Even more radically, the train may play a key role\ninterlockings. The two sets of software have to in initiating the setting of the route ahead and in\nact together and perform ‘handshakes’ with each determining its own safe movement authority,\nother in order to set, lock and release routes. making use of train-to-train communications\n. . to do so. A more train-centric architecture will\nThe future of interlocking be adopted, with the trains being ‘smart’ rather\nAt the beginning of this article we said that than simply responding to movement authorities\n‘interlocking’ is the mutual dependency between issued by trackside infrastructure systems. Again,\n“The concept signalling functions (moving points, clearing suppliers are already starting to make some of\n、 P signals etc). We have seen how these interlocked this a reality. This may well lead in time to some\nof a physically functions are made real by use of some sort of of the traditional principles of signalling being\ndiscrete ‘logic machine’, whether mechanical, electrical challenged, such as making the distance between\n: : or computerised, which signal engineers call following trains dependent upon their relative\ninterlocking a ;\n. . an interlocking. In a modern signalling system speeds rather than always assuming the train\nIs starting to we might expect to see a relay interlocking or ahead is stationary.\nchange” a suite of computer interlockings housed ina .\nbuilding or in a cabinet trackside, connected Closing remarks\nto trackside equipment, the control panel/ This article has provided an introduction to\ndesk and screen, and to other interlockings by the technologies used for railway interlocking.\ncables and data transmission systems. But the Next month we will look at the functionality of\nconcept of a physically discrete interlocking is an interlocking.\nstarting to change. If you want to know more, some of the IRSE\nVarious examples come to mind. Firstly, in the textbooks cover the subject in greater detail. For\ncase of ERTMS Levels 2 and 3, there is a second many signal engineers the specification and design\nvital element in the system, namely the Radio of interlockings is at the heart of their careers. It\nBlock Centre (RBC), which links trains with requires knowledge, experience and expertise —\nthe interlocking, sending information about and it is vital to the safety of the railway. But if you\nmovement authorities, permissible speeds etc and = are new to the industry, don't let that deter you.\nreceiving information about the train speed and Instead, take every opportunity to learn from those\nlocation. Like the interlocking, the RBC must be who have the experience and knowledge.\nof the highest safety integrity. System suppliers\nare starting to combine these two functions on\nthe same computer platform, and in the world of\nAbout the author ...\nFrancis has been a long-time member of the technical knowledge and played a vital role in\nIRSE. First with British Rail/Railtrack, Atkins, as drawing younger members into the running\nthe technical director of the Railway Industry of the Institution and has encouraged and\nAssociation and chief executive of the IRSE. helped them develop their capabilities in both\nHe was an IRSE exam Thorrowgood scholar their professional and IRSE roles. He has given\nand served on Council for many years and was quiet encouragement and encouraged self-\npresident of the Institution 2012-2013. He is confidence in many of the rising engineers in\nwidely respected for his professionalism and the control and communications industry.\n25",
      "source_file": "8_Interlocking.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 11,
      "text": "Institution of Railway Signal Engineers\na\nBack to basics: Interlocking\neaveeme Francis How oe oe ee\nLast month in IRSE News there was the Checking route availability\nthird in a series of articles on ‘back to When a request to set a route is sent from the\nbasics themes, looking at the essentials of control panel/desk/VDU (or from the Automatic\ninterlocking’, focused on the technology Route Setting system, where one is provided),\nused. This month we are going to look the interlocking first checks that the route can be\nat the functions that an interlocking set in its entirety, and that the request does not\nperforms, and how these ensure the safe conflict with any other routes that have already\nmovement of trains. been set or are in the process of being set.\nThis article is no more than an introduction Without this check, the interlocking might start\nto the subject, intended for IRSE members moving points to set the route but fail to complete\nnew to the industry rather than those who are the process because one or more points are\nexperienced in specifying, designing and testing locked in the wrong position by routes that are set\nsignalling systems. for other train movements. The check is also vitally\nimportant for ‘directly opposing’ routes, for trains\nThe functions of a modern travelling in the opposite direction to the route\ninterlocking whose availability is being checked, and for which\nWe saw in last month's article that interlockings the point settings are identical.\nhave used a variety of mechanical, electrical, If the whole of the route is not available for\nelectronic and software-based technologies over setting at the time the request is received by the\n\"Signalling the years. But regardless of what technology is interlocking, it is rejected or ignored, rather than\na used, a route-setting interlocking must perform being stored until the route can be set. This is\nprinciples vary essentially the same functions in order to ensure a feature known as ‘anti-preselection’. Not all\nfrom country the safe movement of trains. These functions, railways include it, but it is often regarded as\nto country which are defined in the railways’ signalling good practice to preventa route request from\n7. principles and application rules, must be continuously trying to make the interlocking set a\nbut are similar compatible with the operational rules/regulations route that cannot (yet) be set.\nin their basic ; for Bre movement of trains, under both normal Route setting and locking\nrequirements pap: |\nThe signalling principles and application rules for When the route availability check is successfully\nthe interlocking functions vary somewhat from completed, the interlocking starts moving the\nare , points in the route to their required positions. It\ncountry to country but are similar in their basic may also be necessary to move other points that\nrequirements. The descriptions of the principal are not in the route itself, to protect the route\nfunctions in this article are based on the current from other trains in the event that they pass a\nsignalling principles used for colour light lineside signal that is displaying a stop aspect.\nsignalling of passenger railways on the mainline\nrailway in Great Britain and in some other When the points are correctly positioned, route\ncountries (they are relaxed somewhat for shunting, locking is applied to all the track detection\npermissive and freight movements, but these are sections that form the route, thereby reserving\nnot covered in this article). Where some railways each section for the route being set, preventing\nadopt significantly different practices, these are the points from being moved and ensuring that no\nnoted but are not described in any detail. conflicting routes can be set.\n20",
      "source_file": "8_Interlocking.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 12,
      "text": "IRSE News | Issue 266 | May 2020\n站 而 YN FAN | oe Cy 2 aan 4d it Pane, Fa) ¥? € - KR 中 [xy =f: .) AEN rod tg 4 6 Ds AN 加 5 中 a 2\noe say be f yay? , 一 一 A iv 5 52 Yo) + — an eran (wns) :'5 L oe, Tv ere ee 2d ha Cf ~\nTe ee ae Nepean mavens See e AUBURN eae EERE SE TN oe |\niY ORES oF | eicno5DOG SO\n—_ Pe ea nT ae Oa \\ \\ |\n”下 4 , 9) (NO at ae er ee puny zites ~ mene Es ap i ay 四 bs f | [> sat\n‘ 2. a YsT rf i J * : t . | - _ | 1 ow j .\nal Ss , Ci ne i Lae sect ap 5 oe ah A eaten if . ~~ oy” os\nee 二二 =f. 9a * baz eee | | E>... a 和 Vite\n-- - eT = ; ee) ene an Se See 一一 一 = an I -二“一- 本 heb,\nInterlocking has been an Overlaps feature known as ‘swinging overlaps’) by moving\nFor railway scfety since Many countries and railway administrations also the position of the facing points to create a new\nthe 1850s, although lock and protect a short section of track beyond overlap. This provides signallers with greater\n/ it i _eatti operational flexibility. The facility to swing an\nthe technology upon it the exit signal as part of the route-setting process. lap is inhibited by the interlocki th\ndepends has changed This is called the ‘overlap’, and it is typically overlap Is INNIDIted Dy tne interiocKing as tne\nphenomenally during between 50m and 200m in length. The provision train approaches the exit signal so that a safe\nthat period. Areas of of overlaps is not a universal practice, however. (locked) overlap exists in case the train passes the\npoints and Crossings are | Some railways do not use overlaps at all and, at signal at danger. Designing the circuits or data\nany interlocking design. the other extreme, some have overlaps which for swinging overlaps can become very complex\nPhoto Paul Darlington. comprise, in effect, all the track from the exit indeed, however, and their Provision should be\nsignal to the next signal beyond that. Even on limited to that which is considered necessary for\nrailways that use overlaps, they are not necessarily Perational purposes.\nrequired for all types of routes. Where railways do — The setting of an overlap happens only if the exit\nuse overlaps the rules for setting and locking them __ signal is at danger (stop), of course. If a further\nvary from one railway administration to another, onward route is set for the train, from the exit\nso it is worth emphasising that this description — signal to the next signal beyond, then that route\n“Some railways applies to main line railways in Great Britain andis __ js itself set and locked in the same manner as\n4 not necessarily true of other railways.\ndon’t use y y described above.\nis at danger (stop) and the train fails to come ;\n; When the route has been set (as described\nto a stand at the signal because of inadequate ,\n. , aL: above), all relevant train detection sections\ndeceleration, it is likely to stop within the overlap , ip . ,\n, , ,, , must be proved ‘clear’ (i.e. no train or vehicles\ndistance and so avoid risk of collision with other .\noe a present) before the entrance signal is permitted\nlegitimate train movements. Of course, it is .\n, , by the interlocking to show a proceed\nnot guaranteed that the train will stop within , ,\n, aspect. This includes:\nthe overlap, and an overlap is of no help at all\nif the train brakes have not been applied or the 。 All the track that forms the route between the\nadhesion conditions are very poor. It should also entrance and exit signals.\nbe noted that with cab signalling, overlaps have an sy. all the track that forms the overlap ahead of\nadditional purpose, to do with the accuracy with the exit signal (if an overlap is provided).\nwhich the train location is known. , , ,\n。 Any other sections of track on which a train or\nTrailing points in an overlap are set to the correct individual rail vehicle could stand and be ‘foul’\nposition and locked when a route is set. Where of the route (i.e. with which the authorised\nthere are facing points ahead of the exit signal train could collide).\nthere may be more than one overlap that can 。 Any ‘flank’ sections of track, which are\nbe used. These facing points must be set to the included to provide early detection of another\nposition required for the selected overlap, and train passing its own exit signal at danger\nthey may also be locked. The reason for not (SPAD) and thereby intruding onto the route of\nlocking the facing points in all circumstances the authorised train.\nis that in complex areas such as stations, the inth f lineside siqnalli ther checks m\ninterlocking may permit the overlap to be changed | he ren ° dbef © vhe Ing. 1 © saith ay\nafter the entrance signal has been cleared (a also De required berore te signal !s Pe ©\n21",
      "source_file": "8_Interlocking.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 13,
      "text": "IRSE News | Issue 266 | May 2020\n人\nal: rd a: a ra ‘A. Aa 地 FM 2.8% % — er ay? Luv\" < £m fom vay el | Rareagas * |\nae ey ye pote eae sae eee ace = % 和SEE\nSgt AIP ay 2 crs ea ot Wires | i Ps\nInterlocking design is to clear, including the following. Not all railways Route holding and release\nbased on th id if\nof conflicting routes, apply these checks, and the specific rules for When the train passes the entrance signal\nallowing for a wide applying them vary from one railway to another: (showing a proceed aspect), the interlocking\nrange of combinations of 。 The exit signal must be alight (i.e. displaying returns the entrance signal to danger (stop) but\npossible events. a visible aspect), to avoid the risk of the driver maintains the locking ahead of the train to prevent\nPhoto Paul Darlington. failing to see it. points from being moved and conflicting routes\n。 If the entrance signal is required to display from being set. In order to maximise capacity and\na route indication for the route set, that flexibility it is, however, desirable for the locking\nindication must be proved alight before the to be removed as soon as it is safe to do so after\nentrance signal is permitted to display a the passage of the train, in order that other routes\nproceed aspect. may be set which make use of the same track\n。 If the train is being routed over a diverging (or some of it).\njunction ahead of the entrance signal, that Before the locking can be released after the\nsignal may be held ata restrictive aspect (stop passage of the train, the route request must first\nor caution) by the interlocking until the train be cancelled. Traditionally this would be done\nhas ween Se for the diverging by the signaller using the control panel/desk.\npoints an © route eyond. However, to ease the signaller’s workload and\n. There may be other requirements that have to to enable the locking to be released as soon as\nThere may be satisfied before the interlocking will permit possible, many modern interlockings include\nbe other the entrance signal to clear, for instance for level a function called ‘train operated route release’\nrequirements crossings or train protection systems (the latter to (TORR), which cancels the route request from\nthat have to be stop, or mitigate the risk of, the train passing its the control panel/desk when the train has passed\n_ exit signal at danger). the entrance signal, without any action by the\nsatisfied before The actual aspect displayed by the entrance signaller. The interlocking normally does this by\nthe interlocking signal when it clears, including any speed or route — checking that the first two or three train detection\nwill permit the indications, depends not only upon the route sections beyond the signal show ‘occupied’ and\n。 immediately ahead, but also on whether a further then ‘clear’ in the correct sequence with the\nentrance signal route has been set for the train beyond the exit passage of the train (this minimises the risk of a\nto clear signal. The sequence of aspects seen by a driver train detection failure leading to the premature\nat successive signals as he or she approaches a release of the route). Although the route request\nsignal at danger (stop) varies from one railway to is cancelled by this process, the route locking is\nanother and is not dealt with in this article. maintained to ensure the safe passage of the train.\nOn most railways that use colour light signalling, The interlocking may also have a function which\nthe entrance signal will revert to danger (stop) permits individual portions of the route to be\nif the conditions that permitted it to clear are unlocked as soon as possible after the train has\nno longer fulfilled. So, for instance, if a track passed, rather than having to wait until the train\ncircuit in the route fails, or there is a loss of has passed through the whole route. This is\ndetection on a set of points, the entrance signal known as ‘sectional route release’. As the train\nwill automatically revert to danger. This is a safe passes clear of each train detection section\narrangement but can be worrying for a driver who in the route, the locking on that section is\nunexpectedly encounters a signal at danger (stop). .\n, released, provided that:\nSome railways do not include reversion — and\nof course, with mechanical signals there was no 。 The entrance signal has returned to\npossibility of doing so! ‘stop’ (danger).\n22",
      "source_file": "8_Interlocking.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 14,
      "text": "IRSE News | Issue 266 | May 2020\n。 The route request has been cancelled (either the sighting point of the first signal displaying a\nby the signaller or by TORR). caution aspect and the entrance signal displaying\ne All the route locking from the entrance stop. With cab signalling, the speed and location\nsignal up to the start of the section has of the train are usually known and can be used\nalready been released. to check the two conditions, which is a more\nRoute locking ahead of the train continues to accurate method of checking whether the\nbe maintained. conditions are fulfilled.\nApproach Locking Releasing the overlap\nThere is a further category of route release, If the exit signal is at danger (stop), and the train\napplicable only where the route has to be has safely stopped at it, then it is necessary to\ncancelled before the train passes the entrance release the locking of any points in the overlap\nsignal. Clearly this is an unusual set of beyond the signal. The reason for this is that\n“There are circumstances — for instance if the signaller needs the points may either not be set correctly for\nmany other to change the order of two trains at a junction the train's onward route, or because another\nf 。 after the route has been Set for one of them, or if train needs to use some of the track and points\nunctions that there is an emergency and it is necessary totryto i, the overlap\nmay feature In an _— stop the train. In such circumstances the signaller\ninterlocking” cancels the route on the control panel/desk, With lineside signalling, the interlocking times\nwhich has the effect of setting the entrance signal _ the train’s occupancy of the last train detection\nto stop (danger). This action does not necessarily section on the approach to the signal. When\nimmediately release the route locking ahead of the timer finishes, and provided that the train\nthe entrance signal, however, in case the train detection section immediately beyond the\ncannot brake sufficiently to stop at the signal and signal has not been occupied, the interlocking\nconsequently enters the route beyond it. will release the points in the overlap. With cab\nThe interlocking function that determines when signalling, the speed and location of the train are\nthe route locking ahead of the entrance signal is usually known and can be used directly to check\nreleased in the circumstances described above the train is at a standstill at the signal.\nis known as ‘approach locking’. In its more\ncomprehensive form, it maintains the locking of When the interlocking determines that the train\nthe route ahead of the entrance signal (which is is stationary at the exit signal, the locking of the\ndisplaying stop/danger) until one of the following overlap is released and the track and points in it\nconditions is satisfied: can be used for setting the onward route, or for\nrouting other trains.\n。 The train has come to a stand at or\nbefore the signal, or Other interlocking functions\n。 The train has sufficient braking distance to This article describes only the basic interlocking\ncome to a stand at or before the signal. functionality of a signalling system. There are,\nWith lineside signalling the first of these conditions of course, many other functions that may\nis usually achieved by using a timer in the feature, including:\ninterlocking, rather than directly confirming the * The role of the interlocking in displaying\nlaer y r med to eltner nave come toa , , . . ,\n, , Th f particul rt\nincluding the speed of the — stand at the signal or to have passed it, being Si » sled’ sails oe dictinat frown ppere\ntrains using ine ray unable to stop in time (in the latter case the 9 lled’ rail YS,\nand interiaces ro omer route locking holds the route safe for the train). signaled ralways.\nequipment such as level i ; , . .\ncrossings. The second condition consists of a check by the 。 Interlocking the signalling system\nPhoto Shutterstock/ interlocking that the train has not yet occupied with protection systems for personnel\nVanderWolf images. any of the train detection sections between working on the track.\nas 一 ae\n= a wo 本\n一-~ - , v 4\n—_ ACHT T=”\n23",
      "source_file": "8_Interlocking.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 15,
      "text": "IRSE News | Issue 266 | May 2020\n& fo)\n* =\n> w\nE ® BO © £\nSo 3 = * 3\nLE RS wo ®\noma) ” 工 no}\nFoe * 2\n人 2\nDR Qo\n> sé a\n& § lee 3 3\nx 233 |= 0 2\nre) SS 15 Q CD\n3 35 占出 | a nN\nggect* 8 5 @\n二\nOH S ce ro} & 三\no& £ |86 a - ao}\n2 a2 志 |9° 已 ® 名\na Ze eS ju出 x Me o\nfom 8 S$ 3\n—\n多8 > = = 3\ns| ees v o a\nS| 585 o = =\na] cf Die © oO\n80 oO 2 8 a4\n2 2} _3 80 s 2 38 Na\nQ20/ © Lim t D 已\n- 9 2 口 与 o\n二 tsa} PS2s 一 oO ® Q\nHoe as 了 c =)\n” c > © o =\n-| § 5 .器 2 5 与 8\nsys-s 18 BO S 2\nQU 人 cogir @ 2 c 也 ” = 5\n加 所 DeaMey | 各 © 由 9 Oo\n/| : & |<< £ o a Oo 二\nBs 3 = © Q 2c\nlog oa 2 Oo ®\n. “ 3 已 a §\n[oa aw a nes az © MW 如\n一 避 27 >o 2&2 c 9\nA A 77) Su o - 2.\na 2 <i ys < 石和三 Sa\n:| 四 9° c Ro]\n二|- - g > jog of 32> BOG\nS| < 2 § 6 2 86g © o 5\n- - o8 us 2 2 8\n5 > (s} 2ee\n= =“ xc 一 生态 mo & oO\n2 中 Ym CH o =\n3 o | Dn o Oo 2 三\nal] = Ba |k BpeSeGfasgeé\na © > o g O a © g\nun 63 20 Go DU 5 Oo 2H 上三 2 2\n2 ||- 2 [esslw e585 5s § a ®\n| 2 ale fe |p Pfs Io SRL Ese 5\n6 real Stade |S 一 ® fa} GUE Ps £3\na fe fe Fr re) 山 = Oo SB ewE SR OS¢\nS - RS cc § £ :2\na fe Io |” g = < 而 8 8 .DC | 5 3\na let fe fo 3 3 S ¢ 2 o Me ~ OO 2\n2 Wo SBoEun c5 BOS\n. a > oO © —~ OF FE GB\n| | |e. 2 1¢ Beat Bettas\nsft fee fa feu & 2 关ES 二 BE 局 6\n“: 1 yt fe fe ES 3 g SS 2 Peet 中Ra\n“ * a 3 13 Sse EE 2E RB 8 G\ne 5 o[* 25 o3 eof B23 BD\n\\ 0% ©£:'$g$256§ 6 3g\n18/3 8 g Ssxeageees\na Jo DUel E.G = 308 & ge @ § 8\nns 4 ®o| 5°o> o os 6 a DG Ww © o\nSoZ ¢ 二 ERX 2PSVBVSES\no SB oS £8504 5 5\na 2/3 2 o O@nHnOf HEF ee\n| & E 7s 9 or nomnd mW on\n& ° ~~ © a 二 一一一一号一一 一\nz om : a 和打 : Se 条 条 导\n“ no]\n1 =| 3 S\n£S| 39 + 2\nx to\n$a) 5% s = 3\n@2/ ss 山 € Le see\n的 3 BlSs5 了全 a ots\nane r= Q oO <E gn\noO ra is] Qa ¥ ao\noe fo} — > az\n£& 名 ra (oe 人 ra} Oo\nBo] 有 Ww: > 之 d\nog| & - 3: fo} E ole\nox oO oO c 切 和 7s\nO| & Ww = c = ox\nD 9 x - s = DZD\n中 w 2 : Ss 万 © 全\n© 出山 : S3of6US ous\nw so o ow <3\nge sr) CN 5S 四 和58\n与 着 名 oe ee o8F\n85 8a SB gq\ne~2 aB2 oo owe\n€°6 <w $56\ncL 二GD 一口 Mee\n= ®\n° 8 223 Sc Eoo\n8 5 SOQ Su OVE\n3 Sb we £23\nQQO|Cz ~ .-冲 al THe\n~~ 8 29H Go Fos\n3 0 oof Sf -~o0\no 2 RPVwe — © OQ\nLc ® oO ~ ow cas\nae; 一 ae) 22sec?\n2 2 B ae 509 B55\n& = - 一9R Ce OME\n《 “ oO ° ~ as 20 = eT\nv c a z ao roe ©5 22x\n_ . x c “一 OTM- oe0\n2 四 , 5 ¥OP Sa 559\nHPS 6 Sx 58 52%\nne a 2 F560 372 25\n~ ¢ aa S ares rood ZN >o 2 wee\nz Ses 9 moog E 了SU Bas\nSe Ee ee aE 5 E235 95 BHO\na ae 8S a S < 二 ce = aa oO 9 69 29x\nSs 8s ao 35 35 © SF = i » oFe 二8 285\nci ao. a2 OS DY c me o a fe} 5 0 oo 8\n与 —E2.,., 08S Z2cr\n3 3\nx S$. |< a\nSa e| N g° ° °\nEc¢3| wb 所\n> £ use\nSl od) OO Dee\nFigure 1 — Simple Scheme Plan, showing the signals, Figure 2 — Example of a signal/route control table for the route from signal B12 to B11\ntrain detection sections, points, overlap etc. This (as shown in Figure 1). Our thanks to Peter Woodbridge for creating this example.\nexample was used in a recent IRSE examination.\n24",
      "source_file": "8_Interlocking.pdf",
      "garbled": true,
      "garbled_reason": "cid_markers",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 16,
      "text": "IRSE News | Issue 266 | May 2020\nHowever functional : \"poo oma pied papain ee)\nimportant to ensure é ' t i ¥ AVE RY. AN NG 下 AA\nthat the information 9 mateo, i P mm , oY\nrelayed to the driver | | mk f a : i\nis clear and easily ae xr xs ‘FAN, 二 , 一\nunderstood, as an ae f \\ ee 5 AT i / NA \\ (MI BY\naspect indicating safe , 7 at re || ° Poth a :\nspeed (left) or route 7 7\nbased signalling. an | way CE 让村区全全 (8 MeV tee BS\nPhotos Shutterstock/ i as LT nee S128 oe 二\nMiles Schofield and | i ic oi 长过各 fl eee aie | aS\nPaul Darlington. wey 5 < ye ee Te aan\n. -\" re aig, Mg 0) Gane\n. | mi BASS a ere eB Al ,\n下一有\n。 The provision of train protection systems (which will be Control Tables\ncovered in another ‘Back to Basics’ article, soon to be The Control Tables state all the conditions that must be\npublished in IRSE News). fulfilled for each route before a train can be given a movement\n。 Interlocking with level crossings or other moveable authority to use it. The route information is derived from\ninfrastructure (e.g. swing bridges). the Scheme Plan- the position of points, the train detection\nSpecifying interlocking requirements sections that must be clear, other routes that must not be set\netc. Approach locking release conditions are also specified, as\nThe process for specifying the interlocking requirements are requirements for functions such as the delayed clearance\nfor a particular track layout is strictly governed by railway of signals at diverging junctions, and the aspect sequence\nadministrations (or in some cases their regulatory bodies), for successive signals. A simple example of a signal/route\nbecause of the safety implications of an error. control table is shown in Figure 2, for a route from signal B12\nIdeally, the starting point for the signal engineer is to be to B11 on the Plan in Figure 1. The requirements are based on\nprovided with details of the proposed track layout and the current British (Network Rail) signalling practice and include\noperational requirements. The first of these includes knowledge Some features (such as train protection proving and technician\nof the location of points and associated critical dimensions. controls) that we have not dealt with in this article.\nThe operational requirements include the frequency of trains, Control Tables are also prepared for each set of points, stating\ntheir maximum speeds and braking capabilities, the required the conditions that must be fulfilled before a set of points is free\nheadways and the specific train movements (main line, to move. This includes the routes that require the points to be\nshunting, permissive etc). normal or reverse, dead-locking train detection sections and\nIn practice, this ideal starting point is not always the reality! point-to-point locking.\nSignal engineers may, for instance be told to replicate the It is in the preparation of the Control Tables that the signal\nexisting signalling arrangements in modern form (which is itself engineer's knowledge of the signalling principles and\nan ambiguous statement), without being given any explicit application rules is of vital importance. From the Control\nstatement of operational requirements. Tables, the circuit diagrams for relay interlockings (based on\nThe signal engineer also needs to know the signalling principles standard circuits) can be produced, or the data in the case of a\napplicable to the railway for which the design is being prepared. Computer-based interlocking.\nThese are the high-level generic rules for ensuring the safe The production of the Control Tables is, therefore, a critical\nmovement of trains, and they cover all the requirements relating step in the design and configuration of the interlocking.\nto route setting, locking and release — and more. Nevertheless, the gradual automation of the design process\nThe knowledge of the track layout, the operational means that it is possible to go directly from Scheme Plan to\nrequirements and the signalling principles enables the signal detailed design, with the Control Tables being a by-product\nengineer to produce two key sets of documents. The first is the Of the process for later use (e.g. for recording tests performed\nScheme Plan, and the second are the Control Tables. on the interlocking), rather than being a key stage in the\ndesign process.\nScheme Plan .\nThe Scheme Plan depicts the layout of the track, showing Closing remarks\npoints, signals, train detection sections, level crossings, stations, This article and last month's have provided an introduction to\npermissible speeds etc. Each track is usually shown as a single railway interlocking — and if you want to know more, some of\nline, not a pair of lines. Each signalling object is allocated a the IRSE textbooks cover the subject in greater detail. For many\nunique identity (numbers and/or letters). The plan also shows signal engineers the specification and design of interlockings is\nthe routes that each train can take from each signal. Each route at the heart of their careers. It requires knowledge, experience\nis given a unique identity. Other relevant information may also and expertise — and it is vital to the safety of the railway. But if\nbe shown on, or be associated with, the Scheme Plan. Asimple | you are new to the industry, don't let that deter you. Instead,\nScheme Plan is shown in Figure 1, for a single line with a passing _ take every opportunity to learn from those who have the\nloop at a station. The symbols shown are used by many railways experience and knowledge.\naround the world, but are not universal.\n25",
      "source_file": "8_Interlocking.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    }
  ]
}