{
  "doc_id": "03d21228-0233-46c1-b992-bb3496e97039",
  "pages": [
    {
      "page_number": 1,
      "text": "Institution of Railway Signal Engineers\na _\n,\nBack to basics BACK =\nte i | Robert Cooke, Mark Glover\nis ol : NES & Richard Roberts\nIn this month's back to basics differences between systems in different Rail operations need to be organised,\narticle, three of the team behind parts of the world, but also a set of structured and integrated with other\ncommon challenges and approaches. transport modes. Densely populated\nthe new IRSE textbook, Metro\nTrain Control Systems, introduce The textbook explains: cities cannot function efficiently\nthe underpinning principles that “Metros differ from other railways in en Ser are\nmake train control for metro that they carry passengers only and y\nrailways different to other types run a more intense train service. They What does that mean for the\nsome of the unique challenges that P 3 , On the face of it, metro signalling sounds\nengineers working on this type of ground for the people who live and oN\n9 9 p work in them. as well as those who simple compared to complex main line\ntwork face and identifies some ’\nne visit and commute to them. They areas. The trains tend to move relatively\nof the solutions that tend to be range in size from a few kilometres in slowly, perhaps up to 80 or 100km/h,\nused when current systems are length, to those such as Tokyo, Beijing they accelerate and brake quickly, and\ninstalled or upgraded. or New York that are measured in they tend to ot the same lype and\n. IG configuration (but not always!). Tha\n\nWhat is a metro? hundreds of route-kilometres. They\n\nro move millions of people over relatively means they have the same, OF at least\nLet s start by considering what a metro short distances, sometimes for twenty- very similar, characteristics in terms of\nis. Metro railways are also referred to four hours per day. acceleration, braking and top speed, the\nby the generic term ‘mass transit’ and variables that most significantly influence\nby more local terms such as ‘Tube’ To do that successfully, the metro _ design. There are no slow-moving\nor ‘Subway’. There are often major service needs to be reliable and resilient. —_ freight trains to worry about, the railway\nMetros can be very varied in the way they look, the way they operate and the solutions adopted.\nFrom left to right, Beijing, Moscow and New York.\nPhotos Shutterstock/Markus Mainka/Volkova Natalia/Oneinchpunch.\n\nNN ESP orn\nSSS\nwe SSS. eee -\na i [ § 7 ky Ss: : AAA\njwise A . <€ er borr: ; x\n\n12",
      "source_file": "27_metro_train_control_systems.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 2,
      "text": "IRSE News | Issue 296 | February 2023\na a a ww, , - - = . 四 a a - \"ss “ = iat\nSs eee aa 中 了 x se a,\n一一人一一一\n~ 一 - — ee : - 一一 —_— - 一 一 .一 _.\naa kat ‘pot > {Se eer 1 SOLES abalone sae? recom «ens mera ae ~ <\nia 5 ~ Re aa! on -一 a 一 1 1 ae a\nMetros are complex systems of systems needing a range of solutions and interconnections. However when a railway is\nover 100 years old the challenges multiply. This photo shows cabling old and new and ancient disconnection boxes on\nLondon's Underground. Photo Pixabay/JLenio.\nis nearly always operated as a fully Some metro systems have been at all, with trains having to stop safely\nvertically integrated business, there are operating for a very long time, for immediately in front of an immoveable\nfew points, crossings and complicated example London where parts of the object such as a station concourse\njunctions and there tend not to be Metropolitan line have followed the or even a redundant tunnel boring\nconnections to neighbouring railways. same route since the 1860s. Paris Metro shield. Maintaining high performance\ner ; began operation in 1900 and New York running whilst ensuring that overruns\nHowever, a metro train will typically ,\nSubway in 1904. Clearly there have that may cause significant human and\ncarry several hundred people, often ; . , ,\n, been multiple upgrades on each railway material damage cannot occur is a\nup to 1000, crushed together in peak , ,\n, , over the century, but culture, historical significant challenge.\nperiods, at headways as low as 90s with ,\n, approaches and unique solutions to , ,\ndwell times of 45s at busy interchange . . Whilst some metros operate entirely\n: engineering problems have posed ab:\nstations through constrained end-to-end within busy urban areas,\n; problems ever since. In many well- ; ; ;\ninfrastructure and crowded stations. ; eg , others run multiple lines from different\n, - . established cities, it is not straightforward\nMany lines will be moving between to dia new tunnels through existin suburbs through common central\n20 000 and 50 000 people per hour g g g sections. One example of this is the Oslo\n; . 。 congested sub-surface areas, as ; .\nper direction. Managing that many , T-bane where there is a high capacity,\n, , demonstrated by the recent Crossrail ,\npeople, often in confined spaces, poses , low headway central section, served by\nproject in London. , 7 ;\nparticular challenges, some of which we trains running in from the outskirts of\nwill discuss in this article. One challenge comes from the the city. Finding a viable solution that\n, . . infrastructure that current railway allows economic fitment and efficient\nIt's true that the physics of trains are ; , , .\n, , engineers have inherited. There are parts operation on a railway where there is\nthe same whether you're moving at ; .\nof the London Underground network a 15-minute headway in places, but a\n80km/h, 100km/h, 200km/h or even , , ,\n, where there are no station overruns two-minute headway in others requires\nat 500km/h. Newton's laws apply , , ,\ndetailed systems engineering.\nhowever, the parameters can differ, >>>\nwhether that's train resistance, motoring\nor braking acceleration or adhesion, or Holmenkollen station on Oslo Metro. Whilst service on this line is typically one train per\na combination of these. This leads to direction every 15 minutes, trains on this route soon join the common central section with\nmetros offering a different challenge to headways around two minutes. This station is also designed to handle extremely high\nother railway systems. passenger demand during winter sporting events. Photo Shutterstock/Markus Mainka.\nae ee ee ee ee Be . °\nSo, all metro systems face the yay |= qj Bhi 6OF f 站\n2 _% $8 in an a an: 明 ,\nsame challenges? | ti cul: “La to J\nWhilst most metros face the challenges , 网 和 z Ci ey. 2 bom 四 |\nof moving large numbers of people Wwe on ae ee ee + 一人 | a\nsafely through urban areas, several , | cy \"3 , id a en Sa ‘ eich Tn ieee Cea\ni i : v - 加| 一 | ee pe . ‘\nfactors vary from city to city. Although est -到 站 hs wll Zt 1 等十: 一一 WE ZE\nin some cases, for example in China ner ls an ze A A <i | rent ee = |\nwhere there is rapid development of new . a | a a 2 ee | Mem i ak CR kd ald. gota ty:\nurban railways, there can be a relatively P Ny, * : mR tf.\nsimilar approach for new-build city Bis) el \" 全 ~ I man\nrailways, that is not the case for most on “Ez RAGING La 2 mabe i\nrailways worldwide. ys, 需 二 1) ar i 1H a Ma\"\n13",
      "source_file": "27_metro_train_control_systems.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 3,
      "text": "IRSE News | Issue 296 | February 2023\nSome of the busiest mass transit systems signals, and the design of the railway trains to run closer together but also\nin the world can be found in areas where _ provides an overlap beyond each enhanced control of the running profile\nthere are monsoon downfalls at varying signal, the length of which is designed of each train and optimises the collective\nintervals. One example is Singapore's to emergency brake a train to rest behaviour of the service.\nMass Rapid Transit (MRT) system within the overlap distance to prevent , , , ,\nwhich has sections both in tunnel collisions with other trains/buffer stops The efficient operation of a metro Is\nand on viaducts. or derailments at points. Where close dependent on the provision of a highly\n\nstopping to buffer stops or trains is functional control centre system.\nEnsuring that adhesion is adequate . Automation within these centres has\n\n, , required speed control of the train on ,\nto run at close train intervals in again developed rapidly in recent\n. the approach is Supervised by the ATP to\n\nthese exposed areas requires a clear reduce the required overlap distance decades, and these systems have\nunderstanding of the odometry used on , been referred to as Automatic Train\nthe train to determine current speed and = Since the 1960s metro railways have Supervision (ATS) since the 1960s,\nlocation and dynamic reduction of brake invested in technology to allow recognising the way that technology\nrates when low adhesion conditions are performance to be increased whilst either enacts decisions or advises staff of\ndetected with rain detectors at stations. maintaining safety. The provision of ATP the optimum choice that can be made.\nThere are many other examples of has been combined with Automatic Train . . .\nrailways that must deal with extreme Operation (ATO) in many cases, allowing What is Automatic Train\nweather conditions, be it extreme trains to be driven by on-board systems. Supervision?\nheat (for example Riyadh) or passing This automation has allowed trains to A modern metro cannot function\ntyphoons (for example Hong Kong be driven very close to the safe limits effectively without ATS. As well as\nor Taiwan), where the forces exerted protected by the ATP, allowing optimum managing the signalling and train\nby high winds can impact braking use of the capacity permitted by the control systems, the ATS will typically\ndistances. Extreme weather has other infrastructure to be achieved. have interfaces to other systems such\nimpacts, h as for n PSD (Platform\nto be considered for the platform-train of technology had reached a point Control and Data Ac uisition (SCADA)\ngap, this can also be an outcome with at which the first Communications: systems that control the traction\ntunnel ventilation forces if they are not Based Train Control (CBTC) systems vr and station equipment, and now\nconsidered correctly during design. could be introduced. Commonplace is ae\n\nfor new-build metro projects and emerging as a requirement the Rail\nDo all metros have full train upgrades, CBTC systems continuously REANS) ies Management 这 stems\ncontrol systems? update the position and speed of used to opumise Maintenance\n\neach train to determine the safe and asset replacement. With trains being\nNearly all metros have full speed and distance at which they can automatically driven, the station to\nsignalling systems. travel at every point along the line to station run times are more predictable\nThe vast majority also have at least ensure the safe separation of trains. than when driven by human operators\na simple form of Automatic Train The communications medium of the that have individual driving styles.\nProtection (ATP), based on the use of earlier systems was typically inductive With predictable and adjustable inter-\nmechanical or electronic trainstops that | loop systems in the track, but today’s paren run-times the Automatic Train\ncan cause a train to apply its brakes systems are typically based on radio egulation (ATR) function of the ATS can\nshould it pass beyond a safe location. communication. CBTC’s ability to regulate the service to maintain/restore\nThese are linked directly to trackside provide constant updates not only allows the timetable or desired headway.\nSingapore's new NSEW lines control centre, home to high-performance\nATS and SCADA systems.\n\nZamen - 7\ncm - ee)\nag | A. = aa :\n. ey Coa. -\n5 、 如\n\n14",
      "source_file": "27_metro_train_control_systems.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 4,
      "text": "IRSE News | Issue 296 | February 2023\na3 24 . % ve . | “3 ae : tae = 一 FF\naad awe a a a eee\nTV. - we - -. Sat, © Sat etree\nert ‘ <A a wee \"4, 四 . . . !\nPe ae , : ‘ hs,\nPe eae ial eee Seer\nOne of the most common systems that metro signalling systems have to interface with are\nPlatform Screen Doors (PSDs). These half-height units are in Singapore.\nIs there an ETCS/CTCS type definition of the air gap interface means For new underground metro systems,\nsystem for metros? that onboard equipment from one the ATS system regulates the number of\nThe lack of ts f company can be expected (guaranteed?) trains permitted in a ventilation section\na ac bility betwee s et 1 to function properly with trackside to ensure smoke control strategies can\nip tt \" , ny nen ther: ‘he ways, equipment from other companies. move smoke away from passengers\nme variations beiween tem, We Way Dnt tectat ngs in the event of a fire. This is supported\nin which they have evolved and the Whilst initiatives such as the Urban , , . ,\nae , ; by the ATS providing train location\nfact that a limited number of train Guided Transport Management System , gs\nre information to the ventilation system\ntypes operate on them has led to no (UGTMS) specification and IEEE SCADA so that the best tilati d\nlobal standard being adopted 1474 series before that, have sought So mat te Dest venmanton an\nfo date. Th + situati th t to make somethina a ‘ roachina a evacuation strategies can be presented\nun ber of su lier ha «creat d standard, the reatest pro ress towards to the operator. The ATS also manages\nsma voter vet ve whict, ave creais *andardisation has been 人ve bv some train movements and authorities to react\nupdated sy ter ‘sar b s don. ith r ou of the railways that are large enou h to fire detection, for example holding\nin, ared sys ded tne ase be wi iy to require it 六 their ocurement 3 trains that have reported a potential fire\nhaving a erale te, On usually Cesset In Paris the Ouraaan project on board at the next platform to facilitate\naving a single system SUPPIer. P gan Proj evacuation and not dispatching trains\nt dificati d and on New York Metro the Canarsie towards fire incidents\nte alle the b moa te a “, ma 4 line project have aimed to create ;\n\neth ti © they a ain 4 i © ‘ed t ” environments in which more than one One of the most common systems\nit nec! sl ie are that th vere li 0. supplier can deliver current and future that metro signalling systems have\n\nes si ye 机 “ 机 SUPP ‘ak systems based on common interfaces, to interface with are Platform Screen\nor orbo ui also fo © but these are based on the specific Doors (PSDs) which provide positive\nATP op TATO functionality even it the needs of those cities. Other cities have segregation between trains and\ntrai on wee. lona i sci t © d ended up with de facto standards, for passengers within stations. These\nwy th “Thic “th te tne manurac ont example on the London Underground are used for environmental reasons,\n\ny cyt IS aITECts h ities ag thay one supplier has provided systems for ensuring that station systems operate\nanaes a ahd authorities as they all except one of the new railways or efficiently without trying to air condition\nme ae e s ave 让 common yee line upgrades of the past twenty years, tunnels, and for safety, allowing trains\n1 ew mn tot ech which, suid, e i\" despite competitive tendering. to enter stations at full line speed,\nral line 的 ina dif w . cen (eve 。 if braking distances allow, whilst\n和 a the. aving ol tiers) nthe even What else is different keeping passengers away from the\nterm maintenance and obsolescence «DOE Metros? track. Dwell times can be managed\nissues these create There are a wide range of interfaces efficiently, providing another piece in\n\nthat metro train control systems the jigsaw of ensuring the delivery of the\nCommon standards like ETCS bring must deal with that main line railways highest capacity.\nCommerce acvantages ey to typically don't. PSDs have to interface with train and\ninp 了 On the trackside these can be as diverse _ trackside equipment, ensuring that\nbe able to make comparisons between . both train doors and PSD ration |\nmultiple suppliers when purchasing as interlocking to flood gates or bomb 9 aln GOOrs a Operation Is\n1 .2 blast doors that block tracks, they can synchronised to reduce the entrapment\nand to be confident that if extensions or sk of b h ,\nalso include detectors to ensure that big rsk Of passengers between the train\nreplacements are required, they can — at d PSDs. Th fail\ntrains can't be sent down small tunnels an Ss. nere are various Iallure\nleast to some extent — be procured from , .\ncompeting companies. The detailed or a wide range of protection devices modes that need to be dealt with which\nPenns P to allow track access for maintenance. increase the complexity of the interface.\n>>>\n15",
      "source_file": "27_metro_train_control_systems.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 5,
      "text": "IRSE News | Issue 296 | February 2023\nWhat does a typical metro same section of track. Interlockings ATO is the subsystem that drives the train\nsignalling and train control are directly responsible for the safe between stations within the constraints\nsystem look like? operation of trains and so must be established by the ATP subsystem.\n\ny _ designed to Safety Integrity Level (SIL) 4. The functionality of the ATO will vary\nThis section describes the typical The interlockings react to commands depending on the grade of automation —\narchitecture and subsystems of a CBTC from the ATS system to ensure that if the railway is fully automated the ATO\nmetro train control system, as shown in _ trains are routed in accordance with will need to replace all the functions of\nthe simplified block diagram in Figure 1. _ the timetable. the driver in normal operation, degraded,\nThere are subtle differences between Metro railw tend not to need emergency and fault modes. Actions\nsystems from different suppliers as etre fa ach © ie oO nee i ne are either automated or remotely\ndelivered to different cities, but the basic aa \" we wie . there is x ra controlled from the control centre. The\nfunctions remain the malian although driver at the front of the train instead ATO replaces the train operator but\nin some cases they are delivered by they relay all necessary movement one of the goals for automated systems\ndifferent subsystems. y reray ssary is to eliminate the errors that humans\n\nauthority information directly to introduce. so the ATO subsystem is\nAs in most signalling systems for any onboard computers, or to the cab if typically defined SIL 2 y t\ntype of railway the heart of the system there is a driver ypically denned as a system.\nis one or more interlockings, or devices Allocation of SIL to the subsystems has\nperforming interlocking functionality. The ATP subsystem determines the varying approaches, in that respect\nThe interlocking may be combined with limit of movement authority for each metros are no different to other\nthe ATP into a zone controller or work train, which determines where the railways, a balance is struck following\nwith a separate ATP system. Unlike main train is permitted to travel, based on the requirements and guidance from\nline systems that have equipment rooms the routes set by the interlocking and governing standards, but that outcome is\nand remote line side cabinets metros the position of trains within the route. not identical for what may appear to be\nhave restricted space in tunnels and with The ATP determines the position of all the same system function.\nATO provide a high-risk environment van ails train tec reports anavor ATP systems need to know both where\nfor maintainers so active trackside ey i 9 an ec on es at the train is, and how fast it is moving,\nequipment is Kept to a Cr Metros S stem “ATP subs “terns also supervise © toa high degree of accuracy all the\ncan have a range of architectures with an vovernente and ensure nat the time. CBTC solutions are moving block\nthe most common being centralised or | horised 7 systems where the available block length\nsectorised with sectors of two to three one y occur on authorise on he to the train ahead or other obstruction\nstations which minimises the impact ofa the Correct direction and within the determines the maximum speed a train\nsector failure. limits of the movement authority. The ;\n; can travel and as the train ahead moves\nATP supervises the safety of all train so does the available block. This means\nThe interlocking subsystem is . movements whether train controlis from that safe operation is entirely dependent\nresponsible for the safe routing of trains the ATO or the train Operator, and asa upon havin this formation svailable\nto prevent collisions or derailments at result the ATP is also designed to SIL 4. all the hme co the decision not to avol\njunctions and for preventing trains from = ATP equipment is situated trackside th brak b d PPly\ntravelling in opposing directions on the and on the train. & emergency Drakes can be made.\nThis is typically achieved by combining\nFigure 1 — Simplified block diagram of a typical metro train control system.\nKey:\nai ATP Automatic Train Protection System PS\nai ATO Automatic Train Operation System Stat ¢ SSE ? .\nGBP ATS § Automatic Train Supervision System ta Point Switch CEZ\nCy CBI Computer Based Interlocking System Protection on wren 一 SEA\nPSD Platform Screen Doors Emeraenc Key Switch Tr s\nc= PSDC Platform Screen Doors Controller Sto Pun y\nSCT Signalling Control Terminal P g\nC= TDMS Train Data Management System | oA tai S\nRadi p Y\n_— gi ek\nRadio Antenna 医 ER 二Foc>\nae SB Re | =\"\nfF Tous Beaco A < ”2 oe Local ATS e\nEvent eed \\. 人> ss\nRecorder Pa Gg nS CS\n@ CentralATS (2 &\nSpeed p- Lp & es System ¢ &\nSensors Lf <作, oe & SS\nAj mergency Vital 2 sb , ; LY\nee Signalling & | ; (e)\nASS scT 区 Pe, Control Panel Rs oe : te,\noer ‘ Kor\" 学2 Ge Overview ff , ET\n5 Ke CS Display of 了 a ron £\nAC w) CS SCT: ae OS\nCS “ae » Leen Ss\nsae o\nBT SF\nCag As\n&\n16",
      "source_file": "27_metro_train_control_systems.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 6,
      "text": "IRSE News | Issue 296 | February 2023\nFigure 2 — Grades of automation and the differences between them.\nGrade of , , Setting the train Stopping Door Operation in\nautomation Type of train operation in motion the train closure the event of\ndisruption\nOperator only,\nik _ | jf ft\nATP and Train Operator,\n1 - Non-automated Train Operation\n(NTO)\nATP, ATO and Train Operator, , ,\n3 Attended, Driverless Train 。 。\nOperation (DTO) Automatic Automatic\n4 L Automatic Automatic Automatic Automatic\ninformation from multiple systems mandating 4G as it is deemed less Finally, GoA4 railways need no-one\nsuch as a tachogenerator or speed prone to interference. With IP based on the train. They have sufficient\nprobe determining how many times a communications between sub-systems automation to fully manage the\nwheel has rotated, a doppler radar or the CBTC can effectively be bearer opening and closing of doors, making\naccelerometer to allow adjustments agnostic if the required bandwidth and the decision to start, and dealing\nbased on wheel slip or slide or changing _ availability requirements can be met. with the majority of failures that can\nheel size, lut iti ; ; . |\nwheel size, and absolute position The ATS subsystem is responsible for the occur An example would be Line 14 of\nreferences based on trackside beacons , ; , the Paris Metro.\nwhich are read by the train as it passes overall line control function, presenting\n. the status of the railway to the operators, GoA3 and GoA4 systems need to be\nover them to assure location. ; , . . .\ncontrolling trains and providing the designed with appropriate obstruction\nFor modern CBTC systems there operators with tools to both configure detection and mitigation — there isn't\nwill be additional functionality that the timetable and the ability to intervene an operator looking out of the front\ncould be included as part of the ATO when the service deviates beyond the window to identify that the train is likely\nsubsystem or by the provision of an recovery capability of the ATS subsystem. to hit, or has hit, an obstruction. This is\nadditional processor unit. The Train Data . straightforward for tunnels, but not so\nManagement System (TDMS) provides Grades of automation simple for metros operating at grade\nan interface between the signalling and As technology develops the level or on viaducts.\ntrain systems for functions that rt of automation of metros is rapidl ; ; ,\n2 , , F GoA4 railways require detailed systems\ntrain operation but are not directly increasing. The level of automation ; a\n. . , , , , , engineering to establish and mitigate\ninvolved with the train driving. This is generally measured by a railway's , , - ,\n, , , the risks associated with not having an\nis especially true for fully automated Grade of Automation or GOA as ;\n: , , , ae operator. This may involve the use of\ntrains that need to be told to ‘wake illustrated in Figure 2. .\n, , PSDs to manage the platform interface,\nor ‘sleep’, configured for the correct , , ; , ,\n, GoA2 railways retain a train operator in or having enhanced communication\nmode of operation such as heating,\n, , , the cab but use computer Systems to systems to allow control centre\nair conditioning, lighting controls, , , ,\n, - drive the train from location to location. operators to talk directly to passengers\nclosing dampers for train washing and ; ; .\n, ATP is required. In the event of ATO when issues arise.\nthe co-ordination of isolated doors ; ;\n, failure the driver can operate the train. ,\nfor PSD operation. , Some key requirements are redundancy\nAn example would be the Central line f ‘oment to prevent stalled trai\nCommunication between the trackside of London Underground. GoA2 systems OF equipment to Prevent stanea srains,\n; . , critical alarm reporting from train to the\nand onboard systems is established form most metro train control systems ae\n, , , , , , control centre and passenger-initiated\nover a trackside radio system providing currently in service around the world. .\n; ; . . safe evacuation in tunnels. These are\na highly reliable link over which high ; ; “es nen\n; GoA3 railways no longer need a full-time generally specific to individual metros.\nintegrity data can be transferred. , , ,\nThere is a range of ways of making operator in the cab. Whilst there is still It’s all about\nthis happen. for example using highl someone on the train who can operate it sSatl abou\nus rrappen, pr g ngny in the event of system failure, the train's system engineering\ndirectional antennas or leaky feeder systems are entirely responsible for the\ncables in tunnels or more conventional ” eration of the bain The operator is The systems are typically well contained\nbase stations in open air areas. Many freed up for passen er interaction An ane ere ne are challenges tke\nsystems use Wi-Fi in the ISM (Industrial, Jy OE NT level crossings (although some metros\nScientific and Medical) bands but can Reilwe in London 3 do have them) or frequent trespass\nalso use 4G/5G, with cities in China MA : incidents, however this is balanced o>\n17",
      "source_file": "27_metro_train_control_systems.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 7,
      "text": "IRSE News | Issue 296 | February 2023\n\\\n. 7 es |\n, 上 -一, -... -,1 mee ;\nAe Pe\nLondon's Crossrail project, now operating as the Elizabeth line, made extensive use of integration\nfacilities to enable the introduction of CBTC operation in a highly complex configuration.\nagainst the fact that metros are optimising safety and performance. Old centre in Singapore, Melbourne has an\ncomplex systems of systems. Each systems are generally more of an ALARP __ Integrated Test lab (ITL). Test tracks are\nsubsystem, for example ATP or ATO, (As Low as Reasonably Practicable) essential for modern complex CBTC\nare complex systems in their own right, approach to get as safe as possible systems to ensure that the signalling\nbut the overall solution involves myriad given the constraints. The term ALARP equipment is fully integrated and\ninterfaces and interactions which need is subtlety different to SFAIRP (So Far tested for all trains before delivery\nto be fully understood and managed As ls Reasonably Practical), ALARP to the customer.\nif overall requirements, including and SFAIRP both have the concept of . . . .\nsafety and capacity, are to be met and implementing hazard controls if practical Delivering metro signalling and\nproven to be met. and not grossly disproportionate to the train control systems\nSystems engineering underpins the benefit, however ALARP is presented as In metro railways we refer to ‘greenfield\nsuccessful deployment of most metro fav pg a reno SFAIRP does notand — and brownfield’ sites. Greenfield systems\nsignalling and train control projects, with ores evigence that FoSS eea SC are provided to new railways that are not\nthe ‘V’ lifecycle clearly and accurately and relevant hazard controls have been ”currently in operation. These projects\nimplemented throughout. considered and included, unless they are —_ generally involve extended tested and\ngrossly disproportionate to the benefit. trial operation phases during which the\nReliability, Availability, Maintainability Computer simulation is widely used to systems that were proved in the off-site\nand Safety (RAMS) are evaluated in ensure that the equipment provided integration phase are proved to operate\ndetail throughout metro projects delivers the performance necessary as expected in real life situations. Whilst\n(as explained in the article by Boyd This is the only realistic approach for not straightforward for complex modern\nMcKillican in IRSE News January 2022, CBTC systems to determine where the railways, this has the advantage of not\nnse info/irsenews29®) Reliability and pinch points are as traditional signal to impacting passenger services. This\nmaintainability directly drive availability signal type headway calculations are may require an additional temporary\n(how much of the time the railway is not applicable when multiple trains control centre to deal with the migration\navailable for service being based on how ”can enter a route. This has been a as a line will typically open in stages.\noften individual parts go wrong and how science developed since the 1980s Great care has to be taken during the\nlong they take to fix), and safety in turn and is depended upon by railway migration testing to ensure that the\nCRPenC wi me system operating as authorities and suppliers alike now. stages under test do not affect those\nplanned. it any Mass transit system For more information about how this already in service.\noperating at high passenger loads, a works see the article on the topic B field d\nstopped train can in itself be dangerous, in the May 2022 issue of IRSE News f oxictin Se in Upgrades\nparticularly if traction power has to be (irse.info/irsenews288) 9 existing rallways. in some (rare)\nremoved and air conditioning/ventilation ‘ Cases itis possible to shut down the\nis no longer operative. SIL levels of the System integration is also essential if railway completely and carry out the\noverall system need to be apportioned multiple systems are to be brought engineering in the same way as for a\nto subsystems to ensure the rate at together smoothly and all interfaces greenfield site. However, reality is that\nwhich unsafe conditions could occur proven before delivering solutions on if there is a business case to upgrade\nare clearly understood and managed. the railway. A strong example of this is an existing railway it is likely to be an\nIn the same way the impact of failure the integration carried out for London's important transport artery, and closing\nmodes and their criticality needs to be Crossrail over the past couple of years. it Is not likely to be viable. Upgrades\nestablished throughout the engineering Full emulation, and later target hardware, therefore often involve complex\nphases of projects in order to ensure that ”of the three signalling solutions andtwo “migration from old to new systems\nthe required levels are met, not just on ATP solutions on the line were integrated USING overlay or underlay’ approaches\nopening day but throughout the service __in the lab with train carried systems and _ that allow both old and new systems\nlife which can typically be 20 to 25 years. PSD control equipment to significantly to co-exist for some time. This can be\n| de-risk the hugely complex project. hugely complex in terms of managing\nModern metros are designed to deal Other railways take similar approaches, train fleets, especially if the rolling _\nwith such incidents andthe CBTC for example Singapore's LTA mandates stock is not being replaced at the time\nee 9y is consieree wnen Planning the use of offsite test track testing as of the upgrade. There is rarely enough\nEaine In terms OF OVErUNS an well as building an integrated test track space on a train for two types of ATP/\n18",
      "source_file": "27_metro_train_control_systems.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 8,
      "text": "IRSE News | Issue 296 | February 2023\nATO equipment and their associated With the high development costs isolation from one another. The result\nperipherals, and interfacing two systems of new products suppliers are now of this is a situation in which proprietary\nto one train can be challenging. Space starting to use generic hardware that train control systems are procured and\nhas to be found – or created – for can be configured for either main line altered to meet the specific needs and\nexample, under seats or in cubicles or metro use, thus providing a larger expectations of different railways, and\nadded in passenger carriages. user base which makes obsolescence standardisation is limited.\nmanagement more cost effective with a\nMigration in this manner can There are many common elements to\nsmaller range of products.\noften take many years for any most solutions, and nearly all modern\nappreciable size of metro. People and skills systems are based on CBTC technology\nwith varying grades of automation.\nMaintaining metro signalling Whilst many of the skills necessary\nDevelopment is rapid, particularly in\nfor metro signalling and train control\nand train control systems Asia, with high rates of investment\nare the same as on main line railways,\nKeeping a metro system operational in sustainable, highly reliable, high-\nthe experience gained of delivering a\nonce it has been installed can also offer capacity public transport systems. Many\nparticular type of system or meeting\nchallenges. In most cases the foremost of the skills necessary for deployment\nthe needs of a particular railway can be\namongst these will be getting access of these systems are common with all\nhard to gain and maintain. There tends\nto trackside equipment to carry out other types of railway engineering, but\nto be a migration around the world as\nmaintenance. Many city railways operate there are specific requirements around\nthose people with that specific metro\nfor 24 hours a day, most only have brief some techniques.\nknowledge are encouraged to move\nshutdowns of four to five hours per\nfrom city to city as major innovative This is a fascinating and complex area of\nnight. The time available for safe access\nprojects are undertaken. our industry, and one in which there is\nis then further limited by the need to\nsignificant growth\nremove traction current and prove the With processor-based systems it is much\nand opportunity.\nrailway safe – and the time necessary harder for authorities to fully understand\nFor more\nt c l o l a c w Oe io n ta aff o b r ret ate srr r h s tn ki i ore eh e e iws lnd de edu N gh sur o or e cie a wc cu uw e i h et lt t h nwh , , d Y ia ca oa ca o l l elt t hly el o hr a . vp ck fw ef A e u alt rSa le nlsf tn u fiwer r s l t ab aw st uh lih wa sn tp ine olr ha s s pad etyw iti o nl ) o ws w s ro tht t a roka ar a ombk eff y rv dk ies dh e eh u p i ( ia sa rm f ce s ue rv e. b ug c nueb en f. tl c e ut i is p n n o tie a rp ia i g n o tn f nl hre e a n gt el ls .y r t t i g s a p n d unh h y ca nr ee e e os cP i ve dn t y pe ea det ee e rp lrs m rod i tic pe ets o p ih s.t itnb n a mTn eu a gy nr nho r p y e iw e b nsul no st l uo gs h ah tog r, r ca e oef ky kt tkri h n f i wr d w nt e b oth o e ag he o we rsw r o xo eky at ln s e oi .n rtl a ee l dAy slr o oa p gse s st bb l k e e uh d ab t is p la ne a fs u l os st pyir y n u i rs oc n ari c tn e two nd re hh tg l du ua m ih e n la syu ed t gs t- ds hn n r bb ew y etRl eMeMece Msmc hsmmca sEmmo se sEm co sesse E o seIss e u op n tIs eb au onyp n tI epb au onyp rn to npb aA ny r re dfo c np isy r or w e d‘fo c niish ny or o e dot‘f cim st th ny op ot oa ct‘ elm t th nop tohTa ct e h lm t its up eto h tTa cp e ht l c iue Tao ih tT st ipw ht rlc iue Ta eho i tt iphdw tmht e rfi lco i Taih mii dt il hdw mh e rnfit leo r au i lih msi dal nhd mmh e n fit eo ri u i limsi dea l nemo n t e rae ei cui lif sM vea nemo e ae ei ca ei if spsM vne t eo e s e ae e ca eie if sps aM v sn tn t es iea eem i gsps ah sn tn T t .is isenem i lngm ah sn rnun tr .d i is n m si lb n gm re h bh ns r enu r .d i t sg n s lb n m re b vn rar o enu ri T d t eg sb e re b v ar o eei T o gtn weg n al e t vl ara oe mi To o Rgn wen C ai al e at il aet e moo Rgo n wen h Cp ai al aatr il n at e mo nRo eh Ce p n ai a c daar ipnrt e no h e p rn oa tc aj a ir pnro b v ng e r on oa t c aje eo iprao b o tv g ee ry odht o t aje eo iidao b o tv g h eoe y odht i e eo ieda hcok tp h eoe lt i ydht iii ed rl hc nk p h o d l ne t i r iovi se reT l hc nk pn sd le n e dt i sro fvi b s re aT , ll nonP sd e n e dl sr o fv bsTe aT ,l on s e d ts ler s t fr e b cTa,l s oc tsn ler d te r ta e ciT rso ece r tsn er tt r n te r taa e ci c rso ence rn tt i r ne itaa i s asc ra oo ene orko ro tt i ra niud sa gs aosc a ot n otkvo ro i f aiudi s gs atos a oo t otkvo rao e f audi s g s etp oho t ’ wn tiv a e ffi ff li rf s tpah tte eo ’ n wn i a e n ffi fg lrf sm pah tte e ’ n wn i i e b nffi fn ge lot rfm h h a tte e n i ie eb n n ge Sn ot tnm hh rad iie eba d ne Sn ee ot s tnn hhC rad ie ca d Sn eek r hs tnntC -rad eo lc a d yeek r hsnt sC -o u d eo l,l c , y k ri hecr t r s-o u d eo l,l s ,i y i elcir r snoo eu o d , l d ss t ,i d ir eo lcirn er Mno en i o b o d st s t i d dro lin m nhe e Mno en i ob uo d st tn d deron mnh te e Man i b o ugot n dn ree mnh tea eag l o ugc n un re ke ee r ta ea r sg nl o gc un dr e keagde r pa erg nl c u d ks em ag vde r dpt ervvs rn r n d sm ag v td mdprt evv ts rd r ni s nm v t mdt rt ir ev v ts raupd er neiy ni tqe mt rn ir h t t auep ede ei sby nio qe ot n ir h o c t au tep ee esby r io qe oan rh ao c t ite es pl sa b lro oa l r sao u hc iu t r e sls pla lria liy or so au hiu e r o we sls plal lic wtt liy ogv sou hu ec or w e sl sl ic wptu Ft iy ogv o ec o w p ee sl i c wptue a Ft gv i c m p fe e sS pie pue pa i Fwio i amea sa p fe e S pie f ie p lai ewio iln er at e ma n a sa f S p rs pe n f ip lim ewio il nn er at e ean a sa i ry s r pn f i mr lm e Ti il nnn eom rt etn am sei rny s r pn emrm T ni i nnom eyt nbme s ad eo iny erg t emrl l T ni n i om yt nbm de s as dd eon eag t el l n ie y nbd he i as o ddd oeae ug mtl rl s ie nd hi tvs o dds ae g u omq ee rt er s ae e nht i tvo ds n e ee g u om gq e e rst er s a he nst tvts n e e gogq eea e snnte d er aio ohestt n e e g aea r ar snne d u rf n i to oh tr s nt ra n an ea rs d ar nn ee d u rf n i to otr n ra n em an rss d aors etu e hrm f n t esd tsr ma n o ra gn em n ug ss dos et e hm esd se m Ia , on t gem t ug s oos t teg h m es sd se m Ia ,t on t g t ugo nt g is le I, , rt n t le b t od n ent g e t ti psa lo t , rt nn le n b e u d d n ean i e t its i pa lo it , S r n an le n b e ud d ean i e tr i o st Cs pba o ito S ns an nn e rud p am i m rr ei o dsCns m bio S s a mrnr c f c p m e m rp ra eo dsCn m bo y js mrn trs c f c p m e mrip a e dni m ty js mor ra tos c f cf e eip a ri sn o ty js e s od ira tosf y oe ii m vsrli t esn o tps e s od ira a of y t oe e iie m vo esrlt esn onp ee s rd ia i ocy t oe ifi ee m vat o eslt er nnp e.r ai xg t oc um e tfe ifee at o er nxn mee r.a r ixg t oo c uem e f r r featt r nnxt me r.a nexg v te o uem er f rr n r rt o nxpt mTe rya nev e o t er i rrarv nr ttr rt c o nh pt Tn yne v e trii srav nr tt er rs ocr noh p iTn y t rm t i ti srt im bavor tt ee b s ocr nh idn mt rml dhdi C t u o W m bi I i t si t im bo ee b s ort n oo a id s mte ram l dhdi . h fti t im bo c ae bt n oo a d s mge a l d rhdi . h fi ac a nt n s oo oae si , ge a o ri . a h f ie ac ae e nn n s oe i, ngs oT ri annn ien i ae e u e en ons oe i, n s oTi u s annn i nen ie e ue e aonc n (os en s T t u s nnn n o nn ic u rue er aoc n (tos e d tus oR s nEhc u g rt r ac e ln (g tos n e d s tb noss Eh nc u g rt s rn e h dlgh t e n d s oee eb nl ss r Eh nr w gt s o ne h dl kgh ic n s oee teb nl s r nr wo s Re o nh dkih n i e c oe se te tl i r or o a wo Re o kin ii ce c he s sta tdd i s t o o aco fo Re in i ce m h he s sca n tdd i st o om ac afo o v icm h n he wsl a ca nt T dd sht lm c aa f o o svm l ohn o wl l a cnt Th e n elum a a oa sv Rl on oi wl f li at T f ah e ll ue t l a ai s Rl oo ni ttl f ci a t e a isl ue Mt lu e aih e s lRn ni tta f ci a t a ir sl ne Mt u lk t wee ni mthe s loono ntta cti it a irm s a n M uk t wel e nmthe s l oo mna tii il oy r dm ai nka t wel e nii mt t oon mss iti ii il t oy dm i af i aa el ii ot tt n moss s iri il St ooy idi g ig aa e i hi not ttmn os .s s irxsit e St oii gl S g as r lha d not t rml aaco .sr st e Sg oi it g l g s ter lha d nm l ac .o wo est e a ng ) itl ns toeot r la rd eh n l ac o o wo ea n eg )gr iitn toe iot reh e n n o oo wo ea n e)gr int oe ce iot t rsteeh nnn a oo t eger isft pe c e sit ste st nn a ow ste r dsft pre r c ao e usr rt sststx na wt r sy et e r dsf prnr ausrr rsm ois h stx k pwt - r sy es kra df o rinr aurar ersm ,os hu rx k pht - ory es af yo ine ar ep sm ,os h u t rt tk p ih - oi e s . af yo ine a ep ,e B u ot t rs th e oi n e we .n g yct tne p ot e a iB f i ot ts t n ep i n e wed . en g ct tn olt e a iB f t i o. se ee op n wed enr ie rg ct er to q olt a i f i. s S e e oip rr nad f eEr ice rt ero ois dl n. s S e ei orr r a fer ica e ti rat erao e ois dn is S tlr ei rasr r a fe ca rti atda e no ris dnr iit l tr e asi grsee oa rti aida e nrwr ie it l e trt a et m asi g gse b o iran t i id neb r w tr fieo i ht e tit a mi g gs seb o ian t i i eb nw et l fieo hs e it a m ga se b, l iacn t i a eb net l fio r hxs l iraw se ns, T lb c nfai ne sn wc l r ce xs l raw ie s , T ll c nf ar i sn wc der ce xl l cr w i or m s Tc l nf ht ii st n wc i rdet3 ce l f r c ii or m ic l ht i ctit ai rdetl3e l f a cr cn iora mic h oht i ce it a t r ai ratl3e d nf a cran irea ai ho ocm e it a rr a alne d na6 can re ta at ho oym e oTt a lror an td n 6 a eoi re t aogo ym y oT ln ri o un t ni6 o o ei yt d ogla yy y oT ln i o itn ni l o o ei i y, as n d r ogla y En i t i twn ni l oo ni y, m as n d r s wla c Es,em t i tw t nn ls o ni, m as n sr an s wc E so h,e i t btw t n s f o nlem o san s wc e e o s h,e ir b nt . n smf t sp lo san tei lat n o hir b nt .r . mf t sC p laio a tei la nt d ra nt .vr .r aM h em ot s C p ai ra tr i lo oat nn n d am It .vor a h e o C gai ra tr rl n n m d am I vo a as h e o t gliy ort tr ra le n n mi m Io y a s it glui oy oet he tra ln e i omi y a s gn h itlui oy oet hm s r iean e ig oi c yt gn h s iu o em hsn r ie Cn ig o no lc t e gin hs m sn r i C l sg ono n i lec to ei ks su ,ics en C l s. ono n i leu oar ei re i e k su ,ics ed l ns . osn ieu oaro ri me e ek su ,iuc ns ed no . is u o a ,or e ri me e et tsu n d l M s no is t o ,oe g t me et ti s siu n p l n M s o ie ut ng eo ,oe gr rwt t ti n s sei p ld M stt t ee i ut mg eh gr rwet nti n s ei o p s ld tt t ee i u mg eh or rawoe ntn ep ns lild ett te ei mv eh o aeoe nttr tp nre s lil ete oe v eis o aeo t r tpe nre til oet oo we oe v eis ffi ei hto r n te re sta ol tn ole aroore is ffis ai h ro ne ro st at oln ole aror ffi o s ai h ro nn ro sa at ln le o aror t o .sp ar ron rotr S f a.t e lowl a k t .op rf onh tr Sf a.e lowl h n c a kt . le p rlo fi o oo h tr Stf a.ye liwl h n c a k l lo pfio eo h iTtyt dyois ilht n c n l lo pio e eo iTtyt dydois no ilt n l npt e s ee e iTty ddop s notr ilts n n t e ss ee redp no h(tr .as nh n t e gss eg c rep e i . h(tr .ais gnh u sg C dc graee i . h(t .aii n gnh a but fg C dc gare i .t l iwai n ge aunt C s d. gah ret ln wai n e lahnt t s.r h rae l n wa egt lhn ts. B r h aek t nr gt l h ioo T tB r g a b m r d n o gd t ioo T o p B e b tg bmer d n ood iooT o rpe b tg bme d no Todt o rp e b th bnre To e i lrae h r nrlr aT oe iS as e qr h r nrslr ao r e i C eas et qr or slrl aa o r C et ms it qdr o sl n i a ra C ed ’t mhi it od n oul ni ab a ag id ’t mh i od nu ni tba ag vd ’h ) oenu tbi ag v ) o t,e r t kti i e v )tel sn , e i kti i e g tel l sn ,ew o i kti eo dgo tel l sn w o i no dsg ly w a yo o dsayr a s ay er aa o ao erl y ta o n io el hl ta o no dlol oy tni dnwl oyi ddnn w oyi dnn w dn d d s dg t dg dt g h,t h, n eh, s e gytT a e et e r s ssm rmet meh ts etsy syS ySl a Slm o lrot srotr.n tno noC o C n C in ia ne iraraTi rT o T rotrote rten eMMM s SSSMMM yyye se se stt tt tt er er erooo mmm TTT sssrrraaaiiinnn CCCooonnntttrrrooolll challenges. Metro signalling and train in this field to come. The importance of systems\ncontrol solutions tend to be towards the worldwide\nengineering, RAMS analysis, simulation\nhigher technology end of the spectrum, and with contributions from\nand integration cannot be overstated,\nlargely due to the need to provide high- railways across the planet, the textbook\nand the understanding of the particular\ncapacity operation through the use of goes into detail about many of the\nneeds of urban railways is important.\ninnovative techniques. The railways subsystems and processes necessary for\nalso tend to be early adopters of new Summary – and to find smooth deployment. It uses hundreds\nideas, for example some of the earliest out more of illustrations, comprehensive case\nuses of high integrity processor-based studies and introductions to several of\nIn summary metro railways tend to have\nsafety systems were on metros. Over the the proprietary systems in use today. To\nsome common characteristics, but since\nservice life of a system (typically 20 years order your copy visit irse.org/store\nthey do not need to interoperate and\nor more), this means supporting those\nsome have been operating for over 100\ntechnologies can require skills and tools\nyears, they have tended to evolve in\nthat become harder to source.\nAs an example of this many systems About the authors\nfrom the 1980s and 1990s made the use\nof microprocessors designed to support Robert, Mark and Richard are all mass transit and main line projects\ndigital signal processing in a highly chartered engineers and have over 100 worldwide. He has been production\nefficient way. As the decades passed years' experience in metro signalling manager of IRSE News since 2014,\nand standard devices became powerful and train control between them! and is currently head of marketing and\nenough to remove the advantages strategy support, Rail Infrastructure at\nRobert worked for London Underground\nof using special purpose chips, the Siemens Mobility in the UK.\nand Westinghouse Rail Systems in the\nknowledge of the programming\nUK before moving to Singapore. Rob Richard specialises in systems\nlanguages and assembler code used to\nis currently the deputy chief specialist engineering for railway signalling in\ndevelop the original solutions faded, and\n(signalling) at the Land Transport mass transit applications. He worked for\nemulators, compilers and test software\nAuthority in Singapore, a member of the Westinghouse Signals Limited, which\nbecame harder to source. In some cases,\nIRSE Council and the IRSE International became Invensys Rail and then Siemens\nrailways have even bought the rights to\nTechnical Committee. Rail Automation, before moving to\nthe masks for the processors in order\ntechnology delivery in the operational\nto mitigate the risk of unavailability of Mark has a background in metro\ndomain with Metro Trains Melbourne\nkey components. signalling and train control, and\nas system architect for the Metro\nexperience in a wide range of\nTunnel Project.\n19\nlo rtn o C n ia rTs m oe rte Mts y S Metro Train Control Systems yawliar eht rof e dg in ui gll a dn ng ais e g cn ni ep ro el fe ev re ld ai tn ni e te seh smt e e ner aba ss o io t s r s mt eeh egMt tnw s e. yo s l Sy lr ag a lhw o t c ra l tih ea nT r h o t, C. t h dis t nnnw iaa ao tr rstr Tr , gd s e o sn dc a ro i n tmm ey u Me o r ob on t o r , go oc n rer t iu ker eo i me eh h s rt r o r e o efp t es ns mlan i i g etio a n ntt r se e t yd s s6 se 3 e ld o n o e re trt na t pt o da u c n e f naoh i t s as e rm le ti tvo dice nr f l n a e, ry c et ii dvli ob re ma sil e n for ia h drtg o gi oh n l bh is ec a fu e ils rc t nro i-p r , p e d .m vulr eso e sow t ds ty ne ns ah o l mt o it s r a ets m dno o orc c ta u n al m ii aa fro ot te r sd ,f s l s esn t e vri l ee rs lepe hvxn i tei r il d w t lu o ro r ot n t ,I do . es cy d na n o iw eat r tl i ttg a a fn r no i o un mr o etei a ht mi e ts tn f aa oo r y tt g b n , ng i d inm d ei nl re l oa at n hts sy g tr uS i es a dl o o ,n kr r ut oto n e ont mo bas C e n r s eu n ir hdeq ia Td ai rn eT oh r md c eee hftt o ta n r esgo vnei i t o gd ta n i n l t ou i aa tem c s sh ilm mi pts pga ih aanr tg i i dw ga nni d r aie r f b sho e t d e le pngs i a coud n t se e e idd rv u pei iv s q n eno ii n he arp hl tt px cs xe en e tso e s ’i kit k a cta nt omn e le bm ks goe p nr o op ib vl ed o e ve mehli dT ‘a t n. e y. gs d cn in sso eeni dut iu a q etl eo n hrs o Tf cl ea . scc d uii n v cn a r oh e fc e se f nit l i) o anC rtwT t s B o edC h rr o ti( e w el ho s tr ie mt g hn n ito t i pgbC oni rn ic ri bsa e r’ oT ds tr d o s sret hea s pir a le p aB rp p- go us on st t oe oge i hntm a pilc l aio n n t u ge d m il sb e ma r ro or oe l ji ap Ca mo t ,r s t e ennt heon tmii t yue p blh oot ls eo e vtn d e to dis v a d o dre rt ippny a o o o rl c tp f om n sr i e ae s ei i ls p rsn apiho u sTi ist h a . tntc n e nfil el e Iia c m w eta n tp eh os bt r ) is S yve M rn ai et T vi l Ra o sk n E r mo to ( eo em m mb ts m e ye et sh so hyT c tS n. y s t ine n sal e do m m er e r esi ne gs eh a cl nt fie an ih cMi t e rr pee cv sd ffi. ed is nl ar n r o Teow r c la i a oe e Rh t r et d n hs e as te e o tn pur o c s b ra r ue , ss Ee ne nn oit ia gi ir t t no ai r ehg e tn y pu ai oak w a et lm i i ns an i r l, a k nrro o it a o r l moob rj ae tnmc on cme r noe if r ae f. r r r tse ea ne i rdn d eui n dg ta on s ke meo sy o aa cbw t hl xi ta e ir wt o a s r h ete t dom ub l c e s nh i ost m cro ef t y sr ya Sr b loil r te ng od Ce l nw io arn Tk o e rh tet Mfo tnemele laitnesse sreenignE langiS yaw e ls iao Rh t f oll a n r oo itf u g n tn o iti sil t nl ua Itn i etg s hi ns T iy la aw noli ia sr s eh ft oiw rc p ffi d eea htr a tt i s, cl io or st sn ao rc o n nia i r dt e , gsn ao gi nta eci. ns un mois mse of co er lp e td de nill aa dna tnemegang aro m.esri.www ta erom tuo dniF\n///",
      "source_file": "27_metro_train_control_systems.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": false,
      "ocr_engine": "tesseract"
    }
  ]
}