{
  "doc_id": "1e052fe7-575a-45a0-a320-57523787fe38",
  "pages": [
    {
      "page_number": 1,
      "text": "Institution of Railway Signal Engineers\na\nBack to basics: Points maintenance\n的 Trevor Bradbeer 有 B 4 ) F\nIn this article, which continues the Back-to-basics required; in the UK this is usually undertaken by Electrification\nseries on points (see February and March 2022 editions & Plant (E&P) personnel, and is outside the scope of this article.\nof IRSE News), we will be considering three general and Ultimately the purpose of all maintenance is to ensure the\nrelated subject areas: scheduled maintenance; fault- asset is presentable, operating safely, within acceptable\nfinding; and how Remote Condition Monitoring (RCM) (preferably optimal) parameters, and is able to do so for as long\ncan assist with both of these. Initially we will consider as possible. Maintenance activities can therefore be divided\nfaulting and maintenance in the more traditional sense along these lines: safety; performance; and life (prolonging)\nBC (Before Condition monitoring!), and then move on - with a number of them falling into more than one category.\nto AD (Assisted Digitally!). Maintenance can also be divided into preventive maintenance\nand corrective maintenance.\n\nTimely and effective maintenance of the point . .\nactuating mechanism and the Switch and Crossing Scheduled (preventive) maintenance\n(S&C) is essential for the safe operation of the railway. For reasons stated previously, scheduled maintenance is\nAs far as possible, signalling technology developments by its very nature preventive maintenance; it is aimed at\nhave tended to reduce or eliminate moving and ensuring that the equipment remains in good working order.\nmechanically vulnerable parts such as relays, filament The nature of the maintenance can range from a simple\nlamps, searchlight signals and physical panel controls. visual examination to cleaning, re-greasing, Measuring and\nHowever, so long as wheels run on rails there will gauging. Gauging (testing for mechanical correctness using a\n\n' ; ; tool of known dimensions) and measurement (using a scaled\nalways be the need to switch trains between tracks, and instrument to determine a quantitative value) might reveal that\ntherefore points will be required. the equipment is out of tolerance and requires adjustment\nWhy maintenance matters or renewal. Visual examination might also reveal defects that\n\nneed to be corrected.\n\nIt is not hard to envisage that a mechanism pushing with\na force measured in thousands of Newtons, to millimetre Corrective maintenance\naccuracy, that is run over by hundreds of tons of train moving If during scheduled maintenance some property of the points\nat speed will need to be maintained on a regular basis to is found to be outside the acceptable parameters it will be\nkeep it in reliable working order! Maintenance of points, as necessary to carry out corrective maintenance. This could be\nwith other signalling assets, must be performed at intervals as simple as a small adjustment to the drive or detection, or as\nthat are frequent enough to ensure any signs of deterioration complex as switch or machine renewal. Clearly the nature and\nare captured and rectified on a timely basis, especially where severity of the problem identified will determine its priority in\nsafety is concerned. planned works. If the problem is safety related and cannot be\nThe maintenance can be considered in two parts: the track, rectified immediately it might be necessary to restrict the use\ncovering the rails, chairs, crossing etc.; and the signalling, or position of the points, and/or the speed of trains over them.\ncovering the point actuating, lock and detection mechanism. Scheduled maintenance intervals\nInevitably these two functions overlap, and representatives -\nfrom both departments may attend the same maintenance Scheduled maintenance is generally divided into two types.\nevent to perform their specific tasks, whilst also advising and Firstly, a frequent service activity covering light maintenance\nassisting the other department in theirs. Other personnel might aNd essential safety checks might be carried out once every\nalso be involved, for example to maintain point heating where — three months, or as recommended by the manufacturer. Such\n24",
      "source_file": "25_maintenance_&_remote_condition_monitoring.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 2,
      "text": "IRSE News | Issue 288 | May 2022\n=~ TM < ran , > Ye ae\n\\ a . a woe 站 . . :\n. , ? c 一 , . 四\n发 “ 7 fo\nSra °\n上 Am ., 4\n‘a4 >. A ue ~ i ‘ aa\nf . i a Pd . 好\n4 ~4 y 一 , “ _ » : .\na, , * - wi .\nPoints and crossings are an essential part of the railway infrastructure, and their effective\nmaintenance is critically important. Their location often poses challenges in carrying out this\nwork safely and without disrupting service.\nservicing might be performed more frequently for ‘key points’ Permanent Way maintenance\nwhose operation is in high demand and therefore essential Before attempting to check the correct operation of the\nfor many train movements, such as ata Junction where two points operating mechanism it is necessary to ensure that the\nbusy routes converge. Failure of these key points would incur trackwork S&C is in good working order; there is no sense\nhigh train delay penalties and/or damage the reputation of the and indeed some danger in adjusting the point operating\ntrain operator. mechanism to compensate for an S&C problem.\nIn addition to this, a more detailed maintenance activity IS First and foremost, it is essential that the track gauge at the\nundertaken less frequently, typically annually. This includes points is correctly maintained throughout the whole length of\nfurther tests and checks on components that are not expected the points at all times. If the rails are out of gauge anywhere\nto deteriorate quickly, for which an annual check is sufficient. in the S&C, temporary measures might be implemented, such\nMaintenance standards as using packing pieces, to restore the correct dimension.\n. However, a permanent fix, such as overhaul and renewal of\nThe maintenance standards adopted by a particular components, should be arranged as soon as possible.\ninfrastructure owner/maintainer might be the manufacturer's\nrecommendations and instructions themselves, as is the Secondly, it is important that the integrity of the rail furniture\ncase in some countries. Alternatively, the manufacturer's such as chairs and stretcher bars (where provided) is\nrecommendations may be used as the basis of standards maintained. The traditional design of stretcher bars has come\nproduced and issued by the relevant authority (e.g., Network under considerable scrutiny in recent years and new products\nRail, in the case of the main line in Great Britain). have been introduced in many cases. Mechanical stress in\n, ; ; the traditional stretcher bar can be high and result in metal\nEach approach has Its merits. Following the manufacturer's fatigue, most commonly seen as broken bars or brackets\nInstructions directly, once approved by the relevant authority, (‘shoes’). Chair bolts, rail fastenings and stretcher bars must all\n's a potentially easier and more direct approach, whereas be examined and tightened, adjusted or replaced as necessary.\nstandards produced by the infrastructure owner will have the Wooden sleepers in particular should be checked for signs of\nadvantage of being consistent across all types of assets, and deterioration. Switch rails should move smoothly in the slide\ntake into account the individual needs of the infrastructure chairs without excess friction (more about this later)\nowner that the manufacturer might not include.\n; ; ; ; Thirdly, the profile of the rails should be checked. Switch and\nIt is beyond the SCOPE of this article to consider all the myriad stock rails are shaped (profiled) to fit together tightly when\nforms of point operating mechanism and associated specific closed so, as to present a relatively smooth transition for\nmaintenance activities. But most points share common , passing trains. Over time both the stock rails and switch rails\ncategories of maintenance activity, as shown in the following can wear. Stock rails may show ‘lipping’ where the rail head\nexample. This brings together the considerations and factors has been rolled out and this may even risk fouling the switch\ndiscussed so far and Puts them Into context. Although some rail. Switch rails, being very narrow at the tips, are prone to\nstandard British mainline railway documentation has been chips and cracks if not aligned correctly and could be struck\nreferenced, the principles are likely to apply to the majority of by passing wheels. Repair work such as grinding or welding is\ncases on other railways. likely to be needed, and ultimately renewal might be required.\n25",
      "source_file": "25_maintenance_&_remote_condition_monitoring.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 3,
      "text": "IRSE News | Issue 288 | May 2022\nFourthly, the lateral movement of the switch rails on the slide Signalling maintenance\nchairs needs to be checked. One of the most common and The activities listed here are typical, but might not all be\nfrustrating issues with switch rails is combating the friction that relevant for a given installation or environment, and some\nis inevitably associated with sliding components. Initially the operating mechanisms might require additional signalling\nchairs will be greased but as the points are moved the grease maintenance activities.\nwill be progressively worn away, and can build up in places\nwhere it might interfere with the operation of the points. Signalling maintenance personnel need to pay attention to\nRemoval of old, tarry grease deposits and the application of the S&C, not just the points operating mechanism. Some\nnew lubricant is necessarily a frequent maintenance activity, maintenance measurements are made by both track and\notherwise the slide chairs will become ‘dry’ and the excess signalling personnel. These include free wheel clearance\nfriction will cause increasing stress on the point mechanism, (FWC), free wheel passage (FWP) and residual switch opening\nuntil eventually it is unable to complete the movement. (RSO). All of these measurements are aimed at ensuring that\nInnovations to address this have included using materials with on the open switch rail the train wheels have sufficient space\nnaturally lower friction, such as nylon, or providing rollers in to run without causing ‘flange back contact’, whereby the back\nthe slide chair that support the switch as it moves into position. edge of a passing wheel flange is rubbing against the back\nIn both of these cases grease must not be applied as it can edge of the open switch rail. Such an event risks the wheel\ninterfere with the correct operation of the components. riding up on the switch and causing a derailment, as happened\nFinally, and perhaps harder to ascertain, is the stability of the at Grayrigg, Cumbria, UK, in 2007\nballast. As anyone who has watched train wheels pass over FWC and FWP are checked by running a gauge towards the\npoints or indeed plain line will confirm, seemingly solid and heel end of the open switch rail. Additionally, it is necessary to\nimmovable rails will bend visibly under a passing train to some Measure the distance between the open switch and the stock\nextent, depending on its speed and weight. Over time this rail at the toe; a typical value for this is 108mm but it can vary\ncan lead to ‘voids’ in the ballast leaving the points partially by switch type.\nmight indicate that voids are present, or tain-borne or’ Checking the RSO involves measuring the gap between\nhrackside instrumentation may provide evidence the closed switch rail and the stock rail where the rail head\nprofile is shaped to ensure the two fit together well. This\nSome point mechanisms, notably ones that clamp the switch measurement is made at intervals from the toe towards\nand stock rail together, are notoriously sensitive to this kind the heel end of the switch rail. Figure 1 shows the typical\nof rail deformation and can fail at short notice. Adjustments measurements made.\nmade to compensate for the rail deformation might overcome Signalling maintainers will check for the tightness, correctness\nProblems Such as ess of detection, but then be defeated when and security of points fittings and stretcher bars (where\ngain. provided), drive mechanisms, cranks, rods, detectors etc. to\nThere are various ways of preventing or reducing the risks ensure that nothing Is loose, cracked or out of adjustment.\nassociated with voids and rail deformation. Solid track (slab Seasonal maintenance may include additional measures,\ntrack), which has a concrete base, does not suffer from this e.g. to minimise frozen points in winter by applying frost-\nproblem of course, but is more expensive to produce. Some resistant grease.\ncompanies offer chemical or mechanical products to help The environment in which the points are operating must\nstabilise the ballast formation. The problem of point failure as be checked for cleanliness and freedom from potential\n3 result of rail deformation can also mitigated by the use of ; obstructions. This means removing debris such as litter and\nin bearer’ operating mechanisms, which are contained within vegetation that could find its way into the gap between an\na steel sleeper.\nFigure 1 — Simplified diagram of typical measurements made during maintenance.\nBased on diagram in Network Rail standard NR/SMS/Part C/PFO1.\n, , Measured track gauge (static)\nMag $a $a\n‘ , ' Free wheel clearance Residual switch\n(Switch opening/flangeway) 11 Opening\n1 1 1 1 1\n1 1 1 —_, <—\n| >! i\n, Flange back spacing | 1\ntot it\n1 1 1 \\ 1 1\n1 1 1 \\ 1 1\n1 HE 1 1\ntot Free wheel passage\ntot\n1 1\n1 1\nanal\nFlange back\nclearance\n26",
      "source_file": "25_maintenance_&_remote_condition_monitoring.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 4,
      "text": "IRSE News | Issue 288 | May 2022\nFigure 2 — the economics of remote condition monitoring can be quite complex.\nPremium paid to ' Premium paid for less\nreduce failures toa . frequent maintenance\nsmall but still but with higher cost to\nnon-zero value ' repair and compensate\n©\n=}\n6 ; ;\nOD , Economic Increasing cost\n8 optimum of failure or\n= downtime\nx\na\nCost of\nmaintaining\nasset\nCost\nopen switch and the adjacent stock rail, which would interfere = The specific maintenance tasks on a point operating\nwith the movement of the points. An excessively high ballast mechanism itself vary considerably from machine to machine\nshoulder must be brought down to an acceptable height, to depending on the type of drive used and the locking/detection\nreduce the risk of pieces of ballast obstructing the movement. method. In general they will entail checks on the physical\nThe identity of the points and more specifically the operating Sone on of the machine and drive, Its fastenings, lubrication,\noy, ; a uid level for hydraulics, and mechanical wear on facing\nmechanism is indicated at some suitable position on or , 。\n- . . ; surfaces. Different lubricants might be required, or none at all,\nadjacent to the points. In the UK, by convention the identity ; , , ; ;\noe ; according to the type of mechanism involved. A drive-train of\nplate is fixed on a sleeper close to the toe of the points on the . . -\n. , , gears could require a different grease from that required for\nside nearest the normally closed switch. Though a seemingly , , . ,\n。 ap: the drive rods - and will certainly be different to that applied to\nminor matter, the presence, legibility and correctness of the ; .\nerr or nae the slide chairs!\npoints’ identity is crucial for accurate communications and safe\nactions during engineering works and when operational issues § Detection mechanisms usually rely on some form of electrical\nmake it necessary to move the points manually. contact being made, either microswitches or open contacts.\nIn track circuited areas the stretcher bars and other lateral These are frequently the cause when a detection failure\nag: , , 。 occurs and therefore must be checked with gauges as part\nfittings are fitted with insulating layers to prevent a short , , , ,\neae ; ; . of routine maintenance. Either a distance gauge is used (in\ncircuit across the rails. These insulations must be checked for ; , . .\na aa , the case of microswitches) to determine the points at which\npresence and good condition to minimise the risk of a track tee ; ;\ner they ‘flip’ between their two states or, in the case of open\ncircuit failure. , , ,\ncontacts by using a spring tension gauge to check the force\nFinally, and most importantly, we consider the maintenance of — holding the contacts closed. Other contacts for controlling the\nthe point operating mechanism itself. If there is one test that is | motor or clutch mechanisms might also require checking ina\ncommon among various types of point operating mechanism similar manner.\nitis the Facing Point Lock (FPL) test. This test is designed to . 。 。 . . -\nprove that the points can only be locked on the ground if the Using remote condition monitoring to optimise\nclosed switch is within an acceptable distance (3.5mm being maintenance\ntypical) of its fully closed position at the toe of the points _ The traditional preventive maintenance we have described\n(for safety) and are guaranteed to lock if the measurement is uses time intervals between maintenance events that is based\ntypically not more than 1.5mm (for reliability). The test is made ”on the likelinood of failure and maintaining a high level of\ntypically by inserting a 3.5mm gauge between the switch and confidence in the safe functioning of the assets. There are\nstock rail in line with the first slide chair bolt and moving the several reasons why this approach is not optimal, including\npoints manually towards it until the lock jams. The testis then _ the labour-intensive nature of the work, the cost of possibly\nrepeated with a 1.5mm gauge in the same position to prove unnecessary maintenance activities, the risk to staff working\nthat the lock engages. If either test fails, and provided thatthe _ trackside, and the reduced availability of the assets for service.\nS&C has been verified as in good order, an adjustment to the _\nlock mechanism will be required. A modern, efficient railway needs a more intelligent approach\nand a different philosophy. From an economic point of view,\nIn a similar vein to the FPL test is the detection test, which in there is an optimum point where the level of maintenance has\ntheory is carried out in the same way but using 3.5mm/Smm minimal adverse business impact (see Figure 2). Maintaining\ngauges. This test would be naturally hindered by the action an asset too often is expensive, disruptive to the operation of\nof the lock, and so is carried out either by ‘floating’ the lock the railway and may cause more failures because personnel\n(compensating for the detection gauge by moving the lock are examining equipment and possibly interfering with what\nout of the way) or by using slotted gauges that can fit around was a perfectly operating point machine. On the other hand,\nthe detector rods and displace them by the required distance maintaining too infrequently will indeed lead to an increase in\n(3.5mm to achieve detection, 5mm to break detection). failures and consequential cost penalties.\n27",
      "source_file": "25_maintenance_&_remote_condition_monitoring.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 5,
      "text": "IRSE News | Issue 288 | May 2022\n. ' . 4 4s fh -\n‘Vv J :\n+ 4 四\n7 Digital states a\n| , 4 一 _ ; ll\n人 A ‘im 6508 WER E. | Relay A147] Relay Azz\n, § [J 6598 RER [[] Relay Ai5 [J Relay 423\n. ~~ 口 6594 NKR] Relay 416 ([] Relay 424\n| . [] 6594 RKR [[] Relay 417 [[] Relay AZS\n器 659 NKR 口 Relay 418 [7] Relay 426\n| | Change USE | Real-time >>\n| Menu | disk analog\nAbove, a current clamp of the type used for remote condition ee\nmonitoring of AC-driven points.\nRight RCM data logger display.\nWhat is needed is a system that will allow maintenance be fitted in future systems, although voltage readings are still\nintervals to be optimised. Ideally these intervals would be useful for calculating power consumption and detecting a\nlonger than those traditionally used, but more importantly they _ failing battery or supply.\nwould be both adjusted and adjustable to achieve cost, safety , , , ,\nnee ; , Detecting motor current requires no direct connection to the\nand availability requirements. This could in theory be done , ~ , ,\n, , points circuits and can be done with sensors clipped around\nmanually by making repeated measurements of the operation , , ar\n, ; , the power supply wiring. Where discrete circuits are used to\nof the points and plotting them on graph paper in order to , a. , ,\n, , , drive the points in each direction a separate sensor is required\ndetermine acceptable maintenance intervals, but that would , ; ,\nage: , . . for each circuit, which can also be used to determine the\nclearly be a somewhat “trial and error” process, involving even , , , ,\n, driven direction. Where three phase supplies are used one\nmore work at the trackside to collect the data.\nsensor is required for each phase and must be connected\nFortunately, developments in sensor, digital processing, before the power switching relay, otherwise the phase reversal\nstorage and communication technology have brought about used to change the driven direction can also upset the\na range of different remote condition monitoring products calculations made by the data logger, especially if a voltage\nthat can measure key parameters of points operation without sensor is being used to calculate power consumption as well.\nthe need for personnel to repeatedly go onto the track. Note, Voltage, current and detection event monitoring can all be\nby the way that we use the abbreviation RCM for Remote performed away from the trackside and are therefore ideal\nCondition Monitoring here, not to be confused with Reliability parameters to be used.\nCentred Maintenance. A data logger is used to monitor and buffer a set of samples\nIt is now possible to measure a point machine system very from its sensors, usually at about 100 samples per second, on\ncomprehensively, using such parameters as: a rolling memory basis until a trigger value is reached (usually\ne Load or force on the drive rod (trackside load cell). the current at the start of the point movement). From then on\n。 Motor current and voltage (sensors in the location feeding Coot or the uration a the ovemnen before sending all\nelectric power to the motor). is data to a server for storage and analysis.\ne Hydraulic pressure and oil level (already provided on Timing detection events, from the loss of detection (e.g., when\nsome power packs). the points are commanded to move from normal to reverse)\ne Detection lost and gained (contact event monitoring or to gaining it again (when reverse detection is obtained), is a\ncurrent sensors). simple indicator of health when plotted as a trend over time.\nMeasuring many of these parameters requires direct raised 3s alarms eg me longer than usual) partictianly if\nintervention in the point operating mechanism, which could 4 ere Is a this ic ic and Pe blunt in t oat me Sor\nmake it more difficult to maintain or renew, thus defeating the owever, t - Stns a a eee rumen (means O th\nobjectives of RCM. In the early part of this century Network Rail med ee ANG gIVes | the Caton OF tne stress te\nran a trial at Peterborough Training Centre, Cambridgeshire, points might be experiencing as they move.\nUK, to determine how accurately just one factor, namely motor Motor current is another good indicator of the health of\ncurrent, could be used to determine the overall condition of the points. The more stress the machine is under to move\nthe points from a reliability perspective. The apparent success the switch rails, the greater the current drawn will be. When\nof this trial meant that most other factors would not need to plotted graphically it is possible to identify the key stages in the\n28",
      "source_file": "25_maintenance_&_remote_condition_monitoring.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 6,
      "text": "IRSE News | Issue 288 | May 2022\nBalfour Beatty ASsef -\nRail 2 : Profile Plot\n(berg OM | Heke\n“ TOA Sanmnat tee Reecurens 730012823\nee V2 AS 21 Bowes Tubal Uitte\n一 “ : a Salised Al\nSem Net |\nfern a : | lag Nunes\nes 冯 | Tag Derqrion\n中 | . Envelopa\n|\n\\\n+ oT ms 一一 a ~~ —_— 人 -一一一一 加\n’ - + aa . ue . 四 i cane J's ae 四 四\nBaitou Beatty 人\nRail <—_ Asset Profile Plot\n[Log OF ] vip\nwee 三 一rnhavratrpesoreesT 7217-\nabe i PACER Ri: Wb +\napes . | .Sna All\noy | Tag porcrmion\ntuuy\nErvelopa\n“ , oe of - _ ao ~ 一 一 -=\n4 _ + 43 ‘pte 了 四站 . oa . eu ale Joel ny \"e tes 的\nThe example RCM plots above show a normal (top) profile for points movement, and the profile where there is an issue\nto be rectified, with far more power required to complete the movement.\noperation such as initial motor inrush, unlocking, travel, locking In the past RCM has been seen as associated specifically with\nand braking/stopping. Excessive current levels compared with signalling personnel, so it has been difficult to get some track\nthat considered ‘usual’ for each point machine can be used personnel to agree a diagnosis when the data suggests a\nto trigger alarms and bring the equipment to the technician's P-Way/S&C problem. Hopefully this is changing and a spirit of\nattention. The analysis and raising of an alarm has evolved and co-operation, together with the open sharing of this data, will\nimproved over time because the difference between a slightly bring about a united approach to improve points performance\noutlying but correct operation versus a developing fault can for the benefit of everyone.\nbe subtle, and barely detectable by simple threshold detection.\nIt can also result in a lot of false positives that can undermine\nconfidence in the RCM system. Some companies have\ndeveloped machine learning algorithms to help distinguish\nbetween these, so as not to bombard the technician with About the author\ninformation that requires a great deal of experience to interpret\nand understand. Trevor Bradbeer BSc (Hons) CEng Cert Ed MIRSE,\nCalculati . b light! started his career as a trainee technician with British\nalculating power Consumption can be a slightly more Rail in September 1985. In 1988 he started teaching\naccurate and informative parameter, but it requires a voltage basic signalling, telecoms and electrical principles at\nsensor that measures the variations which occur under load. the Ilford Training Centre. He went on to various roles\nA plot of instantaneous power (the power consumed at any in the London area before returning to training and\ngiven instant) can be converted into a measure of total power competence management\nconsumption by calculating the area under the graph. The\nresulting value can then be added to a scatter graph or similar In 2004 when maintenance transferred to Network Rail,\nto observe progressive changes over time. Trevor stayed with Balfour Beatty working in projects\n. . . involving computer-based signal works testing and\nOne renner Pene of iv inet Pcemonstrates wen d remote condition monitoring, evolving from relay data\nMaAINtENance Nas DEEN eV IT MIE POIs are ODSErve loggers to leading-edge condition monitoring systems.\nby RCM to be going out of specification, an additional He completed a software engineering degree in 2003,\nmaintenance activity can be scheduled, which should bring became a MIRSE in 2006 and gained his CEng in 2013\nthe points back to within normal operating parameters. Using He also spent several years on points RCM projects for\nRCM it is obvious when this has happened as the graphs and SMRT/SBS in Singapore and MTR in Hong Kong. In 2019\nplots will show an immediate improvement In operation time, Trevor retired but still works for Signet Solutions in Derby,\npower consumption etc. If this does not happen it could point providing training and consultancy services\nto other causes that need to be investigated.\n29",
      "source_file": "25_maintenance_&_remote_condition_monitoring.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    }
  ]
}