{
  "doc_id": "234a9982-3fc1-4c4a-9990-138b7c839692",
  "pages": [
    {
      "page_number": 1,
      "text": "Institution of Railway Signal Engineers\n\nMetro Railways — Automation and a summary of differences from typical main line railways\n\nVersion 5\n\n(This document is intended for candidates taking Module A of the IRSE Professional Examination. Some content comes from the IRSE Metro Train Control\nSystems textbook)\n\nRail based public transport covers a wide spectrum ranging from tramways with little or no signalling to high speed lines with cab signalling and full\nautomatic train protection. Within that range, this comparison seeks to summarise the main differences between a typical metro and a typical main line\nrailway. The main line railway is assumed to be a mixed traffic network of lines (express passenger, suburban or local passenger & freight). The metro is\ntaken to be a “mass transit” railway with high passenger flows and some underground sections such as exist in many large cities globally. It can also be\nknown as the underground, subway, or tube.\n\nThe document also outlines the various degrees of automation applied to metros worldwide.\n\nMod.A Metro differences v5.docx",
      "source_file": "18_Metro_vs_Railways_V5.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 2,
      "text": "Summary of differences\nMetro railway Main line railway\nTraffic patterns\nHigh frequency service, particularly in city centres. Frequency of more Very wide range of frequencies though not as high as the most frequent\nthan 30 trains per hour can be achieved. metros.\nHigh capacity capable of transporting up to 50,000 passengers per hour. High capacity can be delivered, usually with longer, less frequent trains.\nTrains nearly always stop at all stations Variable stopping patterns to accommodate express and stopping trains.\nThis has an adverse effect on capacity.\nDoes not share tracks with freight or inter-city type services, but some The same tracks are used by express passenger, suburban passenger &\nsystems share some sections of route with suburban trains. freight trains.\nStation stops are often close together Station stops can be very widely separated.\nPassenger management\nCarry large numbers of people over relatively short distances in city Typically longer journeys with lower passenger densities at stations.\ncentres and the surrounding areas. Managing passenger flows within Passenger management is only critical in locations with high passenger\nstations is an important consideration. densities.\nHeadway & Capacity\nStation dwell times are minimised because at high frequencies on an Station dwell times are less critical on most routes.\nexisting system, this is the most significant limiting factor on capacity.\nMore and wider train doors tend to reduce dwell time.\nWhen designing a new metro line, higher capacity trains (e.g. more cars, The same principles apply, but are only significant where there are high\nfewer seats) will increase passenger capacity. High acceleration and passenger densities.\nbraking rates are more important ways of increasing capacity than high\nmaximum speeds.\nTerminal station layouts and procedures are designed to deliver rapid train Relatively long layovers at terminal stations are usual.\nturnrounds to maximise the train frequency for the number of platforms.\nThe number of platforms can be a major constraint on line capacity.\nFixed block is widespread, but with short track circuit sections carefully Fixed block is the norm. Moving block is enabled by the highest level of\ndesigned to optimise capacity. Moving block is used by modern CBTC ETCS (not yet widely implemented), but this is less valuable in increasing\nsystems to increase capacity and shorten signalling headway by reducing capacity where different types of train share the same tracks.\nthe allowed train separation as the following train slows down.\nMod.A Metro differences v5.docx",
      "source_file": "18_Metro_vs_Railways_V5.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": false,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 3,
      "text": "Institution of Railway Signal Engineers\n\nSafety\nMore frequent service increases collision risk. Collisions in tunnels have Higher speeds increase the potential consequences of a collision or\nthe potential for very serious consequences. Automatic Train Protection derailment (though there are far fewer tunnels). A wide variety of ATP\n(ATP) to prevent collisions is considered essential on most lines. systems exist and are commonly used. ATP is typically integrated within\nATP is typically integrated within modern systems such as CBTC modern systems such as ETCS.\n\nFire or smoke are more dangerous in a tunnel, resulting in many metros The same applies, but there are far fewer tunnels.\nimplementing their own specific approvals regimes to manage the risk\n\nposed by equipment deployed in these locations.\n\nHigh passenger numbers mean that controls need to be applied in the This only applies where there are high passenger densities.\nevent of service disruption (e.g. by temporary station closure). Platform\n\nscreen doors are often provided on new metros.\n\nReliable and audible public address (both on trains and in stations) is vital Important, but less critical except where there are high passenger\nto maintain passenger safety during emergencies and service disruption. densities.\n\nRobust voice communications between the control centre and the train\n\ndriver (or attendant) is vital too.\n\nEvacuation of passengers in tunnels is difficult, particularly if there is no The same applies, but very little of the network is in tunnel.\nside walkway. As a result, many metros include specific evacuation shafts\n\nat certain locations. These are typically equipped with systems to support\n\nthe evacuation of passengers under the supervision of operational staff\n\nand the emergency services.\n\noo Controtsystem\nModern systems use Communication Based Train Control (CBTC). Most modern systems without lineside signalling use the European Train\nCurrently systems from different equipment suppliers are not Control System (ETCS) or a near equivalent. There is a common\ninteroperable. This is not a big compatibility issue because most metro specification such that systems from different equipment suppliers are\nlines are self-contained. Lineside signals are not necessary for normal interoperable (i.e. each train only needs one set of equipment to\noperations, but are sometimes installed (e.g. backup, running of trains that | communicate with any ETCS fitted infrastructure). Positive Train Control\nare not CBTC fitted) (PTC) in North America has similar functions.\n\nMod.A Metro differences v5.docx",
      "source_file": "18_Metro_vs_Railways_V5.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 4,
      "text": "Institution of Railway Signal Engineers\n\nAutomaton\nIncreasing use of high levels of automation, up to and including driverless Increasing use of automation to support the driver.\nand unattended operation. Elimination of lineside signals. Attended\noperation enables automated driving, but provides an on-board human\npresence to manage passenger safety and/or manually drive the train in\nthe event of failure.\n\nSee Automation section below for more details.\n\nAutomatic Train Operation (ATO) can improve capacity by consistently The same principles apply, but are only significant where there are high\ndriving every train in a way which minimises transit times between passenger densities.\n\nstations. This means that recovery margins do not need to allow for the\n\ndiffering driving styles of a large number of drivers.\n\nCU patacommunicatine |\n\nCombination of highly directional aerials and radiating cables (leaky Similar technology used in tunnels. GSM-R is the current standard in\nfeeders) to communicate between control centre and trains in tunnels. Europe for secure communications with trains.\nTETRA radio and Wi-Fi with robust coding are the commonly used systems.\nThese systems are sometimes used to provide train fault reporting data\n(often routed directly to the rolling stock maintenance location) and\ncustomer information system updates.\n\nMod.A Metro differences v5.docx",
      "source_file": "18_Metro_vs_Railways_V5.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 5,
      "text": "Institution of Railway Signal Engineers\n\n| oicecommunications |\nTETRA radio is the most commonly used system providing voice GSM-R is the current standard in Europe for secure communications with\ncommunication: trains, usually supplemented with track side telephones deployed at\n\n- Between control centres and trains appropriate locations.\n- For station staff\n- For maintenance staff Station radio is often provided by separate local spot systems rather than\n- For incident response teams using the GSM-R network.\nNote that TETRA radio base stations are capable of continuing to provide\nlocal service to radio users in the event of disconnection from or failure of\nthe wider network. This resilience is a key feature of their role within\nOperational management of the station (particularly at large underground\nlocations).\nEmergency Services radio system coverage is often provided throughout all | Emergency Service radio coverage is provided at key locations where a\nunderground locations (stations, tunnels and evacuation shafts). This is risk assessment has identified it as necessary, for example long tunnel\ntypically achieved by connecting dedicated emergency services radio sections. This may be provided on its own dedicated infrastructure or\nequipment to the metro’s coverage infrastructure. using existing railway coverage infrastructure if appropriate.\n| Stoppingdistances |\nRelatively slow speeds, high braking performance and uniform rolling stock | Higher speeds and the variety of train types (including freight) mean that\nmean that stopping distances can be quite short. This enables a high the signalling system needs to allow for long stopping distances on mixed\nfrequency of service. traffic lines.\n\nPo Signals Overlaps\nShort stopping distances mean that lineside stop signals do not always Lineside stop signals are almost always preceded by at least one caution\nhave to be preceded by a caution signal providing the sighting distance is signal.\nsufficient\n\nMod.A Metro differences v5.docx",
      "source_file": "18_Metro_vs_Railways_V5.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 6,
      "text": "Institution of Railway Signal Engineers\nPo ependability\nGiven the effect on trains and on passenger management of even short These factors are important, but less critical apart from the most densely\nduration failures, very high levels of system reliability and availability are used sections of the network.\nrequired. Robust hardware, equipment redundancy (duplication), remote\ncondition monitoring and fast system recovery can all be used to achieve\nthis. Fallback capabilities to maintain operations also need to be able to be\nimplemented quickly.\ninfrastructure\nOften in tunnels or overhead viaducts, particularly in city centres. Tunnel A very small proportion of route is in tunnels. Most are quite short,\nlengths can be very long. except where the routes pass through major mountain ranges or under\nthe sea.\nGrade separated junctions (e.g. flyovers) are the norm in the areas of the Similar considerations apply in the areas of highest frequency traffic, but\nhighest frequency traffic to increase capacity by avoiding conflicting the majority of junctions are “flat” to avoid expensive civil engineering\nroutes. works and greater land take.\nUsually completely independent of road or pedestrian traffic. Trains are Level (grade) crossings for road or pedestrian movements across the\ntypically too frequent to allow realistic opportunities for crossing the railway are common on many lines.\nrailway.\nTraction\nElectricfor avoidance of air pollution and for high acceleration with high Mostly electric or diesel. Benefits of regenerative braking are greatest on\nperformance motors. Regenerative braking for lower heat gain intunnels | electrified lines with frequent services so that other trains can use the\nand energy economy. electricity generated.\nMod.A Metro differences v5.docx",
      "source_file": "18_Metro_vs_Railways_V5.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 7,
      "text": "Institution of Railway Signal Engineers\nAutomation\nGrades of Automation\nMetros can be designed to operate under several degrees of automation, ranging from nil (now unusual except for systems operating like\ntramways) to full automation (with no staff member on the train). These are described by a number of Grades of Automation (GoA).\nTrain\nGOoADO Operator Driver Driver Driver Diver\nonly\nATP with\nGoA1 Train Driver Driver Driver Driver\nOperator\nATP & ATO\nGoA2 with Train Driver Driver\nOperator\nDriverless wees ae\nUnattended\nGoA4 i Train\nOperation\nThe automation functions (ATP, ATO, ATS) are described below.\nMod.A Metro differences v5.docx",
      "source_file": "18_Metro_vs_Railways_V5.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 8,
      "text": "Institution of 外| Engineers\nAutomatic Train Protection (ATP)\nThe ATP sub-system delivers the limit of movement authority to each train. This determines where the train is permitted to travel based on the routes set\nby the interlocking and the position of other trains. The ATP supervises train movements and ensures that they only occur on authorised routes, in the\ncorrect direction and within the limits of the movement authority. The ATP ensures the safety of all train movements, irrespective of whether train control\nis from the Automatic Train Operation sub-system or the train operator (driver). The primary ATP functions are as follows:\ne Trackside ATP equipment, most commonly found in signalling equipment rooms at stations and/or at control centres\noO Train location tracking\no Movement authority determination to ensure safe train separation\noO Temporary speed restriction application\no Emergency train evacuation supervision\no Interlock train movement with platform screen doors, staff protection key switches (work zone protection) and platform emergency stop\nplungers\ne Train borne ATP equipment\no Determine the position of the train and report to the trackside ATP\n© Determine the status of the ATP sub-system health and which driving modes are available (manual, automatic etc.)\no Ensure the train does not exceed the movement authority limit\no Ensure that train does not exceed the permanent or temporary speed restrictions\no Train direction supervision\no Correct side door enabling at platforms (door open control protection interlocks)\noO Supervise emergency train evacuation\no Ensure all doors closed and locked prior to station departure.\ne Track-mounted ATP sub-system\n© Equipment mounted on the track (such as beacons/transponders) to provide a positioning reference; also used by the ATO equipment.\nMod.A Metro differences v5.docx",
      "source_file": "18_Metro_vs_Railways_V5.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 9,
      "text": "Institution of Railway Signal Engineers\nAutomatic Train Operation (ATO)\nThis is the sub-system that drives the train between stations within the constraints established by the ATP sub-system. The functionality of the ATO will vary\ndepending upon the grade of automation. For GoA4 metros where no train operator is present, all functions performed by the train operator on a GoA1\nmetro are performed by the ATO sub-system. The ATO functions include:\n\ne Driving the train from station to station obeying permanent and temporary speed restrictions within the movement authority provided by the ATP\n\ne Train door and platform screen door open and closing\n\ne Platform dwell time management\n\ne Apply applicable energy saving driving strategies\n\ne Jog, realigning an incorrectly stopped train to within the specified ATP door opening tolerance.\n\ne Selecting the appropriate driving profile for the line type, such as surface tunnel, wet etc.\n\ne Applying platform hold, train hold and station skip commands\nSignalling and train control facilities in metro depots often are not provided, or they are very simple. However, it is becoming common on modern metro\nsystems (and in particular on driverless/unattended metro systems) to deploy the same signalling solution in depots as on the rest of the line to provide\nATP and ATO functions. This could include, for example:\n\ne Automatic routing of trains to and from storage tracks, to permit efficient scheduled and “on-demand” service build ups and reductions\n\ne Automatic close-up of trains on storage tracks\n\ne Automatic coupling and uncoupling of trains\n\ne Automatic cycling of trains through train inspection facilities or exterior car wash facilities.\nAutomatic Train Supervision (ATS)\nThe ATS sub-system is responsible for the overall line control function. It is located at the control centre and it presents the state of the railway to the\noperators. It controls the trains, but the operators can intervene when the service deviates beyond the recovery capability of the ATS sub-system.\nThe primary functions of the ATS sub-system are as follows:\n\ne Issue commands to the interlocking and other sub-systems to route trains to their destinations.\n\ne Display the state of the railway to the operator, tracking trains and displaying the signalling equipment status.\nMod.A Metro differences v5.docx",
      "source_file": "18_Metro_vs_Railways_V5.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 10,
      "text": "Institution of Railway Signal Engineers\n\ne Service regulation, adjusting the service to keep to the timetable or to equalise the interval between trains.\n\ne Provide the user interface for operators to adjust the service when needed\n\ne Alarm management\n\ne Provision of service information to customer information systems\n\ne Logging and playback for incident investigation.\n\nFailure of the ATS sub-system should not directly affect the safety of passengers.\nAutomation benefits\nThe benefits of the various degrees of automation include the following:\n\ne Automation of the train driving functions can provide for more regular and predictable run times between stations, eliminating the variations\ninherent with manual driving. This can enable higher line capacity by reducing recovery margins which partly allow for different driving styles.\n\ne Driverless and unattended train operation, with automatic passenger door opening and closing and with automatic train departure from station\nplatforms, can further reduce the variations in line operation.\n\ne Unattended train operation frees the metro operator of the constraints imposed by the need to roster train crews. It also provides the flexibility to\noperate shorter trains more frequently. This makes it easier to respond to variations in demand throughout the day, while still delivering a frequent\nservice.\n\ne Unattended train operation, when combined with fully automated maintenance yards and stabling tracks, provides the flexibility to respond to\nunexpected increases in passenger demands by adding additional trains to the service, all without requiring additional train drivers or manual\nintervention.\n\ne Lower operating costs for driverless trains.\n\ne Automation of turnback at terminal stations can reduce turnover times, reducing the number of train sets needed for operation.\n\ne Automation of train regulation, train dispatching and train routing functions can more effectively regulate the performance of trains in relation to\ntimetable (schedule) and headway adherence. Regulation (e.g. to equalise the time interval between successive trains) can be achieved by\nautomatically adjusting dwell times and/or by automatically controlling run times between stations (e.g., through adjustments to train acceleration\nand service brake rates, and speeds).\n\ne Automation of train regulation functions can minimise overall system delays by optimising the scheduling of each train.\n\nMod.A Metro differences v5.docx",
      "source_file": "18_Metro_vs_Railways_V5.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 11,
      "text": "Institution of Railway Signal Engineers\ne The automatic, real-time control and coordination of train acceleration, train coasting, and train braking can also be utilised to implement energy\noptimisation algorithms, for example though coasting controls or by synchronising the acceleration of one train with the braking of another train to\nmaximise use of brake energy recovery.\ne Automated failure detection and response can be more effective in responding to system disturbances and emergencies through the elimination of\nhuman error.\nThere are some drawbacks to set against the benefits above.\ne Increased staff costs for any additional passenger service and security personnel\ne Additional capital and maintenance costs associated with the automation system itself\ne Additional costs arising from contingency arrangements to deal with failures and emergencies on unattended systems.\nControl Systems\nThese range from systems with lineside signals observed by a driver to ones with full automation and no drivers. Three common systems are described\nbelow. The more advanced systems will typically be able to deliver higher line capacity (i.e. more trains per hour)\nLineside Signals with fixed block working\nThe diagram below illustrates the headway that can be achieved with 2 aspect signalling.\nMod.A Metro differences v5.docx",
      "source_file": "18_Metro_vs_Railways_V5.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 12,
      "text": "Institution of Railway Signal Engineers\nSEoumiefConte + altace: nustoe cea teciga: the $2 a-een aspect\nSighting 5oint ss >\n\\ S? S]\nV C O\nIUD 一> TOTO\n| RT SB |\n. d |\n9 O -~ -上 >\ner\n3 Signting cistence jm} O Overlea length im)\nRT Oriverreectior cistanzetycicelly 2-Sseconasat¥Y (mi) _ — Trainlergth{m;\nSB Service oraking aistance (Mm? H, Heacway cistence (Mm)\na = Distance between signals (ml V Soeec of train (m/s}\nCab Signalling with Coded Track Circuits\nWith cab signalling, headway is no longer constrained by the distance between lineside signals. Shorter headways can be achieved by the subdivision of a\nsignal block into shorter sections. Train speed is detected and controlled separately in each of these short sections, thus enabling shorter headways and\ngreater line capacity.\nThe track is divided into predetermined short track circuit lengths and each track can be fed with any one of a number of codes, each code signifying a\nmaximum safe speed, target speed, or for some metro systems, both the maximum safe speed and target speed.\nThe appropriate code for each track circuit is determined by the nearby interlocking depending upon the position of track occupancy ahead of any train, or\nthe requirement for junction or other speed restriction. Modern systems typically use audio frequency signals to convey a specific command.\nA train traversing a track circuit picks up the coded signal from the transmitter via an antenna. The signal is decoded, and the actual train speed is\ncompared with the decoded track signal to determine if the train is above or below the authorised speed.\nMod.A Metro differences v5.docx",
      "source_file": "18_Metro_vs_Railways_V5.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 13,
      "text": "Institution of Railway Signal Engineers\nDirection of Travel\nTrain B = 1 四 Train A 6 |\nTa a el ep yy Block1 + Block 2 Block 3 1 Block 4 eee eee\nBlock 5\n局 Block 1 overlap\n已.\n” Block 2 Overla\n(60 km/h)\nBlock 3 Overlap\n130 krr/F)\nNo Code Code Code Code Code No Code\nCode 80/77 80/57 60/27 30/0 0/0 Code 80/77\n——_ Tain B Driving Speed MSS/TS\n= Train B Maximum Safe Speed MSS: Maximum Safe Speed (km/h) enforced by the ATP\nTS: Target Speed (km/h) for the ATO system to drive to\nNo Code: There is no code present below and behind a train in a black as the\ncode is transmitted from the exit end of the block and the train axles\nshort out the track circuit. No Code is interpreted as Stop.\nExample of ATP code sequence ina track circuit based speed code system\nIf the train speed is excessive the driver must reduce the speed to below the authorised speed or be subjected to an emergency brake action, generally to a\nstandstill. A typical arrangement is shown in the diagram above in which it can be seen that if the train is driven in accordance with the Target Speed\nindications, it will be brought to a stop with one track circuit between it and the preceding train. Should the train fail to operate below the Maximum Safe\nSpeed profile at any time (and no corrective action is taken) the train will be automatically brought to a stop within or before the 0/0 code track circuit. As a\ntrain moves from block to block, the codes step up in the blocks behind.\nMoving Block Signalling (loop & radio-based systems)\nMoving block systems provided by Communication Based Train Control (CBTC) systems are now the preferred metro train control technology. The principle\nof a moving block system is that each train moves within its own allocated block. A limit of movement authority is issued to the train which defines the\npoint beyond which the train must not go. This is usually the end of the route or the rear of the train ahead, whichever is encountered first. There is a\nsafety margin to account for rollback and errors in train location reporting. As the preceding train moves, so does the block, hence the name. The length of\nMod.A Metro differences v5.docx",
      "source_file": "18_Metro_vs_Railways_V5.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 14,
      "text": "Institution of Railway Signal Engineers\nthe block depends on the braking distance of the following train, so (unlike a fixed block system with lineside signals) a train can safely come to a stop very\nclose to the rear of a stationary train.\nSafety\n\n3 Distance\n\na\n\na\n\n; |\n\nTTL ll sellells mg II\n— Emergency brake profile / AN\n— = Service brake ta rest Stopping —_ Limit of\n=) Pasition reference beacon Point Movement\nAutharity\nMoving block signalling train separation\nMoving block systems do not need traditional train detection sub-systems such as track circuits or axle counters, but some do have them to support mixed-\nmode operations or to facilitate system recovery following a train location determination failure. Moving block systems require continuous communications\nbetween the train and trackside to receive train position reports and provide updated movement authorities. Two solutions are currently in use, inductive\nloops and radio.\nFully automatic trains\nThere are no technical reasons why trains cannot be driven fully automatically without the need for any manual intervention on board trains. The economic\nand operational benefits of fully automatic operation are significant, largely due to the greater degree of flexibility in scheduling trains without the need for\narranging for drivers to be present at the correct time and place.\nTrains equipped with a continuous form of ATP and ATO are capable of operating safely and efficiently with minimal action by drivers or attendants. Generally\nthe role of the staff is to ensure that alighting passengers are clear of closing doors prior to train departure from stations and/or opening train doors on arrival\nat stations. Such functions can be automated, provided that equipment is installed to fulfil these roles safely and provide passengers with information which\nmay have been provided had a driver been present. Such equipment may include:\ne additional CCTV equipment on station platforms to ensure passenger safety;\ne ontrack obstruction detection equipment in-station areas (infra-red or radar systems);\n\nMod.A Metro differences v5.docx",
      "source_file": "18_Metro_vs_Railways_V5.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 15,
      "text": "Institution of Railway Signal Engineers\n\ne platform screen doors;\n\ne = bi-directional voice communication between train passengers and control centre;\n\ne additional train systems monitoring and reporting equipment for diagnostic purposes.\nHowever a trained human presence on the train can deal with failures and emergencies (e.g. by manual driving or passenger evacuation) and it is necessary\nfor a fully automated line to have processes for both passengers and trains to deal with these events.\nMetros operating fully automatic systems include:\n\ne Vancouver Skytrain\n\ne VAL systems (France and elsewhere);\n\ne Lyon Metro Line D\nMod.A Metro differences v5.docx",
      "source_file": "18_Metro_vs_Railways_V5.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    }
  ]
}