{
  "doc_id": "28b98af6-231a-4a0c-b057-8e2bb748940d",
  "pages": [
    {
      "page_number": 1,
      "text": "CIAF\nwiht\nComision de Investigacion de\nAccidentes Ferroviarios\nINFORME FINAL (IF) 70/2022\nIncidente operacional con riesgo de colision ocurrido el 15 de\nagosto de 2022 en la estacion de Manresa (Barcelona).\nEnglish summary included in page 45.\nP ch GOBIERNO MINISTERIO —\nDE ESPANA Peet ORB ay MOVILIDAD onsen oe nwesmencion",
      "source_file": "ES-10306- 202270 0815 IF Manresa (english version).pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 2,
      "text": "Advertencia\n\nEl presente informe es un documento técnico que refleja el punto de vista de la Comision\nde Investigacion de Accidentes Ferroviarios en relaci6n con las circunstancias en que se\nprodujo el evento objeto de la investigacién, con sus causas probables y recomendaciones\nde seguridad.\n\nTal como especifica el RD 623/2014, de 18 de julio en su articulo 4, puntos 4 y S:\n\n“4, La investigacion tendra como finalidad la determinacion de las causas del accidente 0\nincidente de que se trate y el esclarecimiento de las circunstancias en las que éste se\nprodujo con el fin de incrementar la seguridad en el transporte ferroviario y favorecer la\nprevencion de accidentes”.\n\n“5. En ningun caso la investigacion tendrd como objetivo la determinacion de la culpa o\nresponsabilidad del accidente o incidente y serd independiente de cualquier investigacion\njudicial”.\n\nConsecuentemente, el uso que se haga de este informe para cualquier proposito distinto al\nde la prevencidn de futuros accidentes puede derivar en conclusiones e interpretaciones\nerroneas.\n\nComision de Investigacion de Accidentes Ferroviarios - CIAF\n\nSubsecretaria\n\nMinisterio de Transportes, Movilidad y Agenda Urbana\n\nGobierno de Espafia\n\nPaseo de la Castellana, 67\n\n28071 Madrid\n\nEspana\nNIPO: 796-23-042-0",
      "source_file": "ES-10306- 202270 0815 IF Manresa (english version).pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 3,
      "text": "ÍNDICE\n0 LISTA DE ABREVIATURAS ............................................................................................................................. 4\n1 RESUMEN ........................................................................................................................................................ 5\n2 LA INVESTIGACIÓN Y SU CONTEXTO .......................................................................................................... 6\n2.1 DECISIÓN Y MOTIVO ............................................................................................................................. 6\n2.2 ÁMBITO Y LÍMITES DE LA INVESTIGACIÓN ......................................................................................... 6\n2.3 COMPOSICIÓN DEL EQUIPO INVESTIGADOR .................................................................................... 6\n2.4 CANALES DE COMUNICACIÓN ............................................................................................................. 7\n2.5 MÉTODOS Y TÉCNICAS DE INVESTIGACIÓN Y ANÁLISIS ................................................................. 8\n2.6 INTERACCIÓN CON AUTORIDADES JUDICIALES ............................................................................... 8\n2.7 OTROS ASPECTOS DE LA INVESTIGACIÓN ....................................................................................... 8\n3 DESCRIPCIÓN DEL SUCESO ......................................................................................................................... 9\n3.1 EL SUCESO Y SUS CIRCUNSTANCIAS ................................................................................................ 9\n3.2 DESCRIPCIÓN DE LOS HECHOS ........................................................................................................ 15\na) CADENA DE ACONTECIMIENTOS PREVIOS AL SUCESO ................................................................ 15\nb) PLAN DE EMERGENCIA INTERNO-EXTERNO ................................................................................... 24\n4 ANÁLISIS DEL SUCESO ............................................................................................................................... 25\n4.1 COMETIDOS Y DEBERES RELACIONADOS CON EL SUCESO ........................................................ 26\n4.2 MATERIAL RODANTE E INSTALACIONES TÉCNICAS. ...................................................................... 30\n4.3 FACTORES HUMANOS ........................................................................................................................ 32\n4.4 MECANISMOS DE RETROALIMENTACIÓN Y CONTROL .................................................................. 36\n4.5 INCIDENCIAS ANTERIORES DE CARÁCTER SIMILAR ...................................................................... 38\n5 CONCLUSIONES ........................................................................................................................................... 40\n5.1 RESUMEN DEL ANÁLISIS Y CONCLUSIONES ................................................................................... 40\n5.2 MEDIDAS ADOPTADAS DESDE EL SUCESO ..................................................................................... 43\n5.3 OBSERVACIONES ADICIONALES ....................................................................................................... 43\n6 RECOMENDACIONES DE SEGURIDAD ...................................................................................................... 44\nAPPENDIX: ENGLISH SUMMARY OF THE MAIN PARTS OF THE REPORT ................................................... 45\n3",
      "source_file": "ES-10306- 202270 0815 IF Manresa (english version).pdf",
      "garbled": true,
      "garbled_reason": "low_informative_ratio",
      "ocr_used": false,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 4,
      "text": "Comision de Investigacion de Accidentes Ferroviarios\n\n0 LISTA DE ABREVIATURAS\nADIF Administrador de Infraestructuras Ferroviarias\nAESF Agencia Estatal de Seguridad Ferroviaria\nASFA Anuncio de Sefales y Frenado Automatico\nBAB Bloqueo Automatico de via Banalizada\nBAD Bloqueo Automatico en via Doble\nBLAU Bloqueo de Liberacién Automatica de via Unica\nCG Centro de Gestion\nCIAF Comisién de Investigacién de Accidentes Ferroviarios\nCM Cuadro de Mando (local)\nCMS Control, Mando y Sefializacion\nCTC Control de Trafico Centralizado\nCV Circuito de via\nEl Equipo de Investigacion\nERTMS European Railway Traffic Management System\nIE Investigador Encargado\nJTO Jefatura Técnica de Operaciones\nMC Mando Centralizado; CTC\nML Mando Local\nPLO Puesto Local de Operaciones.\nPM Puesto de Mando\nRCM Responsable de circulacion de la estacién de Manresa\nRCF Reglamento de Circulacion Ferroviaria\nRC del CTC Responsable de circulacion del Control del Trafico Centralizado (CTC).\nRFIG Red Ferroviaria de Interés General\nTT Sistema de radiotelefonia Tren-Tierra\nUT Unidad Técnica\nVAT Vocal Asesor Técnico\n\n4",
      "source_file": "ES-10306- 202270 0815 IF Manresa (english version).pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 5,
      "text": "Informe Final 70/2022\n1 RESUMEN\nEl responsable de circulacion de Manresa (RCM) autorizo mediante telefonema al maquinista del tren\n95128 a emprender la marcha desde la via 5 de la estacidn de Manresa hacia el lado Sant Vicenc de\nCastellet a las 18:34 del dia 15 de agosto de 2022, disponiendo el itinerario para ello. A las 18:41,\ncuando el tren 95218 aun no habia iniciado la marcha, el RCM autorizo mediante telefonema al\nmaquinista del tren 78443 a rebasar la sefial de entrada 3023 de Manresa del lado de Sant Vicenc de\nCastellet disponiendo un itinerario incompatible con el movimiento que habia autorizado\npreviamente. Tras iniciar la marcha, después de trascurrir varios minutos desde que se autorizo su\nmovimiento, el tren 95128 talono el desvio n2 19 continuando por via 1, por la que circulaba de frente\nel tren 78443, que iba a estacionarse en via 4. Los maquinistas de ambos trenes, al percatarse de la\nsituacion, detuvieron los trenes quedando enfrentados a una distancia de 40 metros (ver Imagen 15,\npagina 25).\nComo resultado del incidente operacional solo se produjeron dafios en el desvio n219. No se\nprodujeron dafos personales, ni dafios en el material rodante.\nLa estacidn de Manresa pertenece a linea 220 — Lleida-Pirineus— Bifurcacién Vilanova de la Red\nFerroviaria de Interés General. Se ubica en el municipio de Manresa, provincia de Barcelona\n(Catalufia).\nConclusion: los factores causales fueron una autorizacion indebida de rebase de sefial al tren 78443\nsin haber comprobado si el tren 95218 habia emprendido la marcha y liberado la ruta y, por otro lado,\nel hecho de que el tren 95218 iniciara la marcha estando su orden de marcha invalidada al no haber\nsalido inmediatamente tras la emision del primer telefonema. Se han considerado como factores\ncontributivos la existencia de una situaci6n degradada en la estacion de Manresa originada por la\ntoma de decisiones del RCM, en relacion con las peticiones del Centro de Gestion de Rodalies para el\ntraslado de material rodante averiado; la perturbacién en las condiciones de explotacion de la\nestacion debidas a la ocupacidn del circuito CVA3 y en la hora de salida del tren 95218 por el descanso\nque hizo el maquinista del tren 95218, entre otros. Se han considerado como factores sistémicos las\npeculiaridades del enclavamiento eléctrico de Manresa, las condiciones de visualizacién de\nexpedicion de trenes en dicha estacion, las deficiencias en las habilidades asertivas del personal de\ncirculaci6n y la existencia de problemas recurrentes de comunicacion entre maquinistas y\nresponsables de circulacion.\n\n5",
      "source_file": "ES-10306- 202270 0815 IF Manresa (english version).pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 6,
      "text": "Comision de Investigacion de Accidentes Ferroviarios\nSe establecen cuatro recomendaciones a través de la AESF dirigidas a ADIF, Renfe Viajeros y a las\nempresas ferroviarias.\n2 LAINVESTIGACION Y SU CONTEXTO\n2.1 DECISION Y MOTIVO\nEl Real Decreto 623/2014, de 18 de julio, regula la investigacién de los accidentes e incidentes\nferroviarios en la Red Ferroviaria de Interés General espafiola, asignando dicha funcion, en su articulo\n5, ala Comision de Investigacion de Accidentes Ferroviarios (CIAF).\nDe conformidad con los articulos 4.1, 9 d) y 14.2 del Real Decreto 623/2014 y en base a lo establecido\nen el articulo 7 b), que establece que la CIAF podra investigar los accidentes y los incidentes que, en\ncondiciones ligeramente distintas, pudieran haber provocado accidentes graves, el presidente de la\nCIAF decidio abrir la investigacién del presente suceso el 15 de septiembre de 2022, oida la opinion\nde los miembros del Pleno reunidos en sesion plenaria celebrada en dicha fecha.\n2.2 AMBITO Y LIMITES DE LA INVESTIGACION\nLa investigacién trata de abordar la descripcién de los hechos retrotrayéndose en el tiempo lo\nsuficiente para determinar las circunstancias que propiciaron las autorizaciones de rebases de sefial\nen la estacion de Manresa. También tratara de indagar en los factores técnicos, humanos y\norganizacionales que contribuyeron al modo en que se autorizaron dichos rebases de sefal.\n2.3 COMPOSICION DEL EQUIPO INVESTIGADOR\nDe conformidad con lo establecido en el articulo 9 e) del Real Decreto 623/2014 por el que se regula\nla investigacién de los accidentes e incidentes ferroviarios y la CIAF, el 15 de septiembre de 2022 y\nmediante resolucién del presidente de la CIAF se designa como Investigador Encargado (IE) a un\nInvestigador Coordinador adscrito a la Secretaria de dicha Comision. El Investigador Encargado dirige\nal Equipo de Investigacién (El), conformado por un Investigador de Accidentes adscrito también a la\nmencionada Secretaria. Todos ellos son ingenieros y tienen experiencia en la investigacién de\naccidentes ferroviarios.\nEl Equipo de Investigacién cuenta con el apoyo de los miembros del pleno de la Comision.\nEl El goza de plena independencia funcional para el desarrollo de las labores investigadoras y seguira\nlas directrices marcadas por el presidente para la investigacion del suceso.\n\n6",
      "source_file": "ES-10306- 202270 0815 IF Manresa (english version).pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 7,
      "text": "Informe Final 70/2022\n2.4 CANALES DE COMUNICACION\nEl jefe de area de investigacion de accidentes de la Direccion Corporativa de Seguridad en la\nCirculaci6n del Administrador de Infraestructuras Ferroviarias (ADIF), mediante mensajeria movil\n(SMS) a las 19:40 horas del dia 15 de agosto de 2022, comunic6 a la Comision de Investigacioén de\nAccidentes Ferroviarios que se habia producido el suceso objeto de esta investigacion.\nADIF presento informacion preliminar necesaria para la investigacioén del accidente: interpretacién\ndel videografico del CTC de la estacion de Barcelona Francia, andlisis de los registradores de seguridad\nde los trenes implicados, transcripcidn de las grabaciones de las llamadas entre los agentes\nrelacionados con el suceso, actas de las entrevistas con dichos agentes, documentos de admision de\nlos trenes, etc...\nAnalizada la informacion remitida, la CIAF considerd necesario solicitar nueva informacion a ADIF y a\nRenfe Viajeros. ADIF remitiéd las grabaciones de todas las conversaciones, incluidas las del RCM y el\nRC del CTC con el CG de Rodalies, los libros de telefonemas y de bloqueo del gabinete de circulacién\nde Manresa y la habilitacion del RCM. Renfe Viajeros envio un informe al respecto de la averia de la\nUT en via 5 y la informacién correspondiente al maquinista del tren 95218 y del personal del centro\nde gestion.\nLa CIAF considero necesario solicitar informacién adicional a ADIF para conocer las condiciones de\ntrafico de la estaci6n de Manresa el dia del suceso y a Renfe para conocer las comunicaciones entre\nel centro de gestion y el maquinista el dia del suceso. ADIF remitid documentacion al respecto.\nLa documentacion solicitada ha sido entregada a la CIAF en un plazo de tiempo suficiente para no\nperturbar el normal desarrollo de la investigacion, si bien, la informacién sobre las comunicaciones\nentre el centro de gestion y el maquinista el dia del suceso, muy importante para el desarrollo de la\ninvestigacion, no ha sido entregada a la CIAF de forma integra.\nLa CIAF realizo entrevistas al personal de ADIF, Renfe Viajeros e Irvia que tuvo relacion con el suceso.\nTambién se han llevado a cabo reuniones con personal de mayor rango jerarquico dentro de las\norganizaciones de ADIF y Renfe Viajeros: subdirectores de circulacién y de instalaciones, por parte de\nADIF, y jefe de operaciones, por parte de Renfe Viajeros. La disponibilidad del personal para la\nrealizacion de las entrevistas y reuniones ha sido correcta.\nTanto el administrador de la infraestructura como la empresa ferroviaria han realizado sus propias\ninvestigaciones sobre el suceso, trasladandoselas a la CIAF. El informe particular de la empresa\nferroviaria fue recibido el 27 de febrero de 2023. El informe del administrador de la infraestructura\n\n7",
      "source_file": "ES-10306- 202270 0815 IF Manresa (english version).pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 8,
      "text": "Comision de Investigacion de Accidentes Ferroviarios\n(ADIF) fue entregado a la CIAF el 8 de marzo de 2023. Ninguno de los dos informes fue entregado en\nel plazo de tres meses desde que ocurrid el suceso, tal y como indica el procedimiento de\ninvestigaci6n aprobado por la CIAF y comunicado a los administradores de infraestructuras y\nempresas ferroviarias.\nEn cumplimiento del articulo 15.2 del Real Decreto 623/2014, de 18 de julio, por el que se regula la\ninvestigacion de los accidentes e incidentes ferroviarios y la Comision de Investigaci6n de Accidentes\nFerroviarios, se remitid el informe provisional a las siguientes entidades para que facilitaran\ninformacién técnica pertinente para mejorar la calidad del informe de investigacién: ADIF, Renfe\nViajeros y sindicatos del personal involucrado en el incidente.\n2.5 METODOS Y TECNICAS DE INVESTIGACION Y ANALISIS\nPara el esclarecimiento de los hechos y la obtencidn de los distintos factores causales, contribuyentes\ny sistémicos que se mencionan en el presente informe se han utilizados las siguientes técnicas y\nmétodos de investigacion.\nEn cuanto a técnicas de investigacién, se han realizado entrevistas presenciales con los agentes\nrelacionados con el suceso y con sus superiores jerarquicos y se ha analizado la documentacion\nentregada por las entidades involucradas.\nEl método utilizado para contemplar los sucesos y las condiciones que provocaron la incidencia, sus\nprecursores y las caracteristicas del marco normativo y de supervision que influyeron en la misma fue\nel arbol de causas.\n2.6 INTERACCION CON AUTORIDADES JUDICIALES\nNo procede.\n2.7. OTROS ASPECTOS DE LA INVESTIGACION\nNo procede.\n\n8",
      "source_file": "ES-10306- 202270 0815 IF Manresa (english version).pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 9,
      "text": "Informe Final 70/2022\n3 DESCRIPCION DEL SUCESO\n3.1 ELSUCESO Y SUS CIRCUNSTANCIAS\nDescripcién\nEl suceso que se investiga consistid en un incidente operacional con resultado de riesgo de colision\nentre los trenes 95218 y 78443. Tuvo lugar el dia 15 de agosto de 2022, festivo nacional, a las 18:41\nen la estacidn de Manresa de la linea 220 - Lleida-Pirineus— Bifurcacion Vilanova en el PK. 302+247.\nLa estacién de Manresa esta situada en las coordenadas: 41°43'5.40\"N y 1°49'53.55\"E, dentro del\nmunicipio de Manresa, provincia de Barcelona, comunidad autonoma de Catalufia.\nEl incidente se produjo entre las sefales de salida y de entrada de la estacion de Manresa del lado\nSant Vicenc de Castellet (Barcelona), y esta situado en una zona a nivel y en curva.\nDurante el incidente las condiciones meteorolodgicas y de visibilidad eran buenas y era por la tarde.\n# SN 1 Be YBN WEE Rg Br ty a ad 站一\nTe RE et ee we OY ha Sy aay .\neee eg BO NG AE eet Se:\nUe _~ - _. 网 2 \\ tg . a ee 四 st . gs ai - Te 、、 站 . 区 Fn q\nee es KO Be: a, SOARS -As 了\nlss Bo 从 司 we S| | NA AL RY. ae)\n> . > te A rae 1 lee N, 7 、: A ; Bn a, aa ‘. ‘ee\nLado Lleida 从 Din we INS % Mie)\nSSE nay - “ ~~ Ye on ‘ *. Ve . aS «\nSON a - ef . ine AR AN\n2 . sO 一 四 一 网 人 952 18, | iM\ni od . . oF. ' .\n2 de Castellet ie PON\nGoogle Earth AN | fe iy rr ‘2 Ng.\nImagen 1 Zona de Ia linea ferroviana (fuente: Google Earth)",
      "source_file": "ES-10306- 202270 0815 IF Manresa (english version).pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 10,
      "text": "Comision de Investigacion de Accidentes Ferroviarios\nVictimas y dafios materiales\nComo resultado del incidente operacional solo se produjeron dafios en el desvio n219. No se\nprodujeron dafos personales, ni dafios en el material rodante.\nInterceptacion de la via\nTras el incidente se produjo la interceptacion total de via general desde las 18:41 del dia 15 de agosto\nhasta las 3:56 del dia siguiente. Quedaron afectadas en total 15 circulaciones, entre retrasos y\nsupresiones de trenes, suponiendo una pérdida total de 471 minutos.\nPersonal y entidades\nResultan relevantes para la investigacién de este suceso las actuaciones previas del personal\nferroviario siguiente:\n>» Responsable de circulacién de la estaci6n de Manresa (RCM). Personal de ADIF.\n» Responsable de circulacion de la banda del CTC en la que se ubica la estacion de Manresa\n(RC del CTC). Personal de ADIF.\n>» Inspectores-Reguladores del CTC (Reg. del CTC). Personal de ADIF.\n>» Técnico del PM. Personal de ADIF.\n>» Técnico del Centro de Gestion de Rodalies de Barcelona de Renfe Viajeros (Técnico del CG).\nPersonal de Renfe Viajeros.\n>» Personal del Centro de Gestion de Rodalies de Barcelona de Renfe Viajeros (Personal del\nCG). Personal de Renfe Viajeros.\n> Maquinista de tren 95218. Personal de Renfe Viajeros.\n> Maquinista de tren 78443. Personal de Renfe Viajeros.\n» Mecanico de la UT 447.047. Personal de Irvia.\nResultan relevantes para la investigacion de este suceso las siguientes entidades:\n>» ADIF: administrador de la infraestructura en la que se produjo el suceso.\n>» Renfe Viajeros: empresa ferroviaria de los maquinistas de los trenes afectados.\n> Irvia: taller de mantenimiento de la unidad técnica averiada en la estacion de Manresa (UT\n447.047).\n10",
      "source_file": "ES-10306- 202270 0815 IF Manresa (english version).pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 11,
      "text": "Informe Final 70/2022\nMaterial rodante\nLas unidades implicadas en el suceso pertenecen al primer lote de la Serie 447. Esta serie es de\ntraccion eléctrica. La composicién es de tipo Mc-R-Mc. Su velocidad maxima es de 120 km/h.\n\n- oy el vd “A aac! 2 tt ae, ww Te\nr uf - “一 一 | a\nImagen 2 Tren Renfe Sere 447.\nEl tren 78443 era una composicién doble formada por la UT 447.049 en cabeza y la UT 447.117 en\ncola y el tren 95218 era una composicion doble formada la UT 447.059 en cabeza y la UT 447.047 en\ncola y remolcada. Ambas composiciones iban equipadas con el sistema de proteccidn ASFA Digital y\ndisponian de seis vehiculos, 24 ejes, 152 metros de longitud y 437 toneladas de masa remolcada.\nEl tren 78443 cumplia un servicio de Rodalies de la linea R4 con salida a las 15:48 de la estacion de\nSant Vicenc de Calders y llegada prevista a Manresa a las 18:42 acumulando un retraso con respecto\nal horario tedrico de siete minutos.\nEl tren 95218 cumplia con un servicio especial como material vacio para llevar la UT 447.047, que se\nencontraba averiada, remolcada a los talleres de Montcada. Tenia prevista su salida de la estacidn de\nManresa a las 18:20, siendo expedido minutos mas tarde, y su llegada prevista a Montcada\nBifurcacion a las 19:01.\n11",
      "source_file": "ES-10306- 202270 0815 IF Manresa (english version).pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 12,
      "text": "Comision de Investigacion de Accidentes Ferroviarios\nInfraestructura, instalaciones y comunicaciones\nLa estacidn de Manresa se encuentra situada en el PK 301+700 de la Linea 220 Lleida Pirineus-\nBifurcacion Vilanova. Se trata de una estacion en la que se produce la transicion de via Unica (lado\nLleida) a via doble (lado Sant Vicenc de Castellet-Barcelona), de forma que en el lado de Lleida la linea\ndispone de via Unica con BLAU y en el lado de Sant Vicenc de Castellet de via doble con BAD.\nEn el lado Sant Vicenc de Castellet, las vias 2, 4, 6, 3 y 5 tienen sefial de salida que son: 3020/2, 3020/4,\n3020/6, 3020/3 y 3020/5. La entrada desde via impar a la estacion por el lado Sant Vicenc de Castellet\nse hace con la sefial 3023. En via par, que es la via para las circulaciones con sentido hacia Sant Vicenc\nde Castellet, esta la sefial de maniobras R1.\nLas vias 3 y 5 son vias de mango que acaban en topera. La distancia entre la topera de via 5 y el desvio\nn211, en el que se bifurcan la via 3 y la via 5, es de 240 metros aproximadamente, y entre la topera\nde via 5 y sefial de salida 3020/5 es de 135 metros. Por otro lado, el circuito de agujas CV A3 implica\na los desvios n21, n23, n211. La longitud de tres UT de la serie 447 es 228 metros, por lo que el\nestacionamiento de tres unidades en la via 5 supondria la ocupacion del CV A3, el rebase de la sefial\n3020/5 y quedar prdximo al desvio n21.\nUn tren que sale de via 5 hacia via par (lado Sant Vicenc de Castellet) tiene que pasar de talon por los\ndesvios n21, n23 orientados hacia via desviada, el escape 11/13 orientado hacia via desviada, de talon\nel desvio n219 orientado hacia via directa y por el desvio n221 (del escape 21/23) orientado hacia via\ndirecta. Un tren que va de via 1 general del lado Sant Vicenc de Castellet hacia via 4 de la estacion\ntiene que pasar por el escape 21/23 orientado a posicién invertida, de punta por el desvio n219\norientado hacia via desviada y de punta por el desvio n215 orientado hacia via directa. Ambos\nitinerarios son incompatibles ya que implican al escape 21/23 y al desvio n219 en posiciones\ncontrarias para cada uno de ellos.\nEl lado de Sant Vicenc de Castellet de la estacion de Manresa se encuentra en curva.\nLa estacidn de Manresa se puede controlar en Mando Local desde su Gabinete de Circulacién o en\nmando centralizado desde el CTC. Esta gobernada por un enclavamiento eléctrico de cableado libre\ny su descripcion y funcionamiento se regula en la Consigna Serie A n2 1398 y sus anejos, que detalla\nlos movimientos y rutas posibles del enclavamiento de la estacion, asi como las incompatibilidades\nentre los movimientos. En mando local, el enclavamiento eléctrico se gobierna en un Cuadro de\n1 La ubicacion de los desvios se refiere a la punta de los espadines y no al piquete.\n\n12",
      "source_file": "ES-10306- 202270 0815 IF Manresa (english version).pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 13,
      "text": "Informe Final 70/2022\nMando instalado en el Gabinete de Circulacion, desde donde se concentra el mando y comprobacion\nde los aparatos, sefiales y circuitos de via.\nFe\n. . ” 所 '\n) ae 的 C— ° 、 . 四 “ 2\n上\noa:\nImagen 3 Cuadro de Mando de Ia estacién de Manresa\nLa estacidn de Manresa es cabecera de la linea de Rodalies R4, donde rotan los trenes. Para ello es\npreciso que ocupen vias durante un tiempo, necesario para descanso o el relevo de personal, y para\nel ajuste de los horarios.\nMANRESA\nt-#——_\nt———__\\ {} —————————*\na\" vine 所\nLN ‘ CV AT 加 J\na ‘5 * Gpozonv VIA IV Br 10\neee wy a E2 (=\n19 3020川 1-3020/\"V 12 a:\nx R VIA Suv ve: 2—,.\n: = Cv AI5 一 cvu CV AL 四 2 了一\n13 16.\n— Sf CV A23 evay =) - gvais\n一 3020咱 cv “xB\n加 VIA, [EV] sa |\n1 RS\nave\nImagen 4 Consigna A de la estacién de Manresa. En azul aparece sefalado el circuito de agujas CV A3\n13",
      "source_file": "ES-10306- 202270 0815 IF Manresa (english version).pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 14,
      "text": "Comision de Investigacion de Accidentes Ferroviarios\nSe incluye a continuacion una imagen que trata de dar una vision de la localizacion de los elementos\nmas importantes de la estacion de Manresa para el analisis de este suceso.\ny F’ j / 4 6 要 _\n. fie, Escape 21/23 ie ay, a\n! ‘ ray ty 7 Py +\n: . Pd - ec - r - rod\nj . ot F 1s ¢ ‘ ir\n|” fy Zonaenla ‘ : -\n: ue a . 。 . 7\n; i: quedaron cy\na ae;\nane Oe enfrentados LADO SANT VICENC\nee ee | os trenes\nree, DE CASTELLET-\not 7 BARCELONA\n[ my .. a . rr 7\na , 机 四 ¢ A 内 r : oP wv\nth Ra ie\na Escape 11/13 4 .\n\\ RS RN -- Gabinete de\nge Nc VIAS 4 y6 circulacion\n\\, 小 . SN 7 ton 区 一 由 ” 2\nImagen 5 Detalle de los principales desvios, escapes, sefales de la estacién de Manresa en el lado de Sant Vicen¢ de Castellet\n14",
      "source_file": "ES-10306- 202270 0815 IF Manresa (english version).pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 15,
      "text": "Informe Final 70/2022\n3.2 DESCRIPCION DE LOS HECHOS\na) CADENA DE ACONTECIMIENTOS PREVIOS AL SUCESO\nBasandose en los datos de los registradores de los trenes, del videografico del CTC, de los libros de\ntelefonemas y de bloqueo de la estacion, de los registros de grabaciones y de las entrevistas del\npersonal posteriores al suceso se ha llevado a cabo la siguiente reconstruccion de los hechos.\nA las 14:40 el RC de Manresa (RCM) llama al CG de Rodalies para comentar que de la doble\ncomposicion de autopropulsados de la serie 447 estacionada en via 5 (via con topera), la UT ubicada\nhacia el lado Barcelona (UT 447.047) esta inutil y que, segun informan los mecanicos, solo podra salir\nremolcada.\nSy\nSWS.\nImagen 6 Vista del lado Sant Viceng de Castellet. La via 5 se encontraba ocupada por una doble composicion de trenes de la serie\n447. Se indica la posicién de la sefial 3020/5 y la del desvio n°1 (D1).\nEn una llamada posterior, a las 14:46 el RCM llama al CG de Rodalies para comunicarle que ha\nconsultado con el CTC la posibilidad de remolcar el material averiado en via 5 (447.047) y que hay\nuna serie de handicaps que podrian dificultar la operativa ya que la via esta en curva y necesitarian\ndos personas para llevarla a cabo ya que la cabeza de la composicion rebasaria la sefial de salida\n3020/5.\nA las 14:53 el Técnico del CG de Rodalies llama al RCM proponiéndole una maniobra para remolcar la\nUT averiada consistente en utilizar la doble composicidn del tren de las 16:35 h, el 78435, de modo\n15",
      "source_file": "ES-10306- 202270 0815 IF Manresa (english version).pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 16,
      "text": "Comision de Investigacion de Accidentes Ferroviarios\nque la UT que quedase del /ado Terrassa se desplazaria a via 5 para remolcar la UT averiada (447.047)\ny salir como material vacio hacia Montcada y, por otro lado, la otra UT se uniria a la UT operativa para\nformar un tren de viajeros. El Técnico del CG de Rodalies, una vez que le ha comentado la operativa\ndeseada, le pregunta si la via 5 tiene capacidad para albergar una tercera UT. El RCM le contesta que\nrebasaria la sefial de salida 3020/5 pero que tendria que comprobar si afecta al desvio n21, y a esto\nel Técnico del CG le responde “lo vas mirando ya, que vamos con tiempo”. Finalmente, el Técnico del\nCG le dice que espere y que va a enviar a un operario con el tren 78435 para que la acondicione.\nA las 15:30 el RCM llama al CG de Rodalies para comentar que la maniobra es viable ya que la triple\ncomposicién no pisaria el desvio n21, teniendo en cuenta las siguientes distancias: de topera a desvio\nn21, 243 metros; de topera a sefial de salida 3020/5, 187 metros y triple composicién de unidades\n447, 228 metros.\nSobre las 16:20 el RC del CTC llama al RCM para comentarle sobre una circulacién que puede afectar\na la maniobra prevista para remolcar la UT averiada en via 5.\nA las 16:41 llega el maquinista, al que el CG de Rodalies ha encomendado la realizacion de la maniobra\nen Manresa, como viajero del tren 78435, material con el que se realizara dicha maniobra, y comenta\nque esta proximo a tener que hacer los 45 minutos de descanso reglamentario (refrigerio). A las\n16:57, el RCM llama al RC del CTC para comunicarle que el maquinista que va a hacer la maniobra ya\nse encuentra en la estacion y le comenta que éste le ha dicho que esta proximo a tener que hacer los\n45 minutos de refrigerio; ambos debaten la conveniencia de hacer la maniobra antes o después del\nrefrigerio, incluso el RC del CTC plantea realizar la maniobra, pasando la UT de via 4 a via 5 y, una vez\nacopladas, hacer otra maniobra de via 5 a via 6 para ser expedidas posteriormente desde esta via.\nFinalmente acuerdan hacer la maniobra de ese modo puesto que la UT que se quedaria en via 4 junto\ncon la que quedaria en via 5, una vez maniobradas y acopladas, formarian el tren 77554.\nSobre las 17:13, el maquinista se pone en contacto con el RCM para comunicarle que ya esta\ndispuesto para realizar la maniobra, el RCM le explica ésta y le dice que esté atento a sefal. A las\n17:13:58 se establece itinerario de maniobra de via 4 a R1 con indicacion de rebase autorizado de\nsalida de via 4 para la UT situada en dicha via que ha de acoplarse a la UT inutil situada en cabeza de\nvia 5 hacia el lado Barcelona. Este movimiento concluye a las 17:19:48.\n\n16",
      "source_file": "ES-10306- 202270 0815 IF Manresa (english version).pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 17,
      "text": "Informe Final 70/2022\n[ oy\nMANANRESA\nCTt1\n和\n/ a : \\\na a > - -\nf \\ f\n/ \\ <q /\n、\nImagen 7 Movimiento de la UT 447.059 de via 4 a via 2 general.\nMientras se realiza la maniobra, el RCM llama al RC del CTC para pedir que autorice al maquinista del\ntren 78439, que esta llegando a Manresa por el lado de Sant Vicenc de Castellet, a cambiar a\nmodalidad C ya que le tendra que autorizar el rebase de la sefial de entrada 3023 para estacionarlo\nen via 2 (el enclavamiento no contempla el acceso a via 2 desde el lado Barcelona). Unos minutos\nmas tarde, a las 17:23:40, se establece itinerario de R1 a via 5 con indicacion de rebase autorizado.\nft 5\nMAMANRESA\ncr\n_. ae a\nSVD - 2 < > TCA\n{. . \\\n/ 7, ‘\nf 4 /\n/ . / 4\n区\nSV 3 a\n>\nImagen 8 Movimiento de la UT 447.059 de via 2 general hacia via 5.\nEn via 5 no caben tres UT 447 por lo que sobre las 17:28, concluida la maniobra completa, queda\nocupado el CV A3 de agujas, en contra de lo que el RCM habia previsto, y no se libera el itinerario de\nR1 a via 5. Se acondicionan las distintas unidades en via 5 y, seguidamente, a pesar de la situacion, el\n17",
      "source_file": "ES-10306- 202270 0815 IF Manresa (english version).pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 18,
      "text": "Comision de Investigacion de Accidentes Ferroviarios\nRCM permite el mantenimiento de la ocupacion del CV A3 al tolerar la ausencia del maquinista para\nefectuar el refrigerio.\n,上上 8\nMAMANRESAT:\ncca\n<> me 上 MLE 7 <>\nMUS Sore pM me\nf ‘\nMat FG NN\n人 “\n/ \\ /\n/ /\nMtL2\nML : |\nsvi | - 器\n>\nImagen 9 Ocupacién del circuito de via CV A3 por la UT 447.059 al no tener la via 5 capacidad suficiente para albergar tres\nunidades 447.\nA las 17:30:25 el RCM invierte el escape 21/23 para que el tren 78439, que viene desde Sant Vicen5\nde Castellet, se estacione en alguna de las vias pares de Manresa. En un principio su intencion es\nestacionarlo en via 2 pero no puede al estar el CV A3 ocupado, y ademas el itinerario de la sefal R1 a\nvia 5 esta sin disolver. Seguidamente el RCM llama al RC del CTC para comunicarle que el material\nque estaba haciendo la maniobra no ha librado el circuito de via de agujas. Mientras tanto, el tren\n78439 se encuentra esperando en la sefal de entrada 3023.\nA las 17:32 el Técnico del CG de Rodalies llama al RCM y le comunica que no habian dicho aun nada\nde hacer la operativa. También comentan qué hacer con el tren 78439, que esta en la sefial de entrada\nde Manresa 3023 y determinan que con ése van a hacer el tren 77554 que tenia prevista su salida de\nManresa a las 17:27. A las 17:34 el RC del CTC llama al RCM para comunicarle que avance la UT\nestacionada en via 4 para dejar espacio suficiente para estacionar ahi al tren 78439, con el que haran\nel tren 77554.\nSobre las 17:36 el inspector-regulador del PM de Barcelona Francia recibe la noticia de que en\nManresa estan haciendo maniobras. Desde el puesto del RC del CTC llaman al RCM para preguntarle\npor la situacidn en Manresa. Entre el RC del CTC y el RCM le comentan que van a autorizar al tren\n78439 a rebasar la sefial de entrada 3023 para estacionar en via 4, asi como las maniobras que van a\nrealizar con las unidades en via 5.\n18",
      "source_file": "ES-10306- 202270 0815 IF Manresa (english version).pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 19,
      "text": "Informe Final 70/2022\nA las 17:37:19 invierte el desvio n219 y queda el itinerario dispuesto para estacionar dicho tren en via\n4.\nMAMANRESA®:\ncrea\n> 2 CA |\n/ \\ /\n. oO 一一一一一一\n‘>\nSV\n>\nImagen 10 Tren 78439 ante la sefal de entrada 3023 con el itinerano formado a via 4. La via 4 estaba ocupada por una UT de la\nserie 447.\nEntre las 17:40 y las 17:50 aproximadamente, se ejecuta la maniobra de avance de la unidad\nestacionada en via 4 hacia el lado Calaf para dejar hueco a la composicion doble que esta esperando\nen la sefal de entrada 3023 haciendo el servicio de tren 78439. Sobre las 17:50, el RCM da\nautorizacion de rebase de la sefial de entrada al maquinista del tren 78439 y este se estaciona en via\n4alas 17:51:43.\nt J\ncirca\n.一 a eee — 一 > — ee Lee -一 ery\n‘>\nSVi_|\n(区\nImagen 11 Material de tren 78439 se estaciona en via 4 tras haber maniobrado la UT que se encontraba previamente ocupando\ndicha via hacia el lado Calaf.\n19",
      "source_file": "ES-10306- 202270 0815 IF Manresa (english version).pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 20,
      "text": "Comision de Investigacion de Accidentes Ferroviarios\nA las 17:53:58 el RCM normaliza el escape 21/23. Seguidamente el RC del CTC Ilama al RCM y éste le\nvuelve a comentar que con el material del tren 78439 estacionado en via 4 haran el tren 77554 y que\ncon el material de via 5 tienen que esperar a las indicaciones del CG y a la finalizaci6n del descanso\ndel maquinista.\nInstantes después, el RCM Ilama al RC del CTC y le comunica que le van a tener que autorizar el rebase\nde la sefial de salida de via 4 hacia Sant Vicenc de Castellet (3020/4) ya que la sefial no se abre. El\ninspector-regulador llega para tratar de encontrar una soluci6n, pero se percatan de que el itinerario\nde la sefial de salida de via 4 no se puede establecer, ni abrir su sefial (la razon se explica en apartados\nsiguientes). Entre las 17:59:00 y las 18:02:19, durante la llamada, el RC del CTC toma el mando de la\nestaciOn para tratar de mandar salida de via 4, pero finalmente lo devuelve al no poder solucionar\ndicho problema. Definitivamente, el RCM tiene que autorizar el rebase de la sefal de salida\nmencionada.\nA las 18:04 el RC del CTC transmite telefonema n2195 al RCM para que autorice el rebase de la sefial\nde salida 3020/4 a tren 77554. A las 18:07 el RCM autoriza mediante telefonema al maquinista de\ntren 77554 a rebasar la mencionada sefal de salida con marcha a la vista y a las 18:08:40 sale el tren\n77554 de la via 4.\n[ 4\nMANIANRESA\nCrch\n-人 ee\n44> a \\ ML <>\noe \\\n/\n. So -一一一\n'>\nSSVI | LS |\n>\nImagen 12 Tren 77554 rebasando autorizadamente la senal 3020/4 hacia via 2 general.\nMientras tanto, el Técnico del PM, al tener conocimiento de la situacion, llama al CG de Rodalies para\npreguntar por el maquinista que ha dejado el CV A3 de la estacion de Manresa ocupado, el Técnico\ndel CG le responde que en ningun momento le habian indicado al RCM la realizacion de la maniobra,\n20",
      "source_file": "ES-10306- 202270 0815 IF Manresa (english version).pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 21,
      "text": "Informe Final 70/2022\nsino que Unicamente le habian preguntado por la opcion de llevarla a cabo. El Técnico del PM le\ncomunica al Técnico del CG de Rodalies que el maquinista habia dejado la unidad fuera de piquete.\nA las 18:09 el RCM llama al CG de Rodalies y el Técnico del CG de Rodalies le reprocha que haya\npermitido que el maquinista hiciera el descanso cuando habia dejado la estacion con algunas vias\nbloqueadas. Seguidamente el RCM se pone en contacto con el maquinista para transmitirle que la\nestacion esta bloqueada por culpa del material que ha estacionado en via 5 y que se tiene que jevar\nel material con celeridad, el maquinista le contesta que en cinco minutos habra finalizado el refrigerio.\nUn minuto mas tarde, el RC del CTC llama al RCM y este ultimo le comenta que el CG de Rodalies /e\nha echado la bronca porque no deberia haber permitido al maquinista a hacer el refrigerio teniendo\nbloqueada la via.\nA las 18:17:46 el RCM normaliza el desvio n219 para, de esta manera, formar el itinerario de salida\nde via 5 de la estacion a la via par del trayecto. Instantes después, sobre las 18:19, el inspector-\nregulador del PM se pone en contacto con el RCM para clarificar si él le habia dado autorizacion al\nmaquinista para hacer el refrigerio. El RCM le contesta que le dejo ausentarse y que luego se dio\ncuenta de la ocupacidn del circuito de via CV A3. Después de esta llamada, el inspector-regulador\nhabla con el Supervisor de linea para comunicarle la situacién del tren de via 5 en Manresa y le\ncomunica que van a abrir una ficha de incidencia por la pérdida de minutos de dos trenes (el 78439,\n42 minutos y el 77554, 11 minutos).\nA las 18:24 el RCM se pone en contacto con el CG de Rodalies, le comunica que e/ material vacio va a\nsalir ya y le pregunta por la maniobra que van a hacer con la UT que queda en topera de via 5, el CG\nresponde que quieren hacer el tren 77558 con la UT que esta en via 4, en cabeza, y la UT no averiada\nde via 5, en cola, asumiendo que ambos materiales estan ya acoplados (el CG no conocia la situacion\nde los trenes dentro de la estacidn), pero el RCM les comunica que no lo estan ya que el material\nvacio (tren 95218) todavia no ha salido de via 5, la llamada concluye con el CG exigiendo al RCM que\nno saque el material vacio. Instantes después, el Técnico del CG llama al RCM para pedir explicaciones\nde la situacién en Manresa, le dice que deberian estar acopladas las dos unidades para el tren 77558\ny que no lo estan, el RCM le comenta que esto ha sido imposible ya que el material vacio no habia\nsalido todavia de via 5, cuando el Técnico del CG se da cuenta de la situacion, le dice al RCM que no\nsaque todavia nada.\nSeguidamente el RC del CTC llama al RCM para comunicarle que para expedir al material vacio de via\n5 le tendra que autorizar mediante un telefonema como el que le ha dado unos minutos antes para\nexpedir al tren de via 4, el RCM le comenta que el CG de Rodalies le ha dicho que todavia no lo sacara.\n\n21",
      "source_file": "ES-10306- 202270 0815 IF Manresa (english version).pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 22,
      "text": "Comision de Investigacion de Accidentes Ferroviarios\nTras ello, el RC del CTC les comunica la situaciédn a los inspectores-reguladores y éstos llaman\ninmediatamente al CG de Rodalies para requerir explicaciones al Técnico del CG, pero les contestan\nque éste no esta disponible y que les llamara a la mayor brevedad.\nA las 18:28 el maquinista del tren 95218 llama al RCM para iniciar la marcha y el RCM le contesta que\nde momento no tienen orden de expedir el tren. A las 18:29 el Técnico del CG de Rodalies llama al\nRCM y le indica que saque el material vacio de via 5 y también le dice que forme el tren 77558 con el\nmaterial que llega haciendo el tren 78443 y que después tratarian de acoplar las dos unidades que\nles quedan separadas (en via 5 y en via 4). Tras ello, el Técnico del CG llama al inspector-regulador y\nle traslada la misma informacion afadiéndole que con las unidades que quedarian en via 5 y via 4\nformaran el tren de las 19:30 (77562).\nA las 18:30 el RCM llama al RC del CTC para comunicarle que les han dado permiso para sacar el\nmaterial de via 5, tras comentarle como van a proceder con los trenes siguientes, el RC del CTC pasa\na explicarle como van a expedir la composicion de la via 5 y los telefonemas que son necesarios para\nello. Una llamada del CG de Rodalies interrumpe la conversacién y el RCM comunica al RC del CTC\nque puede haber cambio de opinion, inmediatamente el inspector-regulador dice que no va a haber\nmds cambio de opinion y que el material vacio se tiene que ir ya. Tras ello el RC del CTC le transmite\nun telefonema al RCM con n2 196 para que autorice el rebase de la sefial de salida de Manresa a tren\n95218 (material vacio de via 5). Tras esta llamada, el inspector-regulador reprocha al RC del CTC que\nle haya autorizado el rebase de la sefial ya que, en su lugar, le deberia haber autorizado la expedicion,\npues la sefal de salida ya se encontraba rebasada.\nA las 18:33 el RCM llama al maquinista de tren 95218 para preguntarle si esta listo para iniciar la\nmarcha, respondiendo éste que si y seguidamente le transmite el telefonema de autorizacién de\nrebase de la sefial de salida nUmero 3020/5 con marcha a la vista hasta la sefial siguiente finalizando\nla llamada a las 18:34:28.\nSobre las 18:34:23 el tren 78443 esta llegando a la estacidn de Manresa, concretamente se encuentra\nen el circuito de via previo a la sefal de entrada 3023. Sobre las 18:34:32 el RCM comunica al RC del\nCTC que el material de via 5 ya se va a ir y comentan que al maquinista del tren 78443 también hay\nque autorizarle la entrada para estacionarlo en via 4.\nA las 18:35:27 el Supervisor de linea llama al RCM en referencia a la ficha GIFO abierta por la\nocupacion prolongada del CVA3 afectando a las entradas y salidas del lado Sant Vicenc de Castellet.\nEste Supervisor de linea le comenta qué deberia haber hecho con la situacion del descanso del\n22",
      "source_file": "ES-10306- 202270 0815 IF Manresa (english version).pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 23,
      "text": "Informe Final 70/2022\nmaquinista. El RCM afirma que reconoce su culpa. Durante esta conversacion de 2 minutos y 41\nsegundos hay dos intentos de contacto por el Maquinista del tren 78443 situado delante de la sefal\nde entrada 3023 dando indicacion de parada.\nA las 18:37:10, el RCM invierte el escape 21/23 y el desvio n219 para formar itinerario de tren 78443\na via 4, mientras que el tren 95218 todavia no ha iniciado su marcha desde via 5. Instantes después,\na las 18:38:09 el RCM y el maquinista del tren 78443 establecen contacto y el RCM le autoriza\nmediante telefonema a rebasar la sefal de entrada 3023 de Manresa con marcha de maniobras hasta\npunto de estacionamiento, sin haber comprobado la salida del tren 95218. A las 18:38:52 el tren\n78443 rebasa dicha sefial.\nVAM ANRESAs\ncrcl\na So a\nTO ae a NO ne oy -\n. 7 »\nrs\nImagen 13 Tren 78443 se dispone a rebasar autorizadamente la sefial 3023 con el itinerario dispuesto hacia via 4. Tren 95218\ntodavia no habia iniciado la marcha.\nA las 18:39:03, el maquinista de tren 95218, cuatro minutos después de recibir el telefonema, inicia\npor fin la marcha y a las 18:39:11, se ocupan todos los CV de agujas, a la vez que el tren 78443 esta\nentrando a via 4 con su itinerario formado, y alcanza la velocidad maxima de 17 km/h a las 18:39:43,\ndespués comienza a frenar y hace uso del freno de emergencia a las 18:39:53, circulando a una\nvelocidad de 6km/h al apreciar la proximidad del tren 78443. Dos segundos después el tren queda\ndetenido a las 18:39:55. El primer bogie del tren 95218 llega a talonar el desvio n219, aunque no\ndescarrila y continua por la via.\n23",
      "source_file": "ES-10306- 202270 0815 IF Manresa (english version).pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 24,
      "text": "Comision de Investigacion de Accidentes Ferroviarios\nSimultaneamente, el tren 78443 tras el rebase de la sefal alcanza la velocidad maxima de 22 km/h a\nlas 18:39:21, seguidamente comienza a frenar a las 18:39:45 al apreciar la presencia por su via del\ntren 95218 y 7 segundos después, a las 18:39:52, queda detenido. Los dos trenes quedaron\nenfrentados a una distancia de 40 metros aproximadamente.\n- a Po ee yO\nook Tren 78443\nTren 95218\nImagen 14 Los trenes involucrados quedaron detenidos a una distancia de aproximadamente 40 metros entre sus cabezas.\nB) PLAN DE EMERGENCIA INTERNO-EXTERNO\nUna vez constatado el incidente operacional con la situaciédn de riesgo de colision entre los trenes\n95218 y 78443, se activa la Ficha 7 sobre actuaciones en descarrilamientos y colisiones del Manual\nde Prevencion y Gestion de Incidencias de ADIF. Se cursa aviso a Renfe Viajeros y a los organos de\nADIF afectados (Seguridad en la Circulaci6n, Mantenimiento de Infraestructura, Servicio Itinerante de\nCirculacién) asi como a las Fuerzas y Cuerpos de Seguridad del Estado. Se evacua a los viajeros del\ntren 78443 con ayuda de las Fuerzas y Cuerpos de Seguridad del Estado y de los Bomberos, dada la\nsituacion del tren fuera de andenes. Se establece un Plan Alternativo de Transporte de modo que\nRenfe Viajeros realiza el servicio de viajeros por carretera entre Sant Vicenc de Castellet y Calaf.\nA las 19:25 h se releva al agente responsable de circulacion de Manresa. A las 19:43 se informa de\nque bomberos y servicios de emergencia se encuentran en la zona y a las 19:45 finaliza el desalojo de\nlos viajeros del tren 78443.\nUn agente de Instalaciones de seguridad procede a establecer los itinerarios haciendo uso de la\nmanivela para retirar a los trenes. A las 23:20 se inicia movimiento de maniobra para el apartado de\n24",
      "source_file": "ES-10306- 202270 0815 IF Manresa (english version).pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 25,
      "text": "Informe Final 70/2022\nlos autopropulsados 447.049 y 447.117 hacia la sefial 3023. A las 23:50 se inicia movimiento de\nmaniobra para el apartado de los autopropulsados 447.059 y 447.047 hacia la sefial R1. A las 0:20 los\nautopropulsados 447.049 y 447.117 se apartan en via 2 y a la 1:10 los autopropulsados 447.059 y\n447.047 se apartan en via 4. A las 1:13 los agentes de enclavamientos inician los trabajos de\nreparacion en el desvio n°19, finalizando a las 3:56.\n4 ANALISIS DEL SUCESO\nDe la descripcién de los hechos se pueden extraer las siguientes constataciones:\n\n1. EIlRCM establecio itinerario para tren 78443 desde la sefial de entrada 3023 a via 4 y autorizé\nal mismo el rebase de la sefial de entrada cuando minutos antes habia autorizado a iniciar la\nmarcha al tren 95218 con un itinerario incompatible con el primero y, ademas, sin que éste\nhubiese emprendido la marcha. El maquinista de tren 95218 inicié la marcha, talon6 el desvio\nn219, pero no descarrilo y continuo por su via. Este incidente operacional dio como resultado\nuna situacion de riesgo de colisidn entre los trenes 78443 y 95218.\n\nMANRESA - L220_LLEIDA PIRINEUS - L‘HOSPITALET DE LL. -Km 301.719\n< an cv6 Ci cy am\npel evar VIA 6 \" ay\n18 * S020 cv B Bis\n+ - R2\nGre R1 gf qr-x— CVD S1/IV ~\n— Fr CV AIS TAT i VIA Il CVA or}\nts = —_ 2 ee ee 2/70\n, 3020/11 “—x<B\nSe, , S| | vm ae IS1/1 | si\n一一二一一\nT\\ sozay VIA Il\n\\ ar\nVIAV\nImagen 15 Itinerarios incompatibles de los trenes 95218 (amarillo) y 78443 (azul)\n\n2. Desde que el RCM dicta el telefonema al maquinista de tren 95218 hasta que este reanuda\nla marcha transcurren cuatro minutos y medio aproximadamente. El maquinista no saliéd\ninmediatamente tras recibir el telefonema, ni el RCM se percato, ni por observacidn directa\nni a través de las comprobaciones del cuadro de mando, de que el tren no habia emprendido\nla marcha. El RCM autorizo al maquinista del tren 78443 el rebase de la sefal de entrada 3023\n\n25",
      "source_file": "ES-10306- 202270 0815 IF Manresa (english version).pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 26,
      "text": "Comision de Investigacion de Accidentes Ferroviarios\nsin haber comprobado que el movimiento incompatible que habia autorizado (tren 95218 de\nvia 5 de la estacion hacia via 2 del trayecto) todavia no se habia ejecutado.\n\n3. Entre las 18:34 que el RCM dio la autorizacién de rebase de la sefial de salida 3020/5 a tren\n95218 (esta sefial ya se encontraba rebasada) y las 18:39 que le autoriza el rebase de la sefial\nde entrada 3023 a tren 78443, el RCM mantuvo llamadas telefonicas con el RC del CTC y el\nSupervisor de linea mientras tenia que realizar la supervision del movimiento de tren 95218.\n\n4. Para la expedicién del tren 95218 era necesaria la transmision del telefonema\ncorrespondiente, ya que se expedia sin orden de la sefial de salida debido a que la cabeza de\nla composicién estaba mas alla de la sefial de salida 3020/5 (la via 5 no tenia capacidad para\nalbergar tres unidades 447). Se maniobr6 en una via que no tenia capacidad suficiente.\n\n5. El telefonema que se emitio para que el tren 78443 rebasara la sefial de entrada 3023 y se\nestacionase en via 4 era necesario debido a las condiciones de funcionamiento del\nenclavamiento de la estacion dadas las circunstancias de explotacion en ese momento: via 4\nocupada y CV A3 ocupado.\n\n6. La emision de la orden de expedicién del tren 95218 se retraso en primer lugar por la\nrealizacion del descanso reglamentario del maquinista y después por indicaciones del CG de\nRodalies.\n\n4.1 COMETIDOS Y DEBERES RELACIONADOS CON EL SUCESO\nEmision de los telefonemas de rebase de sefial a los trenes 95218 y 78443\nDesde que el RCM dicta el telefonema de autorizacion de rebase, como orden de marcha, al\nmaquinista de tren 95218 hasta que éste emprende la misma transcurren cuatro minutos y medio\naproximadamente, por tanto, el maquinista no salid inmediatamente tras recibir el telefonema. El\narticulo 1.5.1.9. del RCF, en su punto 1, determina que /ja orden de marcha de un tren quedard\ninvalidada en el caso de que un tren parado no pueda salir inmediatamente después de haber recibido\nla orden de marcha. De este modo, al haber transcurrido cerca de cuatro minutos y medio tras la\nemision del telefonema, la orden de marcha estaba invalidada y, por lo tanto, el tren 95218 no\ndeberia haber emprendido la marcha.\n\n26",
      "source_file": "ES-10306- 202270 0815 IF Manresa (english version).pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 27,
      "text": "Informe Final 70/2022\n<于\nsw\n= AD\n| adit . -\n3 fsx LADO .aaacaeosa us de..acosn.de20z\n»\nid TEN , “a | CORRESPONSAL\n和 4 os oe ow & Que TEXTO DE OTROS TELEFONEMAS O NOTAS\n多\n到 一1 onset ET eawecie Loe de. tobcyol al CVAR de adacek |\n> VERN C TIES. BS fa oD 时 LE BN gn hee 人 eld be\nSe en Ee ee sh\nar tesa ae ll $090) 8 coe, HV Ui be ped pds Coda |\n. 上\n一 al ll\njp an se\n天\n”一一一一 “Hes ee eat l0LU eee .\nImagen 16 Telefonemas dictados por el RCM en el libro de bloqueo de /a estacién. La imagen ha sido tratada para su mejor\nvisualizacion.\nEl maquinista del tren 95218 recibid el telefonema por parte del RCM ya que le habia comunicado\nque se encontraba dispuesto para circular, no obstante, el tren no se encontraba dispuesto para\ncircular ya que el maquinista no habia realizado todas las operaciones necesarias para ello. Dichas\noperaciones, relacionadas con la TFA del material remolcado, las realiz6 tras recibir el telefonema,\nsiendo esta la razon de la demora en la salida.\nAdemas, la expedicién del tren 95218 mediante telefonema de autorizacién de rebase de sefial\n3020/5 no era la forma mas adecuada debido a que ésta ya se encontraba rebasada. Se deberia haber\nexpedido al tren mediante un telefonema de marche el tren, tal y como se indica en el articulo 4.2.1.3.\ndel RCF sobre expedicion de trenes desde vias sin sefal de salida. De acuerdo con este articulo, para\nrealizar la expedicion del tren estando la estacidn en BAD con CTC en ML, se deberia haber\ncomprobado por observacion directa la apertura de una sefial de salida del mismo lado. Sin embargo,\ndadas las condiciones de explotacidn de la estacion con el CV A3 ocupado y el itinerario de la sefial\nR1 a via 5 sin disolver, la apertura de una sefial de salida del mismo lado no era posible. Si se hubiera\ndisuelto dicho itinerario, se habria podido abrir la sefial de salida de via 4.\nPor otro lado, el RCM no se percato de que el tren no habia emprendido la marcha ya que no\ncomprobo si habia efectuado aun su salida, ni por medio de observacion directa, ni a través de\ncomunicacion con el maquinista o el CTC, ni con el cuadro de mando del gabinete de circulacién de\nManresa. Por tanto, el RCM autoriz6 al maquinista del tren 78443 el rebase de la sefal de entrada\n3023 sin haber comprobado que el movimiento incompatible que habia autorizado (tren 95218 de\n2/7",
      "source_file": "ES-10306- 202270 0815 IF Manresa (english version).pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 28,
      "text": "Comision de Investigacion de Accidentes Ferroviarios\nvia 5 de la estacion hacia via 2 del trayecto) todavia no se habia ejecutado. De acuerdo con el articulo\n5.2.1.2. del RCF, entre las medidas necesarias para garantizar la seguridad que se deben tener en\ncuenta al autorizar un rebase de una sefial que ordena parada, se comprobara que no haya autorizado\nningun movimiento incompatible. Por tanto, se deberia haber comprobado que el tren 95218 habia\nsalido a trayecto antes de haber establecido itinerario de entrada para el tren 78443 y haberle\nautorizado el rebase de la sefial de entrada 3023.\nDe acuerdo con el articulo 2.1.7.2. del RCF, todos los trenes dispondrdn de sefializacion de cola. La\nsefializacion de la unidad averiada en via 5 que se remolco no podia estar formada por las sefales\npropias del vehiculo debido a la desconexidn de su bateria, por lo que, de acuerdo con ese mismo\narticulo, la sefalizacién de cola se deberia haber formado por dos sefales portdtiles colocadas en los\nsoportes laterales de la parte posterior del ultimo vehiculo o, en su defecto, situadas en el interior de\nla cabina siendo visibles desde el exterior. La CIAF no ha podido constatar que se colocaran ni que se\nadoptaran las medidas previstas en el Art. 3.6.4.2. Punto 2 del RCF.\nTiempo transcurrido para la expedicion del tren 95218\nEl material rodante y el maquinista con los que se queria hacer la maniobra de remolcado de material\naveriado en via 5 llegaron a la estacion de Manresa a las 16:41 y el maquinista comenzo a hacer la\nmaniobra a las 17:15 finalizandola a las 17:28. La expedicion del tren 95218 se podria haber realizado\na partir de entonces, sin embargo, no se realizo en primer lugar porque el maquinista hizo un\ndescanso y posteriormente por indicaciones del Centro de Gestion de Rodalies.\nEl suceso acontecié en un dia festivo con una circulacién de trenes de Rodalies cada 50 minutos\naproximadamente. Llegaba un tren del lado Barcelona, permanecia estacionado en via 4 y rotaba\nhacia el mismo lado a los 50 minutos, ademas solo habia dos movimientos de paso de trenes\nregionales por via 2 (hacia Lleida Pirineus, a las 15:45, y hacia Barcelona Francia, a las 17:06). Por\ntanto, el numero de circulaciones no suponia un impedimento para poder haber expedido el tren lo\nantes posible y con la minima afeccidn a las circulaciones con origen y destino en Manresa.\nMANRESA aa a a hee — ra MA\nCALAF an\n16 x 17 , 了 18 x\nImagen 17 Malla de circulaci6n tedrica entre Sant Viceng de Castellet y Calaf entre las 16:00 y las 18:40. En marron, los trenes\nregionales y en rojo los servicios de Rodalies.\n28",
      "source_file": "ES-10306- 202270 0815 IF Manresa (english version).pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 29,
      "text": "Informe Final 70/2022\nEntre las 17:30 y las 18:24 el maquinista, que habia estado anteriormente de servicio en la estacion\nde L’Hospitalet de Llobregat para la realizacidn de maniobras, realiz6 un descanso que él consider6é\nreglamentario y obligatorio, a pesar de que ese dia no habia conducido hasta que hizo la propia\nmaniobra de via 4 a via 5. Este descanso supuso una perturbacion tanto en la hora a la que se expidié\nel material vacio, asi como en las condiciones de explotacion del enclavamiento de la estacion.\nA pesar de que el CG de Rodalies dispone de la informacion sobre las jornadas de los maquinistas en\nsus aplicaciones informaticas, el CG de Rodalies no conoce las horas de conduccion efectivas de los\nmaquinistas que estan haciendo servicios de maniobras en una estacion, por lo que es el propio\nmaquinista el que debe conocer cuando le corresponde la realizacion de los descansos\nreglamentarios. No obstante, es conveniente que los centros de gestion conozcan las circunstancias\ndel personal que trasladan de una estacion a otra para la realizacidn de servicios no programados.\nSobre las 18:24 el personal del CG de Rodalies exigio directamente al RCM que no expidiera al tren\n95218 debido a que la operativa en Manresa no se habia resuelto tal y como habian indicado, ya que\nel material de via 4 no se habia acoplado con la cola de via 5, y que por lo tanto debia de esperar. El\nRCM acepto esta indicacion del CG de Rodalies y se la comunic6 al RC del CTC, que también la acepto.\nComo ya se ha comentado previamente, la maniobra que se solicit6 por parte del CG de Rodalies y\nque se acepto por parte del RCM era factible. De acuerdo con el articulo 3.5.2.1. del RCF, la direccién\nde maniobras le corresponde al responsable de circulacion a cargo de la estacion por lo que es éste\nquién deberia autorizar el inicio y suspensién de estas y dar instrucciones al personal que deba\nrealizarlas sobre su finalidad, y el momento y lugar en que deben realizarse, asi como asegurarse de\nsu cumplimiento. No obstante, el proceso de planificacion de la maniobra, principalmente en la\ndeterminacion del modo de resolverla y del momento en el que ejecutarla, vino indicado por el CG\nde Rodalies y fue aceptado por el RCM.\nAmbos responsables de circulacién, RCM y RC del CTC, no deberian haber atendido a lo indicado por\nel CG de Rodalies de no expedir al tren 95218 ya que estaba afectando al normal funcionamiento de\nla estacion y estaba produciendo una situacion degradada con una afectacion indirecta a la seguridad.\nCondiciones de marcha impuestas a los maquinistas de los trenes 95218 y 78443\nLas condiciones de marcha especificas impuestas a los dos maquinistas en los respectivos\ntelefonemas de rebase de sefiales (marcha a la vista al maquinista del tren 95218 y marcha de\nmaniobras al del 78443) por parte del RCM y el cumplimiento de estas por ambos maquinistas han\nactuado como barrera que ha evitado la colision de ambos trenes.\n\n29",
      "source_file": "ES-10306- 202270 0815 IF Manresa (english version).pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 30,
      "text": "Comision de Investigacion de Accidentes Ferroviarios\n= nm 四 an an Ps * ; -全 < _ ; a . 和 a 1\n六 in ge gel Tren 78443 — il\n. 5 gy Zz he ale , \"kee ge . por , -一一 一 一\npS ‘nl or. a : rote é :\nawe OY fey’ oe 、 a ea\n一 “> = NS a RS 上 . ,\n~~ AS Tren 95218 SSS -\n; Ste, 。 外 ‘. RS a & Ny mS > = ——\nImagen 18 Zona de la estacion en la que se produjo el riesgo de colision. Se aprecia que es una zona en curva cerrada y a media\nladera con la zona del desmonte en el lado interior de la curva.\n4.2 MATERIAL RODANTE E INSTALACIONES TECNICAS.\nMaterial rodante: averia de la UT 447.047\nEl dia 15 de agosto por la mafiana un maquinista iba a trasladar la UT 447.047, que estaba estacionada\nen via 5; sin embargo, se encontr6é con que al liberar saltaba el magnetotérmico 1Q18A (Auxiliar\nMando de freno) constantemente y, por tanto, el tren no podia traccionar. Tras varias revisiones por\npersonal de la empresa de mantenimiento Irvia, se analiz6 el circuito eléctrico y se detecto una\nderivacion en el cableado del lazo de urgencia del ERTMS que provocaba el salto del mencionado\nmagnetotérmico. Por lo tanto, se consideré que su remolcado era la Unica opcion factible para\ntrasladarlo a los talleres de Montcada. Para ello se realizo la maniobra con una unidad para trasladarla\nde via 4 a la cabeza de via 5, para asi remolcar el material averiado.",
      "source_file": "ES-10306- 202270 0815 IF Manresa (english version).pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 31,
      "text": "Informe Final 70/2022\nDespués de que el maquinista realizara la maniobra de via 4 a via 5, se acoplo mecanicamente, por\nambos coches motores impares, y se ejecutaron las operaciones necesarias para su remolque.\nInfraestructura e instalaciones: caracteristicas del enclavamiento eléctrico de Manresa para el\nanalisis del incidente\nLa operativa que se planted en la estacién de Manresa llevo a una situacion de explotacién de la\nestacion en la que la via 4 estaba ocupada por una unidad de la serie 447 y el circuito de via de agujas\nCV A3 ocupado por otra unidad 447 que servia como unidad tractora para remolcar el material\naveriado de via 5.\nDe acuerdo con el cuadro de movimientos de la Consigna Serie A n21398 de la Estaci6n de Manresa,\nel enclavamiento eléctrico no permite la apertura de la sefial 3023 de entrada lado Barcelona con\nrebase autorizado a via 4 si el circuito de via CV 4 esta ocupado. Esta circunstancia hizo necesaria la\nemision del telefonema de rebase de sefial para el tren 78443.\neecnoia] ef fe po soaks eo leah PP oe oem\n\nfiofpaso omecto oc earcaona a zarasoza [ilu t| |L { | | reeeoe af leeeeelgoc\n11 ENTRADA LADO BARCELONA A via I pp ty [| ul eeie el8l\nfe] : ee TiTiT[ MTT I ie. Jeldéfefef 7 Jel | | | lelefeleselol3\n\n\" -一一一 ee JER bE GABE I | 8. . 18{@\n\n。 \" 。 。 。Yv 让 | LIL Ie | | | [6] | 日| 6 名|@O\n\nImagen 19 Cuadro de movimientos de la eslacion de Manresa. El movimiento de entrada del lado Barcelona a via 4 exige el CV 4\nlibre.\nPor otro lado, de acuerdo con la mencionada consigna, la liberacion normal de itinerarios se realiza\npor tramos segun se van ocupando y liberando sucesivamente por el tren los circuitos de via de la\nruta establecida, efectuandose en el caso de los itinerarios de entrada, cuando el tren libera el circuito\nde agujas de entrada. De este modo, el itinerario de maniobras de la sefal R1 a via 5, realizado para\nmaniobrar la UT tractora a esta via, al no desocuparse el CV A3, no se libero de forma normal, por lo\ntanto, si se tratase de formar algun itinerario incompatible con el mismo, este no se ejecutaria. Por\nlo tanto, si la via 4 no hubiera estado ocupada, la sefial de entrada 3023 no se habria podido abrir\npara itinerario a via 4 ya que el CV A3 estaba ocupado, ni la sefial de salida 3020/4 se habria podido\nabrir para itinerario de via 4 a via 2 del lado Barcelona. No obstante, si se hubiese liberado de forma\nartificial el itinerario de R1 a via 5, mediante la actuacion sobre el pulsador de Sefiales en Alto del\nCuadro de Mando o la aplicacion de una disolucion artificial de itinerario desde el CTC, si que se\nhubiese podido abrir la sefial de salida 3020/4 hacia el lado Barcelona por via 2.\n31",
      "source_file": "ES-10306- 202270 0815 IF Manresa (english version).pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 32,
      "text": "Comision de Investigacion de Accidentes Ferroviarios\nTambién cabe mencionar que el enclavamiento no contempla el movimiento de entrada del lado\nBarcelona por la via general impar a via 2 de la estacion, de acuerdo con el cuadro de movimientos\nde su consigna. Ademas, segun lo especificado en el disefio original, la via 1 no dispone de sefial de\nsalida hacia el lado Barcelona y la via 2 hacia el lado Calaf.\nLa forma actual de explotacién de Manresa al ser cabecera de linea de Rodalies y la utilizacién de las\nvias pares para hacer las correspondientes rotaciones hace conveniente que se actualice su\nenclavamiento de tal forma que se agilice su operacién y se garantice la seguridad de los\nmovimientos, de modo que ninguno de éstos se tenga que establecer mediante autorizaciones de\nrebase de sefal por parte de los responsables de circulacion de la estacién, sino mediante apertura\nde sefiales. El enclavamiento eléctrico de Manresa presenta una serie de peculiaridades que hace\nque, dada la forma actual de explotacion de la estacion, los responsables de circulacion de la estacion\ntengan que intervenir en un numero elevado de ocasiones.\n4.3. FACTORES HUMANOS\nActuacion del RCM al no percatarse de que el tren 95218 no salio inmediatamente\nEl RCM no se percato de que el tren 95218 no habia emprendido la marcha de forma inmediata tras\nhaberle trasladado el telefonema correspondiente. De este modo, asumio errdneamente que el\nmaquinista habia emprendido la marcha y comenz6 a preparar el itinerario de entrada del tren 78443,\npor lo que minutos después autorizo a ese tren la entrada a la estacidn de Manresa.\nEntre las 18:34 que el RCM dio la autorizacion de rebase de la sefial de salida al maquinista de tren\n95218 y las 18:39, casi cinco minutos mas tarde, que se la dio al del tren 78443, el RCM mantuvo\nllamadas telefénicas con el RC del CTC y el Supervisor de linea que pudieron actuar como elemento\nque contribuyo a un desvio del foco atencional por parte del RCM de la supervisién del movimiento\nde tren 95218 hacia dichas llamadas.\nEl Supervisor de linea llamo al RCM para advertirle que no deberia haber tolerado que se llegase a\nformar tal situacion de explotacidn en la estacion de Manresa, al haber permitido al maquinista hacer\nel descanso reglamentario dejando un circuito de via ocupado, es decir, la llamada no tuvo como\nobjetivo dar indicaciones operativas al RCM sobre la explotacién de la estacidn, sino que puede\ninterpretarse como un apercibimiento por parte de un superior jerarquico. Este tipo de\ninterrupciones durante el desarrollo de las funciones del personal de circulaci6n no mejoran el\ndesempeno de estas y en muchas ocasiones puede suponer un elemento distractor con el riesgo que\nello implica.\n\n32",
      "source_file": "ES-10306- 202270 0815 IF Manresa (english version).pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 33,
      "text": "Informe Final 70/2022\nEl Supervisor de linea es el superior organico del personal de circulacion que se encuentra en\nestaciones y no imparte ordenes operativas a éstos para la coordinacion de la circulacion.\nPor otro lado, en el gabinete de circulaci6n de Manresa el RCM dispone del teléfono de comunicacion\ncon el CTC en un lado distinto en el que se ubica el cuadro de mando (CM), de modo que al atender\na llamadas los responsables de circulacién pueden apartar la vista de dicho cuadro.\ni _\nOrdenador\n, 本 con mallas y -\nMegafonia de | _ AGER Terminal de - -\nla estacién radiotelefonia i .\ntren-tierra >”\n= a\n-<\nTerminal de ' F ?\ntelefonia * —)\nautomatica 3 —\n“a a ey, eee\n| 和\n: a ‘\n| 四 . 二\n=e. Libros de paso de\n4H: 7 a trenes y\n/ 44, “ TM telefonemas\n一一\noa\nImagen 20 Situacién de los distintos elementos del gabinete de circulacién de la estacion de Manresa\nEl RCM solo dispone de la informacion aportada por el CM. Las indicaciones de ocupacion de circuitos\nde via en dicho CM consisten en unos visores circulares que se iluminan con una luz blanco-\namarillenta con la ocupacion de los circuitos de via. Las indicaciones de posicion de los aparatos de\nvia de la estacion consisten en unos visores rectangulares que se iluminan con la misma luz blanco-\namarillenta de los circuitos de via. Ademas, los responsables de circulacién suelen estar mas\nacostumbrados al uso de videograficos, donde es mas facil seguir el recorrido de un tren en una\nestacion. De este modo, para los responsables de circulacion que estan acostumbrados al uso de\nvideograficos, la visualizaci6n de la ocupacidn de los circuitos de via en estos cuadros de mando\npuede ser mas dificil.",
      "source_file": "ES-10306- 202270 0815 IF Manresa (english version).pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 34,
      "text": "Comision de Investigacion de Accidentes Ferroviarios\nEl RCM no dispone de informacion procedente de ningun sistema videografico similar al empleado\nen los CTC 0 al de los sistemas de ayuda al mantenimiento. Unicamente dispone de la informacién\ndel CM y de la aplicacion Gtrenes que informa sobre el horario de los trenes (llegada y salida) de la\nestacion.\nAdemas, Manresa es una estacion con dificultades de visualizacién directa de sefiales y movimientos\nde salida desde el gabinete por estar en curva hacia el lado Barcelona, por ello cabria proponer la\nintroduccién de elementos que mejoraran la visualizacién de la zona y vias de salida lado Barcelona.\nImagen 21 Detalle de las luces del CM: en amarillo se ilumina la ocupaci6n de los circuitos de via (circulos) y la posicién de los\naparatos de via (rectangulos).\nPor otro lado, el RCM supuso que al haber pasado tiempo suficiente desde que emitio el telefonema\nal tren 95218, éste ya habria abandonado la estacién. Esto puede ser indicativo de una falta de\nconocimiento por parte del RCM de que la salida del tren tiene que ser inmediata cuando se da un\ntelefonema, por lo que haria falta la comprobaciédn fehaciente de su salida y no basarse\nexclusivamente en la percepcién de si ha pasado tiempo suficiente o no o en otro tipo de\nsuposiciones, teniendo en cuenta que al realizar movimientos no protegidos por sefnales se carece de\nla proteccién los enclavamientos, y la seguridad descansa en la correcta aplicacion de los\nprocedimientos reglamentarios.\nActuacion del RCM al permitir la realizacién de la maniobra ocupando el CV A3\nEl telefonema que se emitid para expedir al tren 95218 era necesario ya que la cabeza de la\ncomposicién estaba mas alla de la sefial de salida 3020/5 debido a que la via 5 no tenia capacidad\npara albergar tres unidades 447. Se maniobro en una via que no tenia capacidad suficiente.\n34",
      "source_file": "ES-10306- 202270 0815 IF Manresa (english version).pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 35,
      "text": "Informe Final 70/2022\n\nEl RCM respondio positivamente a la peticion del CG de Rodalies de maniobrar una tercera unidad a\nla via 5 ya que considero que dicha via tenia capacidad suficiente para albergar tres unidades.\nConsider6 esto ultimo porque, a pesar de ser correctas las mediciones consultadas de distancias entre\ntoperas, sefial de salida 3020/5 y desvio n21, supuso que el circuito de via de agujas no se ocuparia\nen la medida en que la cabeza de la tercera unidad no ocupara fisicamente las agujas del desvio n21.\nSS. .. Cabeza de\nWA ASS ee tren sobre D1\n\nnN Me: ae SSS a5 Ss. sefial 3020/5 | , L |\nDNR. a ee ian\n\nUE 447.0595 Se NF ra三 三.二 下\n_ a3 _ > al a IT 一 i 一\nImagen 22 Vista aérea del lado Sant Vicenc de Castellet con las tres unidades 447 en via 5: rebasa 有 sefnial 3020/5 y la cabeza se\nqueda proxima al desvio n°1.\nEl RCM, al conocer que la UT adicional que se iba a maniobrar a via 5 iba a rebasar la sefial 3020/5,\ndeberia haber sabido que iba ocupar el circuito de agujas CV A3 y que esto iba a complicar el\ndesarrollo de la operativa y a comprometer la normal explotacion de la estacion. Por tanto, se puede\nconsiderar como un error de falta de conocimiento del funcionamiento de la estacién por parte del\nRCM.\nPor otro lado, el RCM tolero que el maquinista hiciera el descanso reglamentario dejando el CV A3\nocupado y complicando la operativa en la estacidn, cuando éste podria haber deshecho la maniobra\nsin ningun problema.\nEl RCM llevaba trabajando para ADIF, en la propia estacion de Manresa, desde mayo, habiendo\nrealizado practicas en la misma durante los meses de febrero y marzo. Su breve experiencia pudo\ninfluir negativamente en una toma de decisiones desacertada a la hora de permitir la maniobra y el\ndescanso del maquinista. Tuvo una actitud proactiva y dispuesta a la resolucion de la incidencia de\n35",
      "source_file": "ES-10306- 202270 0815 IF Manresa (english version).pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 36,
      "text": "Comision de Investigacion de Accidentes Ferroviarios\nremolcado que planted el CG de Rodalies, sin embargo, esta actitud combinada con una falta de\nexperiencia y de ciertos conocimientos es lo que le llevo a una toma de decisiones que condujeron a\nuna situacion degradada en la explotacion de la estacion, debiendo autorizar rebases de sefial para\nla entrada y salida de trenes en el lado Barcelona.\nActuacion del maquinista al emprender la marcha con la orden invalidada\nEl maquinista del tren 95218 emprendio la marcha a pesar de que deberia haber considerado que la\norden de marcha estaba invalidada. Se trata de un error consistente en la no consideracion del\narticulo 1.5.1.7. del Libro de Normas del Maquinista del Grupo Renfe, que da cumplimiento al articulo\n1.5.1.9. del RCF, por parte del maquinista, por lo que se trata de un error de regla.\nLa preparacion de las tareas necesarias para iniciar la marcha del tren cuando este ya estaba dado\ndispuesto, a pesar de que las deberia haber realizado previamente, pudo contribuir a este error ya\nque pudo hacer que se distrajera y no fuera plenamente consciente del transcurso del tiempo.\nAdemas, el maquinista considero erroneamente que el RCM era conocedor de que el tren tardaria\ncierto tiempo en salir, aunque no hubo ninguna comunicacion formal a este respecto.\n4.4 MECANISMOS DE RETROALIMENTACION Y CONTROL\nAutoridad de los agentes de circulacién\nDesde las jefaturas de circulacion del area noreste de ADIF, se aprecia una actitud generalizada en el\npersonal de circulacion consistente en una carencia de habilidades asertivas que les ayuden a hacer\nefectiva su competencia de direccion de la circulaci6n, de modo que frente a peticiones, solicitudes,\nsugerencias e injerencias de otros agentes ferroviarios, como pueden ser los maquinistas o el\npersonal de los centros de gestion, y que implican una alteracién de las condiciones de circulacion\nque ellos tienen que garantizar, responden sin ejercer su autoridad de manera firme y sin capacidad\nde mando. Por ello, es preciso que todo el personal de circulacidn conozca y entienda cuales son sus\nfunciones, competencias y responsabilidades y que todo el personal de circulacion tenga habilidades\ninterpersonales para hacerlas prevalecer frente a las injerencias de otros agentes ferroviarios.\nLa organizacién de tareas en las que su estructura y la jerarquia entre los distintos agentes estan\nclaramente definidas favorece el respeto a la autoridad y la capacidad de mando de aquellos agentes\nque tienen encomendadas labores de direccién. Por el contrario, la organizacién de tareas que\nimplican a unidades de produccion independientes (empresas distintas, departamentos o direcciones\ndistintas y muy alejadas entre si dentro del organigrama de una misma empresa) no es favorable a\nello, de modo que el correcto desempefio de éstas depende exclusivamente de la cooperacion\n36",
      "source_file": "ES-10306- 202270 0815 IF Manresa (english version).pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 37,
      "text": "Informe Final 70/2022\nvoluntaria entre las mismas. De este modo, las maniobras ferroviarias, al implicar a distintos agentes\nferroviarios pertenecientes a administradores de infraestructuras y empresas ferroviarias, son una\ntarea en las que el respeto a la autoridad para su direccién puede verse limitada.\n\nPor ello, es fundamental el refuerzo de la autoridad de todos los agentes de circulaci6n. La normativa\nvigente es lo suficientemente clara en el establecimiento de la autoridad de los responsables de\ncirculacion para la direcci6n de maniobras y, en definitiva, para todo lo relativo a la circulacién, por\nlo que hay que exigir su cumplimiento mediante la deteccion y correccion de actuaciones impropias\npor parte de los supervisores de los agentes de circulacion.\nAutorizaciones de rebase de sefal\nEl fallo humano en las autorizaciones de rebase de sefial por parte de los responsables de circulacion\na la hora de realizar las comprobaciones exigidas por el articulo 5.2.1.2. del RCF no es un fallo\nfrecuente en el puesto de mando de la estacion de Barcelona Francia, segun la jefatura de circulacion\nnoreste. Desde esta jefatura se insiste a los RC en que, en todo momento y principalmente cuando\nse esta Ilevando a cabo una labor de seguridad como es el aseguramiento de esta antes de autorizar\na un maquinista a rebasar una sefial que indica parada, sean conscientes del estado de la situacién\nen la estacién, es decir, de los trenes que hay en ese momento, en qué vias se ubican y los\nmovimientos que se encuentran ejecutando. Ademas, también se les debe exigir que tengan una\npercepcion del riesgo alta principalmente en situaciones degradadas.\nComunicaciones entre responsables de circulacién y maquinistas\nLa falta de entendimiento entre maquinistas y responsables de circulacidn, como la que se produjo\nen este caso por parte del maquinista del tren 95218 al suponer que el RCM conocia que iba a tardar\nun tiempo en emprender la marcha, se produce con cierta frecuencia. Ademas, se ha evidenciado\nque en muchas bastantes ocasiones los maquinistas asumen que los responsables de circulacion\nconocen exactamente la localizacidn y situacién real del tren, cuando ésto realmente no puede ser\nasi. Desde los mandos de supervision de las actividades de los maquinistas, se debe advertir a éstos\nde la importancia que, para el aseguramiento de la seguridad, tiene la correcta transmisi6n de\ninformacion entre ellos y los puestos de mando y la formalizacidn de esta.\nLa figura organizativa del mando intermedio en Renfe Viajeros es importante para la realizacion de\ntutelaje de maquinistas, especialmente en zonas en las que hay un alto porcentaje de maquinistas\ncon pocos afios de experiencia. En la actualidad, y segun las indagaciones realizadas, dentro de los\nservicios de Rodalies en Barcelona hay escasez de este personal y solo se puede dedicar casi en\n37",
      "source_file": "ES-10306- 202270 0815 IF Manresa (english version).pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 38,
      "text": "Comision de Investigacion de Accidentes Ferroviarios\nexclusiva a labores formativas, por lo que les resulta muy dificil llevar a cabo tareas de seguimiento\nde los maquinistas. Ademas, apenas hay mandos intermedios con mas de 5 afios de experiencia.\nDe este modo, Renfe Viajeros deberia disponer los medios y recursos necesarios para que estos\ntutores existan en cantidad conveniente, tengan la capacitacion y aptitud necesarias y ejerzan su\nactividad tanto formativa como de supervision y seguimiento.\n4.5 INCIDENCIAS ANTERIORES DE CARACTER SIMILAR\nInforme Final de la CIAF 12/2019 Accidente ferroviario ocurrido en el antiguo apeadero de\nCastellgali (Barcelona), el 8 de febrero de 2019.\nEl dia 8 de febrero de 2019 a las 18:19 en la linea 220 Lleida-Pirineus-L’ Hospitalet de Llobregat entre\nlas estaciones de Manresa y Sant Vicenc de Castellet tuvo lugar un accidente grave consistente en\nuna colision frontal cerca del antiguo apeadero de Castellgali. Los trenes involucrados fueron el tren\n15624, Media Distancia de Renfe Viajeros entre Lleida y Barcelona, y el tren 28043, Rodalies de Renfe\nViajeros desde Sant Vicenc de Calders hacia Manresa. El tren 15624 habia sido expedido hacia\nBarcelona desde la estacion de Manresa, que estaba en Mando Local, desde la via 1 mediante un\ntelefonema de marche el tren ya que dicha via no tenia sefial de salida, y debido a una incorrecta\ndisposicion del itinerario de salida, se le encamino por via impar en sentido contrario al del BAD. El\ntren 28043 circulaba correctamente por via impar en sentido Manresa al amparo del BAD desde la\nestacion de Sant Vicenc de Castellet, colateral a la de Manresa.\nLa carencia de sefial de salida en via 1 por el lado de Barcelona determin6o que existiera la necesidad\nde aplicar el articulo 4.2.1.3- punto 2 del RCF para la expedicion de trenes desde la via 1, segun el cual\nel RC debera hacer una serie de operaciones como la comprobacion por observacion directa de otras\nsefiales y la transmision de telefonemas. Por ello, la CIAF recomendo estudiar la posibilidad de\nmodificar las instalaciones de la estacion de Manresa para dotar de sefal de salida a todas las vias de\ncirculacion.\nInforme Final de la CIAF 9/2021 Incidente operacional ocurrido el dia 05/02/2021 en la estacién de\nBlanes (Girona)\nEl dia 5 de febrero de 2021 sobre las 8:00 de la mafiana en el lado Macanet/Massanes de la estacion\nde Blanes tuvo lugar un incidente operacional consistente en una orden de marcha indebida en el\nque estuvieron implicados dos trenes de Renfe Viajeros: el tren 25603, que habia sido autorizado a\nrebasar la sefial de salida en direccidn a Macanet/Massanes con el bloqueo establecido en sentido\ncontrario, y el tren 25614 que venia desde Macanet/Massanes que se encontraba detenido frente a\n38",
      "source_file": "ES-10306- 202270 0815 IF Manresa (english version).pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 39,
      "text": "Informe Final 70/2022\nla seal de entrada E2 de la estacion de Blanes. Este ultimo era un tren ordinario que circulaba\ninmediatamente después de otro tren que, al venir con retraso, tuvo que ser reacomodado en la\nmalla de circulaciones como tren especial con tres numeraciones: 30852 hasta Macanet/Massanes,\n95756 entre Macanet/Massanes y Blanes y 25612 desde Blanes. El suceso quedo en un incidente\noperacional sin mayores consecuencias porque el maquinista del tren 25603 se detuvo al ver al otro\ntren, sin llegar a rebasar la sefal de salida.\nContribuy6 a este incidente la existencia de una comunicacion directa por el personal del CG de Renfe\nViajeros a los dos RC involucrados en el incidente de las alteraciones de la malla ese dia, sin que\ninternamente en el PM se hubiera llevado a cabo una verificaci6n de que todos los RC afectados\nestaban informados y de que la informacion transmitida era coherente. Por ello, la CIAF recomendo\nestablecer un canal y procedimiento de interlocucion entre el PM y los CG de las EEFF, de forma que\nno se interfiriera en la coordinacién y supervisidn de la informacién que precisan los RC para\ndesarrollar sus funciones.\nDe acuerdo con el personal de ADIF, las llamadas de los CG a los RC del CTC han disminuido en buena\nmedida desde el incidente de Blanes. Sin embargo, se siguen produciendo comunicaciones directas\nde los CG a los RC de las estaciones en mando local. De este modo, se deberian concretar los canales\nde comunicaci6n de los centros de gestion de las empresas ferroviarias con las estaciones en mando\nlocal, asi como establecer las atribuciones del personal y la funcionalidad de los RC en estas estaciones\nen relacion con los responsables e inspectores-reguladores de la circulacion en las bandas del CTC en\nlas que se ubican.\n\n39",
      "source_file": "ES-10306- 202270 0815 IF Manresa (english version).pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 40,
      "text": "Comision de Investigacion de Accidentes Ferroviarios\n\n5 CONCLUSIONES\n\n5.1 RESUMEN DEL ANALISIS Y CONCLUSIONES\n\nAnalizada toda la documentacion y todos los datos se consideran los siguientes factores:\nCausales:\n\n1. Autorizacién de rebase de sefial de entrada 3023 al maquinista del tren 78443 sin haber\ncomprobado que el movimiento incompatible que se habia autorizado previamente, tren\n95218 de via 5 de la estacion hacia via 2 del trayecto, todavia no se habia ejecutado.\nIncumplimiento del articulo 5.2.1.2. del RCF\n\n2. Inicio de la marcha del tren 95218 cuando su orden de marcha estaba invalidada al no salir\nde forma inmediata tras recibir el telefonema. Incumplimiento del articulo 1.5.1.9. del RCF.\n\nContributivos:\n\n1. La falta de experiencia y de ciertos conocimientos del RCM, combinada con una actitud\nproactiva y dispuesta a la resolucion de la incidencia de remolcado que planted el CG de\nRodalies le llev6 a una toma de decisiones que originaron una situacion degradada en la\nexplotacion de la estaciédn, debiendo autorizar rebases de sefial para la entrada y salida de\ntrenes en el lado Barcelona\n\n2. ElCG de Rodalies indico taxativamente al RCM la no expedicion del tren 95218, cuando este\nya podria haber sido expedido, siendo aceptada por el RCM y el RC del CTC. Esto supuso una\ninjerencia del CG de Rodalies en la gestion de la circulacion de la estacion de Manresa\nmanteniendo en el tiempo la situacion degradada que estaba teniendo lugar.\n\n3. Laatencion por parte del RCM a llamadas telefénicas que no estaban relacionadas de forma\ndirecta con la circulacién supuso un elemento distractor a la hora de comprobar la salida del\ntren 95218.\n\n4. El maquinista de tren 95218 realizo un descanso que considero obligatorio, cuando no lo era,\ndando lugar a una perturbacion en la hora de salida del tren y en las condiciones de\nexplotacion de la estacion.\n\n5. Problemas en el modo y forma de comunicacidn entre el maquinista del tren 95218 y RCM\nque provoca que no se produzca una correcta transmision de la informacion entre ambos.\nVer Recomendaci6n 70/2022-4\n\n40",
      "source_file": "ES-10306- 202270 0815 IF Manresa (english version).pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 41,
      "text": "Informe Final 70/2022\nSistémicos:\n\n1. El enclavamiento eléctrico de Manresa presenta una serie de peculiaridades y limitaciones\nque hace que se produzcan un numero elevado de situaciones degradadas que obligan al RC\na intervenir directamente, sin la proteccion del enclavamiento. Ver medidas adoptadas.\n\n2. Existencia de dificultades en la estacion de Manresa para comprobar de forma fehaciente la\nexpedicion de trenes. Ver medidas adoptadas.\n\n3. Deficiencia en las habilidades asertivas del personal de circulacion que dificulta hacer efectiva\nsu competencia de direccion de la circulacién frente a las posibles injerencias por parte de\notros agentes ferroviarios. Ver Recomendaciones 70/2022-1 y 70/2022-2.\n\n4. Comunicaciones directas entre los responsables de circulacién de las estaciones en mando\nlocal y los Centros de Gestion de las empresas ferroviarias. Ver Recomendacién 70/2022-3.\n\n41",
      "source_file": "ES-10306- 202270 0815 IF Manresa (english version).pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 42,
      "text": "Comision de Investigacion de Accidentes Ferroviarios\ngy\ncS\n‘So 00\ng28 3\ns8aTM\noO oo 中\nBod E 2\n258 fxs\n34° vo cuge os\nTea Goscwy\nla] c= G8 co\nE .ES Barszgz\n2's @/—-————_-_/|/ % © she\nSm © eoge?es\neis 50% & SE\noY T7455\nsr zg SES\n5 ¢ Oo Cn\noe 8\n~- ££\nSama =\neu e fl\nwa 8 / 1\n1\n1\n人 f\nPN / 1\n| ‘ 1\n| \\ f 1\n| ‘ / \\\n| \\ 7/ !\n. 1\n| Sf 1\n| va |\n& og o =\n= EFSZeEs & = 2\nSoe e es .|| 8 2 e585 55\nSBS cep f 8a @ = 与 See ev 35 oS\nBSSeERE! SS SESE 8 ES\n= os a 三 多 Saf as 三 o\nsfecace 五 + Z&eeegs 三 57\ne* ses we) |? &s Et\na 一 cs Oo 8\nAON\n/ \\\n7 ‘,\né ‘\n到 \\\n1 AN\na AS\n四\n站 o_ | 2\na 8 eB 8 o 8\nos 十 eos 2 已\nao :a & 2 2 =o\nfea) |gi2) |\no\n£25 =” =\n3B CE\ni *)\nas 、\na A\n1\n的 所 eg\nqa\n[<4\n.23 Bs: 2\n3 § zz Ss\nA g£8>38\nae2| |f'85 3\nPg ie 5 ate\nS2Gt ERs eg 38\nSG Sseas\n£ A\nImagen 23 Arbol de causas de! suceso",
      "source_file": "ES-10306- 202270 0815 IF Manresa (english version).pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 43,
      "text": "Informe Final 70/2022\n5.2 MEDIDAS ADOPTADAS DESDE EL SUCESO\nPor parte del administrador de infraestructura, actualmente en las Subdirecciones de circulacion se\nesta trabajando en un proyecto de listas de chequeo para, entre otras operativas, facilitar el trabajo\nalos RC cuando tengan que autorizar el rebase de sefal a un tren o una maniobra de modo que quede\nun registro de la actividad. Para ello utilizarian una Tablet en la que marcarian las condiciones que se\ndeben cumplir para autorizar el rebase de una sefial. Ademas, desde RRHH de ADIF se esta planteando\nla incorporacion de personal de refuerzo para la intervencion en situaciones degradadas. Es necesario\nque esta medida sea operativa y convendria analizar su eficacia una vez que se implemente. Junto a\nella convendria también aumentar la formacion y entrenamiento de los RC.\nPor otro lado, la sustitucién del enclavamiento de Manresa por uno electrdnico se lleva afos\nsolicitando, sin embargo, actualmente este proyecto esta en fase de ejecucion y, segun ADIF, se prevé\nsu puesta en servicio para mayo de 2023. También se va a llevar a cabo la implantacién de un bloqueo\nautomatico banalizado (BAB) entre Manresa y Terrassa. El BLAU entre Manresa y Calaf se mantendra.\nEl proyecto contempla la introduccién de un Puesto Local de Operaciones (PLO). Este sera acorde con\nla normativa vigente para el disefio de videograficos y se ejecutara con la tecnologia mas reciente.\nEl programa de explotacion incluye todos aquellos movimientos que antes no se podian ejecutar\nmediante el enclavamiento y que exigian la intervencion directa del responsable de circulacion.\n5.3 OBSERVACIONES ADICIONALES\nAl margen de las conclusiones sefialadas anteriormente que tienen una relacion causal con lo\nsucedido, durante el proceso de investigacion se han constatado los siguientes hechos:\nCon respecto al remolque de la unidad 447 averiada, parece que ésta se remolco sin bateria. No\nobstante, se supone que el freno neumatico de la remolcada estaba en servicio, aunque parece que\nel antibloqueo no funcionaba, por lo tanto, deberia haberse comunicado alguna condicion de\ncirculacion especial para evitar planos en las ruedas.\nPor otro lado, la empresa ferroviaria deberia haber colocado dos sefiales portatiles en los soportes\nlaterales de la parte posterior del ultimo vehiculo del tren 95218 que hubieran servido como\nsefializacion de cola, tal y como se establece articulo 2.1.7.2. del RCF o notificar la falta de sefales de\ncola a fin de que se adoptaron las medidas previstas en el Art. 3.6.4.2. Punto 2, del RCF.\n\n43",
      "source_file": "ES-10306- 202270 0815 IF Manresa (english version).pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 44,
      "text": "Comision de Investigacion de Accidentes Ferroviarios\n6 RECOMENDACIONES DE SEGURIDAD\n. . Implementador ,, -\n\nDestinatarios final Numero Recomendacion\nFomento de las habilidades asertivas del personal de circulacién que\n\nAESF ADIF 70/2022-1 ayuden a hacer efectiva su competencia de direccién de la circulacion y\nque refuercen su autoridad frente a las posibles injerencias por parte de\notros agentes ferroviarios.\nReforzar la supervision de las actividades relacionadas con la circulacién\n\nAESF ADIF 70/2022-2 para garantizar suficiente formacién tedrico-practica de los RC tanto\nantes de asignarles las tareas, como durante el desarrollo de estas.\nEstablecer un canal y procedimiento de interlocucion entre los RC de las\n\nAESE ADIF | y Empresas 70/2022-3 estaciones en mando local y los CG de las empresas ferroviarias, de\n\nferroviarias forma que no se interfiera en la coordinacién y supervision de la\n\ninformacién que precisan estos RC para el desarrollo de sus funciones.\nInstruir al personal de conduccién en la importancia que tiene la correcta\n\nAESF Renfe Viajeros 70/2022-4 transmision de informacion entre ellos y los responsables de circulacion\ny la formalizaci6n de las comunicaciones para garantizar la seguridad.\n\nMadrid, a 16 de marzo de 2023\n44",
      "source_file": "ES-10306- 202270 0815 IF Manresa (english version).pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 45,
      "text": "Informe Final 70/2022\nAPPENDIX: ENGLISH SUMMARY OF THE MAIN PARTS OF THE REPORT\nCommission Implementing Regulation (EU) 2020/572 of 24 April 2020 on the reporting\nstructure to be followed by railway accident and incident investigation reports states\n(Article 3):\n“Points 1, 5 and 6 of the Annex | shall be written in a second official European language.\nThis translation should be available no later than 3 months after the delivery of the report”.\n(Annex | establishes the structure to follow on the reporting).\nThis appendix contains the translation into English of points 1, 5 and 6 of the final report,\naccording to that regulation.\nIn case of any doubt or contradiction, the corresponding original Spanish text shall prevail.\nThis report is a technical document that presents the approach of the Spanish National\nInvestigation Body (CIAF) to the circumstances of the investigated occurrence, setting out\nits probable causes and safety recommendations.\nAs stated by Royal Decree 623/2014 of 18 July 2014, in particular Article 4 paragraphs 4\nand 5 thereof:\n“4, Investigation shall aim to determine the causes of the accident or incident, and clarify\nits circumstances, so that rail transport safety increases and accidents are prevented.”\n“5. The investigation will not deal with allocation of blame nor liability for the accident or\nincident, and it will be independent of any judicial enquiry”.\nConsequently, using this report for any other purpose than prevention of future accidents\nor incidents could result in wrong conclusions or interpretations.\n45",
      "source_file": "ES-10306- 202270 0815 IF Manresa (english version).pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 46,
      "text": "Comision de Investigacion de Accidentes Ferroviarios\nSUMMARY\nAt 18:34 on 15 August 2022, the Local Signaller at Manresa station (LSM) authorised the 95128-train\ndriver to start moving from track 5 at Manresa station towards “Sant Vicenc de Castellet” direction\nand arranged this route. At 18:41, even though the 95218 train had not started to move, the LSM\nauthorised the 78443-train driver to overtake the entrance signal 3023 at Manresa station on the\n“Sant Vicenc de Castellet” direction, arranging a route that was not compatible with the movement\nthat had been previously authorised.\nThe 95218-train started to move several minutes later after the authorisation, it passed by the switch\n#19, which was set to the opposite position, however, it continued along track 1. The 78443-train was\ncirculating on the same track towards track 4. Both train drivers noticed the situation and stopped\nthe trains 40 metres apart from each other.\nMANRESA - L220_LLEIDA PIRINEUS - L‘HOSPITALET DE LL. -Km 301.719\n< aaa cv 6 Si cy aa\npa CV A7 VIA 6 四 Fe |\n18 * S020 cv B Bis\n+ - R2\nGre R1 gf ar x— CVD S1/IV ~\na B CV AIS TA ie VIA Il CV AI or}\ni CV A23 CV ag Nat cut i»; Cv Ald\nFe. 3020/11 “\\—x<0B\nan , i S | cv ae IST1 | sin\n一一二一一\n.302N VIA III\n\\ ar\nVIAV\nAs a result of this operational incident, only the switch #19 was damaged. There was no personal\ninjury or damages to the rolling stock.\nManresa station lies within is in the line 220 - Lleida-Pirineus- Vilanova Junction of the Spanish\nNational Railway Network. It is located at the municipality of Manresa, in the province of Barcelona\n(Catalonia).\n46",
      "source_file": "ES-10306- 202270 0815 IF Manresa (english version).pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 47,
      "text": "Informe Final 70/2022\nCONCLUSIONS\nAfter analysing all documentation and data, the following factors are considered:\nCauses:\n\n1. The LSM authorised the 78443-train to overtake the entrance signal 3023 but it was not\nchecked that the previously authorised movement - route from track 5 of the station to track\n2 for the 95218-train - had not been yet executed. Both movements were not compatible.\nNon-compliance with Article 5.2.1.2. of the Spanish Railway Circulation Regulation.\n\n2. The 95218-train started to move whilst its running order was not valid as it did not depart\nimmediately after receiving the authorisation. Non-compliance with Article 1.5.1.9. of the\nSpanish Railway Circulation Regulation.\n\nContributing factors:\n\n1. The Railway Undertaking Management Centre (RUMC) asked the LSM for the 447 rolling\nstock unit, that was damaged, to be towed. The lack of experience and appropriate\nknowledge combined with a proactive attitude and willingness to solve this incident led the\nLSM to make decisions that created a degraded situation during the operations at the station.\nSignal-overtakings for entering and exiting of trains on the “Sant Vicenc de Castellet”\ndirection were required.\n\n2. The RUMC strictly indicated to the LSM that the 95218-train should not be dispatched at that\nparticular moment, when it could have already been done, and this was accepted by the LSM\nand the CTC dispatcher. This was an interference from the RUMC in the management of\ntraffic at Manresa station, maintaining over time the degraded situation that was taking\nplace.\n\n3. The LSM answered work-telephone calls that were not directly related to traffic whilst\nchecking the dispatch of the 95218-train. This is considered as a distracting factor.\n\n4. The 95218- train driver took a break that he considered mandatory, when it was not, resulting\nin a disruption to the train's departure time and the station's operating conditions.\n\n5. There were problems in the communications between the 95218-train driver and the LSM\nresulting in the incorrect transmission of information. See Recommendation 70/2022-4.\n\n47",
      "source_file": "ES-10306- 202270 0815 IF Manresa (english version).pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 48,
      "text": "Comision de Investigacion de Accidentes Ferroviarios\nSystemic factors:\n\n1. The electrical interlocking at Manresa station has a series of peculiarities and limitations that\nlead to a high number of degraded situations that oblige the LSM to intervene directly,\nwithout the protection of the interlocking. See measures taken since the event.\n\n2. Existence of difficulties at Manresa station to check the dispatch of trains. See measures\ntaken since the event.\n\n3. Deficiency in the assertive skills of traffic agents which difficults to make effective their\ncompetence to manage the traffic, avoiding any possible interference by other railway staff.\nSee Recommendations 70/2022-1 and 70/2022-2.\n\n4. Direct communications between Local Signallers and the RUMCs. See Recommendation\n70/2022-3.\n\nDifficulties at\nliarities of electrical Manresa station to\nTnnarloca ng at Menreca check the dispateh\nstation\n_. LSM authorised 78443-train\nThe 95218-train elements a. driver without checking the\ndriver took a break a 95218 dispatch.\n. - when it was not | 77----- epraded situation ee | Risk of\ntraffic agents — . oN 95718 end\nthe RUMC in the os The 95218.train river mss\nDirect trate et Manteca comnanattans eT order of dispatch was\ncommunications station between 95218- ne not valid\nbetween local train driver and\nsignallers and the LSM\nRUMCs\nMEASURES TAKEN SINCE THE EVENT\nTraffic Sub-directorates of ADIF are currently working on a project for checklists that will facilitate the\nwork of signallers when they have to authorise signal overtakings or other manoeuvres, granting that\nthis activity will be recorded. For the accomplishment of this task, they will mark the conditions that\nmust be fulfilled to authorise the signal overtaking on their Tablet. In addition, HR department of\nADIF is considering the incorporation of reinforcement personnel to intervene in degraded situations.\nThis measure needs to be operative, and its effectiveness should be analysed when implemented. It\nwould also be advisable to increase the formation and training of signallers.\nOn the other hand, the replacement of the Manresa electrical interlocking with an electronic one has\nbeen requested for years; this project is currently at its execution phase and, according to ADIF, it is\nexpected to be commissioned in May 2023. The implementation of a two directional automatic\n48",
      "source_file": "ES-10306- 202270 0815 IF Manresa (english version).pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 49,
      "text": "Informe Final 70/2022\nblocking (TDAB) between Manresa and Terrassa will also be carried out. The single section automatic\nblocking (SSAB) between Manresa and Calaf will remain.\n\nThe project includes a Local Operations Post (LOP). This will be manufactured in accordance with the\nregulations for the design of video graphics and using the latest technology.\nThe operating program includes all those movements that could not been carried out previously by\nthe interlocking and that required the direct intervention of the signaller.\nADDITIONAL REMARKS\nIn addition to the conclusions drawn, the following facts have been identified during the investigation\nprocess:\nWith regards to the damaged unit 447 being towed, it seems that it was towed without a battery.\nGiven that the anti-locking system was not working, some special traffic conditions should have been\ncommunicated to avoid flats on the wheels.\nOn the other hand, the railway undertaking (RU) should have placed two portable signals on the side\nsupports at the rear of the last vehicle of the 95218-train, as established in Article 2.1.7.2. of the\nSpanish Railway Circulation Regulation or should have notified the lack of these so that measures\nforeseen in Art. 3.6.4.2, point 2, of the Spanish Railway Circulation Regulation were adopted.\n\n49",
      "source_file": "ES-10306- 202270 0815 IF Manresa (english version).pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 50,
      "text": "Comision de Investigacion de Accidentes Ferroviarios\nSAFETY RECOMENDATIONS\nAddressee Final Number Recommendation\nImplementer\nEncouraging the assertive skills of traffic agents to grant\ntheir traffic management competence as well as to reinforce\nAESF (NSA-ES) | ADIF (IM) 70/2022-1 their authority to avoid any possible interference by other\nrailway staff.\nStrengthening the vigilance of traffic-related activities to\nAESF (NSA-ES) | ADIF (IM) 70/2022-2 | ensure sufficient theoretical and practical training of\nsignallers, before and during the assignment of tasks.\nEstablishing a channel and procedure for communications\nADIF and between the local signallers and the railways undertakings\nAESF (NSA-ES) | Railway 70/2022-3 | management centres, to avoid interferences in the\nUndertakings coordination and supervision of the information required by\nsignallers for the performance of their duties.\nInstructing the train drivers on the importance of correct\nRenfe Viajeros transmission of information between them and the\nAESF (NSA-ES) (RU) 70/2022-4 signallers as well as the formalisation of the communications\nto guarantee safety.\n50",
      "source_file": "ES-10306- 202270 0815 IF Manresa (english version).pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    }
  ]
}