{
  "doc_id": "4853118b-8a50-4b57-a86c-4bf6628b1a09",
  "pages": [
    {
      "page_number": 1,
      "text": "Institution of Railway Signal Engineers Sine,\nBack to basics TO )\nyp ~ ay 和 Paul Darlington and Trevor Foulkes\nst _* I 7 a\nThis ‘Back to basics’ article covers the Role of operational telecoms\nsubject of railway telecommunications. As Operational telecoms systems have four\nwith other such articles, our intention is roles for a railway:\nto provide an overview for IRSE members 7\n“With new to the industry or who may not have * To facilitate normal day-to-day voice and\nIt out experience of working in this specific area. data communications. This includes links\ncommunications The content may also be useful for people to support the operation of signalling and\ntrains cannot studying for the IRSE Exam. The objective is electrification systems.\nmove\" to describe the subject in a generic manner 。 To facilitate quick communications in the\nand we have used examples based mainly event of a problem or hazard.\ntalecore networks and part 2 vet or 。 To facilitate communications of those\n. . attending an accident.\nissue of IRSE News will look at telecoms for 9\nCommunication is essential to all businesses and when required.\nincluding railways and without telecoms Normal day-to-day operational verbal\nSErVICeS trains would not run effectively. It IS communication includes the use by signallers to\npossible for trains to move without signalling, give instructions to drivers to move their trains\nbut coe ons ar necessary for einen in the event of a signalling system failure and to\nond ne dio f al le e stone vail bu, VOICE, 7. persons wishing to use level crossings. They are\nand radio Tor ral! operations, Fall DUSINEss, an also used to take and give back line possessions\nPassenger use. It can also cover commercial and grant electric traction isolations for\ntelecoms services for some railways. emergencies and to facilitate engineering works.\nPy en a, .\na SEE ee OP Qe, oo\n14",
      "source_file": "15_Telecoms.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 2,
      "text": "IRSE News| Issue 270 | October 2020\nIt also includes day-to-day conversations to plan to cross the track. Other lineside phones may also\ntrain movements and manage the railway. In all be provided to facilitate engineering or operational\nthese cases it is very important that the receiver of activities, although these are often undertaken\nthe instruction correctly interprets the instruction using a public or railway specific radio system.\nin order to carry it out. Most railways do this by the “Lineside telephones are normally analogue 300-\nuse of a voice protocol which requires messages 3400Hz in operation and connected via a twisted\nto be repeated back. However, for the telecoms copper pair in a cable to the nearest signal box or\nservice it is important that the voice channel is transmission node. No power supply is required\nclear and of sufficient volume to enable messages _at the telephone location, as it is powered over\nto be understood. Also, if the display system the copper circuit, at normally 50V DC. This is\nshows the location or role of the users then this known as Central Battery (CB) working. When a\nmust be proven correct, as far as is practical, since user wishes to establish a call, they lift the handset,\ncredible but incorrect information could mislead a — which places a 600 loop on the pair. This allows\nuser into making an incorrect decision or miss- a current to flow which is detected at the far end.\nunderstanding the context of the message being The actual loop current will be dependent on the\npassed. A misinterpretation of an operational resistance of the copper circuit and will decrease\nmessage can result in an incorrect action and with distance. Depending on the use of the\npotentially lead to a hazardous situation. telephone, the far end may route the call directly\nWhen there is a hazardous situation it needs to to the signaller and return ringing tone to the User.\ni , , , This is a point-to-point telephone circuit and is\nbe rectified, often with trains being stopped, ; ,\n, commonly used for level crossings. Alternatively,\nbefore an accident occurs. Railway telecoms , ;\n. . the farend may return dial tone which tells the\nradio systems have a key role in managing such ,\n. . user to enter the number for the extension or\n并 。 situations where trains need to be stopped. Trains . . :\nIf there is an ; . service they require. The number is normally sent\n. - may need to quickly alert the signaller of a hazard ,\naccident it is , , as a sequence of multi-frequency tones which\nand request assistance. The person becoming\ni tant that aware of the hazard needs to be able to contact are decoded at the far end and used to route\nmporan 3 all trains in the immediate area quickly and easil the call to the required destination. Once the\nthe emergency ©a quickly al y, far end answers the call, a duplex speech path is\n。 and instruct the drivers to bring their trains to a age .\nservices can , , , , , established back to the initiator and conversations\nstop. Time is of the essence in passing this type ;\nbe contacted of message. Even if the train cannot be brought can take place. When the user wishes to terminate\n, ; the call, he replaces the handset which removes\nickly” to a stand before the collision, a reduction\nQuICKly . Cae , the loop. If a phone needs to be rung, an AC\nin speed can significantly reduce the impact . , -\nofthe accident ringing current typically 75V at 25Hz is applied\n, to the line. The current is interrupted to give the\nIf there is an accident it is important that the distinctive ringing cadence. The telephone will be\nemergency services can be contacted quickly to rung by this current until the handset is lifted and\nhelp with recovery and reach any injured people. the loop applied. At this point the ringing current is\na In many cases the emergency services provide removed and the speech circuit established.\nTelecommuntcations | their own communications systems but when Cc\nond emooth operation of access distances are extended, for example in opper cable\nrailways worldwide. The sub-surface stations, tunnels, or remote locations, Telephones will normally be connected via a\npeople upon which the the equipment to allow the emergency services to _ two pair ‘tail cable’ to a lineside location or\nnetwork depends workin extend their normal radio systems may need to be connection box where the circuit is connected\ndifferent roles, and have provided by the railway. to the main line side cable. Copper cables come\ndifferent needs of their _ _o.. in many varieties as the number of pairs can vary\nChote Shute tock/ Voice communications by telephone from single pairs to hundreds of pairs and the\nAPChanel, Paveils Some railways provide lineside telephones for the conductor size can vary from typically 0.63mm or\nDunalcevs 1000Words public at level crossings so they can contact the 0.9mm gauge (diameter) to much bigger sizes on\nand Chuyuss. signaller in an emergency or to obtain permission older copper cables. Each pair is twisted together\n: at: en Tet aiff Ap\nAP eu 2.\now xt, : . ”、 wore ~~ ‘ =. .\nts oe 站 ~\n~-., \"e, , e. Pe\n15",
      "source_file": "15_Telecoms.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 3,
      "text": "IRSE News| Issue 270 | October 2020\nto reduce crosstalk from other circuits inthe cable — reflection that occurs, to identify any problems\nand from external sources. In cables with many that might be present in the cable. A clean cut is\npairs, these are arranged in layers. A system of easy to locate but a poor joint or deteriorating\ncolour coding is used so that each pair and the fibre connection will result in a higher reflection\nconductors forming each pair (known as legs) reading, with the OTDR indicating the distance\ncan be individually identified. The copper pairs to the problem.\nare normally protected by a moisture barrier and .\n“Telecoms petroleum jelly to prevent water ingress, and an pare nenwork Dancwicin can aise Pe eases\ncopper cables insulating sheath, which can be zero halogen and ¢ itted by th Leaisl Purp ‘\nPP low smoke if required for underground locations. permite y the nationa egis ation\ncan be used Some older copper cables were provided with a covering commercial telecoms. This could\nto carry DC steel armoured layer for electrification traction eee eee nores or ead 4 rave\nsignalling immunisation purposes, but this is now normally eeconms Cable routes fase Ota Pa les.\n. 。 provided by a separate screening conductor. The Any lease agreements will need to take into\ncircuits, but not sheath is normally marked with information so that account the Priority of telecoms services\nvice versa as cables can be identified. for railway operational purposes and the\n。 maintenance arrangements.\nconventional Telecoms copper cables can be used to carry\nsignalling DC signalling circuits, but not vice versa as Concentrators\ncables are not conventional signalling cables are not constructed ”At the signal box there will be an operator\n, with twisted pairs since they are designed for only ”interface, sometimes called a “concentrator”, to\nconstructed with pc circuits. If a telecoms cable is used to carry which all the lineside phones and other phones\ntwisted pairs” both telecoms and signalling circuits it is normally are connected e.g. phone connections to\nrecommended to fully terminate all the cable pairs adjacent signal boxes, electrical control rooms\nin every trackside location case, using a method and operational control rooms. When a phone\nwhich facilitates easy identification of pairs, testing is ringing in, an appropriate light flashes or the\nand isolation. For good quality speech and data display is changed to show which phone it is.\nservices, a telecoms cable will require a cable The signaller can choose which line to answer by\ninsulation resistance of several megohms, which is lifting his handset and selecting the particular line.\nfar higher than needed for a DC signalling circuit. He can also ring a phone by lifting the handset\nFibre cables and pressing the appropriate button. In some\na railways, phone lines for some level crossings\nThe introduction of fibre optics revolutionised give a distinctive different ringing sound so the\ntelecoms cable networks for railways. Fibre optic signaller can take quicker action. Sometimes\ncables are small and light (compared to copper the signaller’s handset is equipped with a press-\nmultipair cables) and can be used to transmit very —_to-talk button so that the driver can only hear\nhigh data rates (several 100Gbit/s) and are immune ”what is said by the signaller to the handset and\nfrom electrical interference. The distance between not hear conversations on other lines. There are\ntransmission nodes can be increased significantly many versions of concentrators based on the\ncompared to copper cabling. technology available when they were brought\nFibres carry short wavelength light pulses and into service. Some have a key and lamp for each\nare used in conjunction with digital transmission line, others are based on touch screens telephone\nsystems. Early fibre cables were multimode systems similar to those used in money markets\ngraded -index but were quickly superseded by and known as ‘dealer boards’. Some combine the\nsingle mode fibre using 1310 nanometre (nm) radio and fixed lines on the same display as the\nwavelength with improved attenuation and signalling controls. Modern concentrators are\nbandwidth. Multimode cable remains cheaper based on computers that communicate using the\n“UHF radios and can still be used on short haul applications, Internet Protocol (IP) see later.\nare generally typically in buildings. Early cables typically If the signal box and phone are separated by an\nused for station contained 8 or 10 fibres positioned within a loose appreciable distance, say over 15km (10 miles),\ntube construction with a Kevlar® central strength then a transmission system will be needed to\nmanagement, member with no metallic elements. Fibre count ae ¥st\n- ns ; , , extend the circuit. This is covered later.\nshunting and within cables has increased and cables containing\nto facilitate hundreds of fibres in several tubes are now Voice communication by radio\nengineering copper equivalents, can be rolled on to.adrum in UNE (Ultra High Frequency) radios are generally\nwork\" much greater lengths requiring less joints when used for station management, shunting and to\n‘ facilitate engineering work. Some are used as\ninstalled trackside. Care has to be taken however ‘back-to-back’ radios and some have base stations\nduring design and installation not to bend the fibre hich allow the connection of a landline from. sa\ncable too tightly around corners. wae! ; SAY\nthe signal box. UHF radios are normally simplex so\nThe essential tools for working on fibre are each user has to press a button when they wish\na fusion splicer and an Optical Time Domain to talk and release to listen. Individual radios are\nReflectometer (OTDR). A splicer effectively distinguished by callsigns and strict voice protocol\nheats and welds the fibre together. Early models is required as a licence condition. When used by\nrequired the jointer to align the two ends a shunter to give instructions to a driver, some\nmechanically using a built-in microscope but now _ radios have a facility to transmit a confidence\nthe process is automated. The OTDR is used to tone so the driver knows the shunter still wishes\nsend pulses of light down a fibre and measure any — them to continue or else the shunter has to keep\n16",
      "source_file": "15_Telecoms.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 4,
      "text": "IRSE News| Issue 270 | October 2020\nOperations and Dispatcher Radio block Signaller\nmaintenance centre centre fixed terminal\nOther | || L _\nnetworks Ss\nMobile Switching\nCentre (MSC) AGSM-R network will typically\nhave more than one MSC,\nseveral BSCs and many BTSs\nBase Station\nBSC Controller (BSC) BSC\nd A A A\n‘ap ‘ap as ‘as\nae MA MA MA\nSe上 S2 S2\nvee qa Base Transceiver - RS BTS -、。 -人 BIS 机 RE BTS\nMobiles Portables\nFigure 1 - Schematic of repeating the instruction. For engineering work mounted on the train or vehicle roof and have\ntypical GSM-R network. public radio networks are often used if there is higher power levels. As a train passes along\ncoverage at the location. a section of route it reselects the next base\n. , , , station to monitor based on the “neighbour list”\nMany railways have or are installing their own transmitted from each base station and the relative\nnational radio networks to the GSM-R standard. received signal strengths of each neighbour and\nThis system is based on the 2G version of public the currently selected base station.\nnetworks with some extra enhanced facilities: | bi twork it does not matter which\n; na public ne\n* Railway Emergency Call (REC). base station is used for a call, but for a railway\n* Prioritisation for important calls. emergency call it is important as it is established\n。 Location dependent addressing e.g. contact around the GSM-R cell which the train mobile\nthe signaller who controls the section of line had selected before the call set up, to make sure\nfor the train making the call. a call is routed to the controlling signaller. Thus,\n。 Functional dependent addressing e.g. contact the control of the reselection is important and\nthe driver of train number 50629. needs careful design of frequency allocation\nand neighbour lists, especially when there is a\n“Radio coverage 。 Voice group calls e.g. a shunting group. parallel railway close by. Frequency allocations\n. 。 。 。 Data services e.g. European Train Control also have to take account of any noise which\nis critical to the System (ETCS) data. may be introduced by the receivers picking up\nsuccess of a Figure 1 shows a schematic of typical GSM-R signals on the same or adjacent frequencies\nGSM-R system” system. GSM-R systems have dedicated spectrum from other masts in the area. In addition, to\nwhich is harmonised across Europe as: Uplink reduce the size and hence impact of a railway\n876—-880MHz for mobile transmission and emergency call, operators normally want to be\nDownlink 921-925MHz for mobile reception. able to distinguish between trains on the various\noo, lines approaching busy junctions with often the\nRadio coverage Is critical to the success of a base station mast covering three or more sections\nGSM-R system. Many issues affect radio coverage, ”of line approaching a junction. This has to be\nincluding cuttings, trees, hills, mast height and achieved using only a small number of frequencies\nthe frequency used. A public mobile system radio compared to a public GSM system. In Europe only\ncoverage will be optimised for revenue anditmay 19 are currently available for GSM-R.\nbe acceptable for small areas to have no coverage.\nFor a railway radio network, complete coverage It is also important for the handover of calls to\nalong a line of route will be required, including all occur robustly so as to not interrupt speech\ncuttings, bridges and tunnels. or data communications. This handover takes\ntime and therefore the handover zone has to\nIt makes a significant difference to radio coverage _sincrease as the maximum line speed increases.\ndesign if a network is being designed for vehicle Care has to be taken when trains enter a tunnel,\nmounted mobile radios or hand held portable for example, to ensure there is sufficient time for\nradios, as the former can have the antennas a handover. Additional base station or repeaters\n17",
      "source_file": "15_Telecoms.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 5,
      "text": "IRSE News| Issue 270 | October 2020\n卫 “3 - bee\n> - e . 4 rN\n\nTunnels require may be required in large stations, cuttings, under Work is underway on the replacement for\nsignificant consideration bridges and tunnels. GSM-R, called FRMCS (Future Railway Mobile\nwhen providing radio Communication System) but it is expected that\ncommunications. A common problem to almost all railways is - , , ,\nPhoto Shutterstock/ providing radio communications in tunnels. eee an ona will be carried\nDirtymouse. Communication using a tunnel mounted aerial y\n\nin a single bore tunnel at 450MHz is possible Data\n\nup sc one oak aie can reac wm Railway telecoms does not just use voice as data\n\nfrequency of 900MHz the distance increases to circuits are required to allow remote control\n\naround 2km or more for double track tunnels and monitoring of equipment. Data circuits are\n\nThe tunnel dimensions become significant as provided to support signalling systems, e.g. SSI,\n\n; - , Westlock, Smartlock when long distance terminals\ngree ere eon high Ce neve in Germany, are required. Data circuits can be supported over\n. ‘ | | | irectly int\n“Tunnel which are built to a more generous loading gauge COPPEr cab es Using modems or plug directly into\n. transmission equipment.\n\ndimension than other railways, such as the UK.\n\nIMENSIONS The effect of introduci train into the t | The near continuous data connection between\nbecome | ect © th ro tterunti vate de fe he trains and control centre to support the European\nsianificant” Is £0 Increase tie altenuation rate cue to me Train Control System (ETCS) is normally provided\n\n9 blocking presence of the train. In a single via a GSM-R network in Europe and beyond\n\nbore tunnel this can be a significant problem, ; .\ndepending on the tunnel dimensions In a double Railways, particularly metros, that use other cab\ntrack tunnel the effect may become significant based signalling systems (e.g. Communications\n, ; Based Train Control CBTC) may adopt an\nwhen vans a ents At Ce eqnene 人 alternative radio system such as TErrestrial Trunked\nonte sen the pate of 和 id streng tation Radio (TETRA) or even Wi-Fi if the line is in tunnel\nwhere external interference can be controlled.\nthrough the tunnel. Factors that can increase the ,\nrate of attenuation include the presence of bends Early versions of ETCS used circuit switched data\nand hence required a constant data connection\n(c the ens the CC lned) of the tunnel circuit to be available for the whole journey. This\nCONCTERE, ONCK OF TOCK NNEC. causes problems in dense areas where many\nThe space occupied by trains in the tunnel is trains are trying to access the network. To address\nalso important. In tunnels with no overhead line this, some GSM-R networks are being enhanced\nelectrification and a restricted clearance, for to support GPRS (General Packet Radio Service)\nexample, the distance radio waves propagate which allows better use of the radio bandwidth.\nis lower than comparable tunnels with a larger Packet and circuit switching are explained later in\ngap between the roof of the train and the the IP section.\ntunnel ceiling. SCADA Systems\nmm alternative approach to ae an a ree space Supervisory Control and Data Acquisition (SCADA)\ns diating ables These have the a dvantage f systems can be used to monitor and control many\n; ~~\" , different processes and systems for railways.\n\nnavirtg 2 consistent ang cna tape eve’ However, the primary railway application is the\nbane The cable is ‘leaky’ in that it has gaps a control of electric traction systems over wide\n\n; areas. Telecoms data links with high availability\nslots in Its Soe ConCHc rw ca unbalances the will be required for electric traction SCADA system\nrece a inane Sona ve ne . propagate control, together with robust voice services\n\nq 9 9 for routine and emergency isolation purposes.\n18",
      "source_file": "15_Telecoms.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 6,
      "text": "IRSE News| Issue 270 | October 2020\nnora -一 一 四 -一 。 a aa ]\n. . ‘ 人 . io ‘wy 一 , 1 |\niw Te jgtaraey | Gili\n' ‘ ‘y 7 al 1 ae . ‘, } ; a\n. ie | fa r@ “ei Lo i\nee Lr ee 4 Qkarro ~~ ,\na ee SAR Se a\n。 A : 用 : f . ‘\\ 下 ii 1 \\\nf hes =\nAbove from left, a Eliminating common failures which could isolate applications. The primary layer is where channels\nsignallers fixed GSM-R more than one successive electrical supply site is are converted from analogue to digital form so\nterminal. important, so an emergency isolation can still be they can be combined with other circuits and\nCab GSM-R mobile unit. implemented. SCADA systems may also be used sent around the network. When the primary layer\nSmall ‘key and lamp’ for the monitoring and control of ancillary systems is connected to line side cables, this is normally\nsignallers concentrator. such as lifts and escalators, ventilation and air- done using a primary multiplexer (PMux). PMuxs\nconditioning and drainage systems and will also can support, speech circuits and data circuits up\nrequire telecoms links. to 2Mbit/s. PMuxs are connected using an E1 data\nae , , stream at 2Mbit/s. PMuxs can be configured as\nTraditionally signalling telemetry systems are , , ,\npoint to point or in rings. Each E1 data stream has\ngenerally not regarded as SCADA systems but , - . ge\n- , , ae 32 timeslots. Timeslot (TS) 0 is for synchronisation\nthey perform a very similar function, transmitting ;\nPnnerranee and alarms and normally TS16 is used for channel\ncommands and receiving indications on the status ;\n. , . associated signalling. The other 30 timeslots each\nof signals, points, track circuits. However in some ,\n, , , of 64kbit/s can be used to support speech or\nrailways SCADA capable equipment is used for , ,\n. , data circuits. The main interface cards used ona\nsignalling remote control systems. ; .\nrailway network may be:\nTransmission systems 。 Subscriber - to connect to a phone via the\nTransmission systems are used to transmit lineside cable.\nand receive more information than a single 。 Exchange - to connect to the exchange\ncable pair or fibre and over longer distances. or concentrator.\nThey have evolved over time, mainly driven by 。 4-wire E&M - to provide transmit and receive\ndevelopments for public telephone networks. .\n7 . aoe paths and up to 4 status circuits which can be\nTransmission Nowadays transmission systems are normally\n. h d used to operate relays.\nioment is designed in layers to reflect the capacity an\nequip points of presence for the different services. ¢ G/03 data interface for SSI.\nnow normally The core network layer has relatively few nodes 。 V24 or X21 for lower speed data.\nconnected using — connected by high speed links and configured 。 ISDN (Integrated Services Digital Network) for\nlineside fibre in a diverse manner. The access layer, on the some terminal equipment.\n. other hand, would have frequent nodes situated A l teleoh cuit h f\ncables where services are required, e.g. at base stations normal tereprone circult Nas a Trequency range\nor sianal boxes of 300-3400Hz. A PMux converts analogue\n3 speech into a digital form by sampling the sound\nTransmission equipment is normally connected every 125uS (i.e. 8kKHz) and then converting\nusing lineside fibre cables, but older systems may the sample value to a digital number between\nstill be connected by copper cable. To provide -128 and 128 i.e. 8bits. This conversion is called\ndiversity transmission equipment can also be quantising and is done to limit the noise due to\nconnected by a service provided from a public the process to a small proportion of the amplitude\ntelephone operator. of the signal. So, the overall bit rate by channel is\nPri l d pri 8bits/sample x 8000samples/second = 64kbits/s.\nrimary ayers and primary The interface card then allocates this data stream\nmultiplexers into a timeslot of the E1 circuit. In addition, it\nOlder telecoms and data transmission systems, detects items such as the loop condition or\nsuch as Plesiochronous Digital Hierarchy (PDH) ring current and sends codes in timeslot 16\nand Synchronous Digital Hierarchy (SDH) are to enable the interface card at the far end to\nknown as “circuit switched” transmission, with a reproduce the condition.\npermanent connection established between two\n19",
      "source_file": "15_Telecoms.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 7,
      "text": "IRSE News| Issue 270 | October 2020\nInternet Protocol (IP) networks\nCore SDH transport High bandwidth services IP (Internet Protocol) as its name suggests is\n(STM-16) _ the basic protocol used on the internet, but has\n(e.g. IT and GSM-R)\nbeen the heart of all new telecoms networks and\ndata communications systems provided for a\nAccess SDH transport number of years.\n(STM-1) The PDH and SDH “circuit switched” transmission,\n2/34/45Mbit/s with a permanent connection established between\nAccess DSL services two applications, ‘locks up’ the communication\ntransport resource and is inefficient, as the transmission\n(2Mbit/s) path is used even when no data is being\ntransmitted. IP however is a “packet switched”\nnetwork, with the data message split into small\nPrimary Sub 2Mbit/s packets to share capacity and transmission paths\nlayer services which are only used when data needs to be sent.\nThis requires ‘routing’ to be established for each\ndata exchange, however resilience is built in and\nCopper Analogue the communications resources are shared, making\nlayer services IP far more efficient than circuit switching.\nEach packet needs to be given information about\nthe destination, its origin, and other information,\nto allow the data to be routed around a meshed\nFigure 2 - Typical network PMuxs are normally connected via bearer services network of routers. An IP packet is shown in\nconfiguration based on through the higher order transmission layers but Figure 4. The payload is a variable amount of data\nSDH equipment. can also be supported using Digital Subscriber to be transmitted and is typically a few kilobytes,\nLine (DSL) modems over lineside copper networks. but can be up to 64 kilobytes. The IP header is\nA typical network configuration based on SDH fixed at 20 bytes and contains a 32-bit source\nequipment is shown in Figure 2. and destination address as well as an indication\noo, ; f the length of th ll ket. Other fiel\nTo connect a circuit switched network to an OF bre tenghy OF tne overall Pack 9 er ne ds\nprovide a checksum, the version of IP being\nInternet Protocol (IP) network, gateways are ; ,\n, , used, and a simple type of service indicator. The\nrequired to convert the circuits or E1 data m4: on gs ;\n, time to live” field is used to set the maximum\nstreams into a set of packets to send round\n, , - number of hops between router nodes to prevent\nthe network. Data circuits for some signalling , . .\n, ane unsuccessful delivered packets circulating and\napplications (example SSI) have specific time delay ;\n; . , clogging up the network. After the packet has\nrequirements which need to be addressed in the ; i cs\n, transferred its specified number of hops it is simply\ndesign of the core network and require allocation , ,\n, discarded and ‘dies’.\nrules for such circuits, or for the E1 data streams\nsupporting the circuits. The IP network as described in its raw state is\n, , , simply a “best effort network”, and there is no\nFigure 3 shows a typical example of how lineside ply a , ,\n. , guarantee of the packets arriving, or in which\nphones may be connected to a signal box, using ; .\n, ; order they arrive, and the network is what is\nFigure 3 — Lineside older circuit switched transmission. known as connectionless, so the transport layer\ntelephone connected ‘ ,\nusing circuit switched manages the flow of IP packets. Transmission\ntransmission.\nTransmission\n, , node\nPrimary multiplexer\nwith exchange cards\nWA Transmission Primary multiplexer\nnode A with subscriber WA Copper cable\ncards\n人 , L\nc\nEde ©\n8 Junction\n5 boxes\nO\nPrimary multiplexer\nwith exchange cards\nTransmission Tail cable\nnode B Fibre cable\n20",
      "source_file": "15_Telecoms.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 8,
      "text": "IRSE News| Issue 270 | October 2020\nA network of routers is shown in Figure 5 together\nwith the role of the TCP and IP headers. The\n_— routers only examine the IP packet header, and\nsimply pass the datagram packet onto the next\nPayload (max 65kbytes) Header (20 to 60 bytes) router in the network, according to a table held\nwithin the router. Multiple paths for the packets\n一一一 ; are available so the transmission network is more\n-一 =a » reliable and it is possible for consecutive packets\n一 一 5 / to be routed over different paths between router\n一 E & | nodes. Once the packets are delivered to their\n一 3 3 8 | end-point, the TCP assembles packets in the\n一 8 5 §& ep | correct sequence and requests the retransmission\n.一 5 3 < 有 c s , of delayed or errored packets if required.\n-一 Do 日 二 名 o 2\n2 3s 2 上 g 2 5 = g! Not every application has the same requirements\n_ for the delivery of IP packets. For example, when\nOptions Destination Source olalalo lol otal transmitting a document or email it is critical\n0-40 4 4 the entire data message is transmitted with no\ncorruption. It does not matter if it takes a few\nmilliseconds to receive the data message, so TCP\nis used, which will request the re-transmission of\nany missing or corrupt data packets. However,\na voice or video image signal is time critical\nFigure 4— An IP packet. Control Protocol (TCP) sits within the IP payload but very small gaps in the image or voice can\nand envelopes the source data by a 20-bit header _be tolerated, and may not even be noticed.\nand is carried by the IP packet as the payload. TCP _‘ For these applications User Datagram Protocol\nacts as a connection-ordinated protocol within (UDP) is used. This assembles the data packets in\nthe connectionless network, it assumes the IP the correct order, but does not arrange for the\nnetwork is unreliable and numbers the IP packets retransmission of corrupt or missing packets; they\nor “datagrams” at the transmitting end of the link. are simply discarded.\nIt examines the numbers at the receiving end and 。 。 。\nrequests the retransmission of any packets not Multi-Protocol Label Switching (MPLS)\narriving within a specified period. The numbering MPLS is a method of providing a guaranteed\nsequence is used to arrange the packets into the Quality of Service (QoS) and Virtual Private\n. correct order, and finally TCP monitors the flow of | Network (VPN) capability within an IP network,\nFigure 5 — A network of , , , ,\nrouters showing the role Packets getting through the network and adjusts and is a method of making the connectionless\nof TCP and IP headers. the launch rate accordingly. IP network connection orientated. MPLS uses\n-一一 -一一一\nIP packet IP packet\n— | — |\n— |\n— |\n— |\n— |\n| x Routers examine only — |\n} UL — IP packet headers oe 上 上\n21",
      "source_file": "15_Telecoms.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 9,
      "text": "IRSE News| Issue 270 | October 2020\n‘labels’ to specify a virtual path for the IP packets the Transport Layer, there is either TCP for the\nto follow using a 20-bit label attached to the front —_ latency tolerable, or UDP for the latency intolerant\nof each packet. MPLS provides better latency for applications. There is a vast array of protocols\ntime critical applications, such as voice and video, covering many possible applications that may run\nand with VPN capability for security. The faster over an IP network, either internet or intranet or\nrouting is because the label switching is done in an IP based secure signalling system; and it is at\nhardware, whereas normal IP routing involves the _ this level where full end to end data security needs\nslower processing of software to deconstruct and _ to be addressed. The design and standards for IP\ndecode the IP address. MPLS also incorporates and the internet are administered by a consortium\nClass of Service (CoS) network performance to of users, academics, and manufacturers known\ndifferentiate between time critical, high priority as the Internet Engineering Task Force (IETF),\ntraffic and delay tolerant, low priority traffic. To use unlike traditional telecoms networks which were\nthis service, MPLS capable routers are required. designed to international standards governed by\nVoice Over IP (VoIP) the International Telecommunications Union (ITU).\nThe IETF have set recommendations for OSI layers\nVoIP systems offer many advantages compared to 2 to 7, however the IETF considers layers 5 to 7a\na traditional circuit switched telephone exchange single entity.\nnetwork, as voice simply becomes another\napplication running on an IP network, this offers Management of a telecoms network\n“Security isa many advantages and the capability of exceptional Software-Defined Networks (SDN) are now\nj good quality sound. This is because high speed common. SDN enables remove dynamic, efficient\nconcern with codecs convert the voice to IP packets without oar y '\nIP networks needing the normal 4kHz frequency filtering. network configuration and alarm management\n' oy ar , , in order to improve network performance and\nso real time This higher quality Is subject to loading on the IP monitoring, making it more like cloud computing\n。 。 network, which can lead to loss of packets and ne\ncyber security Is hence degradation of sound quality; which is than traditional network management.\ncritical” why a high Quality of Service (QoS) IP network In many cases modern business systems are based\nis required for VoIP. A power supply for the VoIP on an IP network and the methods of connecting\ntelephone will also be required. computers, printers and servers are well defined.\nSecurity is a concern with IP networks, so real time VoIP telephones are increasingly used In offices\ncyber security using encryption and firewalls along 9d Ifa railway telecoms IP network is provided\nwith “defence in depth” techniques with multiple for operational use it is also possible to extend\nlayers of defences is critical. it for business purposes. Interfaces may be\nrequired to any older circuit switched digital\nProtocol layers telephone exchanges which could still be used in\nOne way of explaining the various IP a railway network.\nprotocols and layers is to map TCP/IP and its 。 。\nsupporting protocols against the Open Systems Increasing capacity\nInterconnection (OSI) model as shown in Figure 6. | Coarse Wavelength Division Multiplexing (CWDM)\nAt physical Layer 0 and 1 there are the various or Dense Wavelength Divisional Multiplexing\ntransmission systems and cables in the access and (DWDM) technology can be used to make better\ncore network. At Layer 2 there are various data use of installed fibre. These systems use Frequency\nlink systems that may be used in the telecoms Division Multiplex (FDM) with between 18 and 160\nIP network, including Ethernet and possibly the wavelengths of light over single mode fibre. In this\nPublic Switched Network for dial up connections. way many transmission links can be overlaid onto\nIP resides at Layer 3, the Network layer. At Layer 4, the same fibre, to significantly increase capacity.\nFigure 6 — The Open\nSystems interconnection\nTransfer Protocol, SMTP\nis Simple Mail Transfer\nProtocol, POP is Post\nOffice Protocol, FTP is\nNetwork File System,\nXDR is External Data\nPlesiochronous Digital\nHierarchy and ADSL is\nAsynchronous Digital OSI Internet\nSubscriber Line.\n22",
      "source_file": "15_Telecoms.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 10,
      "text": "IRSE News| Issue 270 | October 2020\nElectrification, interference stanchion to permit a 25kV-0-25kV arrangement\nand immunisation giving a more balanced system. Trains continue to\nbl take power at the 25kV voltage with the current\nElectric traction systems Nth clean problems being returned in the ‘other’ catenary wire. In this\nfor telecommunications with e ectromagnetic way, for sections which do not have a train taking\ninduction of high voltages and noise into speech power, the currents in the OHLE conductors are\ncircuits. This can arise from harmonics resulting the same magnitude but in opposite phase. This\nfrom the electric feld generated by the Ce means that at any point which is an equal distance\ndrawn by electric trains in 25kV overhead line from both the conductors the induced magnetic\nsystems, or by the AC feeder cables and the field will be effectively zero. This is the ideal place\ncrude rectification of mene suppwyic provide for the cable route. It is not possible to directly\na Oe aston system corn USING t h ran or align with this ideal positioning as the catenary\n“S&T engineers over ead catenaries. FT engineers Nave to wires move from side to side and go up and down\nensure interference will not cause malfunction f bstacl h as brid d level ,\nh t ome ; or obstacles such as bridges and level crossings.\nave to ensure of safety related circuits, particularly that short However the nullifying effect still significantly\ninterference cre currents do not generate high vorages that reduces the electric field. As has been mentioned\nmalfunction of harmonics from traction systems should not cause with no metallic components has significantly\na ystet P ith reduced the problem of electrical interference\nsafety related speech circuits to become noisy and interfere wit and associated immunisation for new systems and\ncircuits” data circuits. in some cases may allow the use of simple feed\nVarious traction systems are in use around catenary systems.\nsystorns inuse today. The Reiter nen , In part 2 of this article we will look at telecoms\n; systems for passenger use and the differences\nTelecommunications Union) requires induced between oublic and railway telecoms networks.\nvoltages in telecoms copper cables under normal\nconditions to be no more than 60V RMS, and\nunder system fault conditions 430V RMS. The \" on\nnoise limit for telephone circuits is a psophometric Back to basics” and the IRSE Exam\nelectromotive force of ImV. Psophometric noise is We hope our “Back to basics” articles are\n‘weighted’ the same as human-perceived levels of _ particularly interesting and useful to those\nnoise. This is more important for telephony than of you who are maybe new to the industry\nthe raw noise voltage. and are working to build up your knowledge,\nA range of solutions are required to mitigate or who have moved to a new role involving\nthe effects of traction power supplies on telecommunications. For those considering\nline side services: taking the IRSE exam, these articles should be\n: | ns of ol particularly relevant to assist your studies.\n。 Limiting the lengths of copper cable section.\n. As an example, why not think about how you\n。 Having a robust balance to earth interface for would answer these questions from the 2019\npowered equipment. Module 6 of the exam, based on what you have\n。 Position of the cable route (and hence cables) learnt from the article?\nwith respect to the traction cables. You are required to produce a radio\n* Providing an earthed screening cable in communication system that provides coverage\nthe cable route. for trains within tunnels and for station staff\n。 Replace longer distance copper cabling with a throughout an underground system. The\nfibre optic based system. train traction system is an overhead 25kV\nSome railways provide traction current at 25kV, catenary system.\n“The advent of 50Hz to the train with currents of around 300A a) With the aid of diagrams describe your\nfibre optic cables flowing through the train from the catenary wire chosen system and explain the factors\n. . to the rails. To minimise interference, a booster you would consider as part of your\nwith no metallic transformer is used whereby the overhead line design. [12 marks]\ncomponents equipment (OHLE) is separated into in sections p fi lan includina th\nhas significantly of about 3km and at the end of the section a b) Produce an vn ne eee an inctu ed tne\nd dth Booster Transformer (BT) is used to ‘suck’ the nos you lite he ertaxe to am t Ie\nreauce e return current out the rails and into a separate unctionality of the system. — [13 marks]\nproblem of return conductor mounted on the outside of the\nelectrical overhead stanchions roughly at the same height You are the telecommunications\n。 \" as the catenaries. This creates an opposite phase designer for a project which is to renew\ninteference and opposing electric field that helps to cancel a telephone on trator and associated\nout the effect of the current in the catenaries but lineside telephones\nthe effects of the currents within the occupied\noverhead line section still need to be addressed. Using a risk assessment methodology\nae of your choice outline the hazards, and\nMore transformer aystern whereby, use 3 oO proposed mitigations, throughout the asset\n/ ‘ lifecycle. [25 marks\ncatenary’ is mounted on the outside of the 了 , I\n23",
      "source_file": "15_Telecoms.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 11,
      "text": "Institution of Railway Signal Engineers a\nBack to basics TO\np> ay ¥ si has Paul Darlington and Trevor Foulkes\nst * A) a wo,\nPart 2 of ‘back to basics’ for railway system will quickly annoy customers and may\ntelecommunications covers telecoms for result in negative comments and poor publicity.\npassenger or customer assistance. As with So, all sound systems should be designed by\nother similar articles, the intention is to competent sound communications engineers.\nprovide an overview for IRSE members A good PA system will depend on four\nnew to the industry or who may not have k\n. . . - ey requirements:\nexperience of working in this specific area.\nThe content may also be useful for people 1. Loudness or sound pressure level. This\nstudying for the IRSE Exam. The objective is should be at a volume or level to please\nto describe the subject in a generic manner those intending to hear the communications\nand we have used examples based mainly on message, but not too loud to annoy\nUK main line railways. neighbours and residents close to a railway\nThe concourse at . station, or train passengers who may not need\nStrain ga New Public Address (PA) to hear the announcement, ”\nreet station In ,\nthe UK is typical PA systems have always been important for 2. Intelligibility. This is one of the most important\nof the challenging communicating with customers and staff, and are requirements of a PA system and where many\nenvironment for PA also used for emergency purposes when linked systems fall short.\ndesigners. to fire detection systems. A badly designed sound\nTAN “\n- 六 ¥ = “~\n” \\ S&S AND CENTRAL | —_—\"\n. \\ = TM~ had N \\: - { | 人 A J ws > — ~ ‘ 5 、\n4} ’ = m ? 45 - | é me SJ VS —\ntoo \\ =: ao ‘Wen 1 — eee = 有 一 — 一 age\n11",
      "source_file": "15_Telecoms.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 12,
      "text": "IRSE News| Issue 271 | November 2020\na ne Oo , , * ‘ P -\n本 . ‘ 本\n_ 一 a ~~ Y : . ’\n一-一一-一一一一\nfrom left. a row of | 3. Naturalness. A natural sounding PA system is Loudness and intelligibility\nNew St station am one where pre-recorded announcements will Station PA systems must be carefully designed\nsound the same or similar to real time voice to avoid conflict between wanted and unwanted\nSpeakers at Crewe station. announcements. noise, and simply specifying a sound pressure\n4. Reliability. All PA systems need to have good level and intelligibility requirement may provide\nInductive loop for hearing reliability and availability, with appropriate a system acceptable for rail users, but one which\naid users. redundancy in their design, this is especially annoys nearby residents. There have been cases\nimportant with voice alarm systems which may “where PA systems have been renewed with an\nCombing PA with CIS have performance requirements mandated by _ overall lower volume, but with better intelligibility\nis effective for good national legislation. resulting in more complaints from neighbours. An\ncommunications. The first three requirements are dependent extreme case resulted in a noise prohibition notice\non the acoustic environment, which can be and for the station PA system to be switched\nparticularly challenging at railway stations with off until the problem was resolved. A detailed\nvariable building design and noisy trains. Sound investigation found a number of issues. The\nmay be reflected, refracted, diffracted, absorbed station at times was busy with announcements\nor transmitted through obstructions, dependent as frequent as every 30 seconds. A second issue\n. . upon the material and size of the obstruction. was that some announcers took 34 seconds to\n“A typical railway communicate the same information as other\nstation will need Atypical away sen eee resign announcers did in 6 seconds. The solution\ncareful desian b P 让 llenai ; consisted of a number of changes which included\n. 9 can De a very Challenging acoustic environment. zoning of the system and establishing common\nof its speaker The sound design engineer will need to consider: scripts for all announcements.\nsystem to make the operating environment of the equipment in\nterms of temperature, humidity and dust; security Ambient noise sensing continuously monitors the\nthe best of what of equipment; listed building consent as many changing ambient noise levels and adjusts the\ncan be a very stations in some countries are protected buildings; audio level of the PA system. This is particularly\nchallenging any noise abatement notices that may have been relevant for railway stations with wildly varying\n。 served; density of nearby housing and residents; background sound levels usually caused by trains.\nacoustic platform possessions and isolations needed for The maximum volume of the PA will need to be\nenvironment” installation and maintenance; feedback from users _ limited as some trains can be very loud and it may\non the existing system, such as areas of poor not be possible to announce over the top of the\ncoverage along with any customer complaints; train noise for health and safety reasons. Storing\nglass shelters, as these can attenuate sound by and transmitting an announcement when the\napproximately 25dB. background noise is lower is something that can\n; be considered.\nCoverage in general should be provided in all\nareas where most customers stand when waiting Dividing a station public address system into\nfor information on train services or disruption, defined zones can be helpful, particularly where\nand in all weather conditions. In Europe the limiting the noise to neighbours is required with\nregulations for Persons with Reduced Mobility only those zones selected being addressed. The\n(PRM) require PA coverage in all public areas of output from the amplifier can be automatically\nthe station and the UK Equality Act 2010 requires routed to the chosen zone or zones either by\nall station operators to take reasonable steps to using zone selection keys on a controller, or by a\nensure they do not discriminate against people stored speech system announcing the timetable\nwith reduced mobility. to only areas requiring the message. Simultaneous\nbut different announcements can be made to\n12",
      "source_file": "15_Telecoms.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 13,
      "text": "IRSE News | Issue 271 | November 2020\nG Page 1 of 2\noes E\n15214 Ge9c REAR, Standard Class TRON On crime\n° - 45:18 Manchester Piccadilly > 15:29\nwv on\nerat Giese FRONT, Standard ceo on Tame\n45:26 Llandudno 4 On Time\n| | ret Chase FRONT, Standard Class REAR\ndifferent parts of the station and using male and Passenger (or Customer)\nfemale voices can help to distinguish between the Information Displays\nmessages but care must be taken to minimise the . . .\nover hearing between zones. Visual PIS/CIS are now common in many railways.\nThey generally originated with hand painted\nA PA system can be used to feed directly to boards but migrated to using revolving printed\nhearing aid users using a specially designed ‘flap’ displays installed at larger stations to increase\ninduction loop amplifier and associated cable the display content, either operated manually\nsystem. The engineering and design of induction or using card reading machines. In the 1980s\nloops is complex and is environment dependent processor systems controlling monochrome\n— steel-constructed buildings can make it Cathode Ray Tube (CRT) displays started to\nparticularly difficult. be installed at smaller stations with ‘next train’\nBackground music can be used to fill the ‘silence’ Platform displays and departure/arrival summary\nbetween announcements and is sometimes used displays. Flap displays were inflexible and required\nat less busy stations. If provided this should not extensive ‘re-flapping’ when timetable changes\nbe loud enough to be obtrusive, but should be were carried out. LCD displays originally using\nadjusted so that it adds to the ambiance of the a 7x5 dot matrix often replaced flap displays to\n\n“Dublic Address environment. Music should never be so loud that ”increase flexibility although often with a poorer\n\ncustomers cannot communicate, or that advice display readability. LED displays then replaced\n\nVoice Alarm given by station staff cannot be heard. LCD at larger ‘main board’ displays and CRT\n\n(PAVA) sound . platform displays to improve both readability and\n\nft Voice alarm systems reliability. It is easier to read upper- and lower-\nsys es Train operators have a duty to ensure the safety of | Case than all upper- case, which is why road signs\ndesigned to customers at all times. When an emergency such in most countries use upper- and lower- case.\nwarn of danger as a fire or a security threat arises or whenever Displays should therefore be able to display\nnormally require there is the need to evacuate a station this can information ideally in the train company font with\nre be best achieved by a speech announcement, both upper- and lower-case text with proper\n\nspecial fire-safe rather than bells or sounders. The spoken word descenders, e.g. for “y\" and “g’.\n\nWiring can be live’ from a microphone, or pre-recorded. —_p|S/CIS systems consist of either a central or local\nStored announcements can be initiated by the processor and controller for the displays, together\nstation's or an adjacent building's fire alarm with power supplies and communication links to\ninstallation. When the alarm is activated the and from the displays. These links have migrated\nsound system automatically broadcasts the stored “from RS422/RS232 to Ethernet and Wi-Fi, with\nemergency message. systems now controlled from real time signalling\nPublic Address Voice Alarm (PAVA) sound systems control systems (usually the train describer)\ndesigned to warn of danger normally require and linked to comprehensive train timetable\nspecial fire-safe wiring and complete building systems. Systems can also provide real time train\ncoverage with approved loudspeakers sited to information to third party mobile applications for\ncover all public and staff areas. The provision of public use. Unfortunately, when train disruption is\nauxiliary power sources, so that in the event of severe and with no trains moving it can be difficult\nan AC mains supply failure, the sound system can to display train information at just the time it is\ncontinue to operate, will be required. In addition really required. It is hoped that traffic management\nequipment redundancy, self-checking alarms, systems may be able to provide accurate\nsound level and intelligibility requirements should Predictive information for displays in the future.\nbe considered.\n\n13",
      "source_file": "15_Telecoms.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 14,
      "text": "IRSE News| Issue 271 | November 2020\n€ Is *\neS _ Se. SP Oe eS\nYork station with CCTV When designing and siting displays on stations equipment options, data storage, component\ncoverage of all train the structure gauge for the railway should be miniaturisation, wireless communications, and\nmovements. This camera = complied with and take into account signal video image analysis. A CCTV system for a\noa0ca ng live, see sighting along with installation and maintenance railway may be part of a multi-layered security\nPhoto Network Rail. access, cable containment and power supply system. Undertaking a comprehensive needs\nMost cameras are now requirements. Listed building consent may be assessment at the start of any project helps to\nfixed. required, and if replacing an existing system ensure all required functionality is identified.\nfeedback from users of the system should be Clear requirements, a comprehensive site survey,\nobtained and analysed together with any customer compliance with legislation and proper equipment\ncomplaints. The footfall where most people selection will all contribute to the design of a\n“Involving human stand when waiting for a service in all weather good CCTV system.\n。 ,。 conditions should be taken into account when .\nfactors specialists designing the system, together with requirements In order to properly implement a CCl system\nand local for persons with reduced mobility. Future train and to highlight any engineering, operational,\nhelp to identify Involving human factors specialists and local a knowledgeable multidisciplinary team with\nthe location operators will help to identify the location of the right level of expertise. This could include\n. displays to maximise their effectiveness. Double operators, security personnel, power and\nof displays to sided displays should be used where ever possible —_ structural engineers to identify key functional and\nmaximise their to maximise the network capability of the system. operational needs and restrictions. Functional\neffectiveness” Some operators use scrolling displays, but requirements will include determining the area of\nthese can be difficult for persons with sight and surveillance, locations or assets that will benefit\ncomprehension issues to read and understand. from CCTV surveillance. Operational requirements\nDisplays which change but hold messages fixed will define what information and detail the\nfor a short time are better. system will be expected to provide. Factors to\n. . _. consider may include the viewing scope of the\nClosed-circuit television area, the ability to recognise someone walking\nClosed-circuit television (CCTV) systems provide through a barrier or door, and to read vehicle\nsurveillance capabilities to improve safety, assist registration numbers.\nrailway and station operation, and to combat There are four key requirements that need to be\ncrime and terrorism. A CCTV system links a nae ;\nmet: camera to a video monitor or receiving system covered in the initial design.\n\nIt is important using a direct transmission system. This differs 。 Functional — to define the precise area of\nthat CCTV from broadcast television where the signal is camera coverage such as surveillance of\nsystems provide transmitted over the air and viewed on screen. It perimeters, storage areas, key assets and\nquality video is important that CCTV systems provide quality entrances and exits.\nimages in an ee Images In an easily re- playable form to 。 Operational - to define the capabilities of the\n\nrd parties, such as law enforcement agencies. CCTV system components that will provide\neasily re-playable This can be critical should there bea need to use the expected information under all operating\nform’ the images as evidence of a crime. This article conditions. These will include security, day and\ndoes not cover driver only operation or level night operation, lighting, weather conditions,\ncrossing CCTV systems. vibration and temperature changes.\nCCTV technology is improving all the time with 。 Infrastructure — to include installation\nbetter performance in areas such as digital constraints for installing or accessing fibre\n14",
      "source_file": "15_Telecoms.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 15,
      "text": "IRSE News | Issue 271 | November 2020\nand /or copper data cables, wireless networks | can cause power fluctuations and may require\naccess, power, listed building constraints, and larger conductor sizes to reduce voltage drop.\npeople with reduced mobility. Authorisation Therefore, it is advisable to locate the power\nfor works on listed buildings may be required source close to the CCTV control equipment\nbefore any works commence. and to include an Uninterruptible Power Supply\n\n。 Video retention — to define the video retention (UPS) to protect equipment and ensure the power\nand storage needs. These should take into supply is stable.\naccount security and data protection, which Older CCTV systems generally used co-axial\nmay be subject to legislation. cable to connect cameras to the control hub,\n“Nowadays video Whenever possible, CCTV systems should be but nowadays video transmission for CCTV is\ntransmission for included in the planning and design stage of normally via unshielded twisted pair (UTP) or fibre\nany new facility, building or asset to ensure cable. Many problems with video image quality\nCCTV is normally all necessary infrastructure requirements for can be avoided by selecting the appropriate\nvia unshielded the CCTV are adequately incorporated into transmission media and following manufacturer's\ntwisted pair (UTP) the overall design. Factors to consider in the recommended installation techniques and\nor fibre cable” detailed design of any CCTV system include: the procedures. As CCTV technology has evolved,\nnumber and locations of cameras including lens video transmission has progressed from analogue\nselection, cabling and cable containment together to digital equipment, often with an Internet\nwith fixing arrangements; lighting levels for all Protocol (IP) capability to transmit compressed\nproposed camera coverage areas; unhindered video as digital data. Some railways now mandate\nbut secure camera access for both installation all new CCTV systems will use IP, but analogue\nand maintenance; no interference or blocking of systems using digital recording are still used\nsignal sighting; power requirements, including by some railways as IP CCTV systems can be\nappropriate separation of power and data complex to configure.\ncables to comply with standards and reduction IP CCTV solutions, while complicated, do offer\nof interference. more facilities and can be integrated seamlessly\nInadequate power can be a problem with CCTV with other control systems to deliver integrated\nequipment and can often cause interference. centralised control and monitoring. Data from\nProper system performance requires a clean and other security devices and from business systems\nreliable power source. Therefore, the design may can be linked with IP CCTV Images and recordings\nneed to specify power conditioning or backups, while cameras can be easily controlled and\nto ensure the quality of the video across the monitored from web browsers.\nentire system is unaffected by primary power CCTV systems regularly need to be checked\nsource disruption. Placing low-voltage power to meet changing operational requirements\nOverview diagram components near high-voltage lines can induce and equipment obsolescence so the ability\nof a typical station currents in the low-voltage system, presenting to easily incorporate hardware and software\nCCTV system. hazards. A power source located too far away updates should be considered. Using existing\nCCTV workstations\nlocal or remote\nPan, tilt, Zoom Ld Ld\nme\nTo Station Management\nwa and other systems\n\"we\nRouter\nPi Firewall\nCCTV\nCz control\nsystem\nCia Video\nPower over storage\nEthernet\nroe\nFixed cameras\n15",
      "source_file": "15_Telecoms.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 16,
      "text": "IRSE News| Issue 271 | November 2020\naS, ‘>> iid \\o-\na os\nTM. ~~ =,\ni 、\n- fa >»\n. . \"on | . .\n— a. « Time Destinatic\nClockwise from left: CCTV infrastructure such as cameras, housings Cameras\nA CCTV camera and and cable runs may reduce costs, but CCTV CCTV cameras are either fixed or pan-tilt-zoom\nloudspeaker sharing a equipment is improving all the time, as the (PTZ). Fixed cameras are intended to constantly\nlamppost. capabilities of CCTV components advances. view a single scene, while PTZ cameras are motor\nPhoto AN Hurst. Replaci ld i t and infrastruct 1 ‘ . .\n| | | eplacing old equipment ana infrastructure May driven and can pan left or right, tilt up or down,\nFixed camera installation —_— therefore improve system performance and bea and zoom in or out to instantly customise the\nh cimitar camera te chat more cost-effective solution. view as needed. Most systems nowadays use fixed\nin the first photo, but Station Management Systems (SMS) are typically cameras to view and record complete areas as\nmounted ona passenger deployed at large stations or in a group of stations © PTZ cameras require full time operators.\ndisplay sign. along a route managed from a central location. An Ingress Protection (also known as IP and not\nThe SMS is the focal point for station operations to be confused with Internet Protocol) rating\nand provides the operator with a user-friendly, is to protect equipment from attack from solid\nfunctional environment from which to monitor foreign objects e.g. stone throwing, and from\nand control all station systems. The SMS should harmful effects due to the ingress of water. Ingress\ngather information from many sources and — Protection IP always has a number. So cameras\nMost systems provide control of the various individual station should typically have an IP rating of IP34 when\nd systems, such as CCTV, public address, customer seq internally and IP65 for external cameras. The\nnowadays use , , 。\nfixed cameras to Information and alarm systems. Integrating the “IK” rating or code is an international standard\ncontrol and operation of the CCTV system in a to define the level of resistance of enclosures to\nview and record clear, consistent and integrated format will help to “mechanical impacts. Cameras are recommended\ncomplete areas provide efficient and cost effective management to have an IK vandalism rating of IK10, along with\nPTZ of the station. The SMS will usually be interfaced a typical operating temperature range of -15C\nas cameras with a fire alarm system so that in the event of an to 45C external to the housing. This may need\nrequire full time alarm activation, cameras covering the area will to be revised depending on local conditions.\noperators” automatically be displayed to the operator. The minimum resolution of cameras in a railway\nA CCTV system is built up from a number of system is typically 720 pixels, and systems with\ndifferent components. 1080p resolution or higher are often provided.\n16",
      "source_file": "15_Telecoms.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 17,
      "text": "IRSE News | Issue 271 | November 2020\n“ Despite increasing use of IP network cameras, essential that the system be capable of retaining\nPower over analogue cameras still exist in many older systems ”data in accordance with a company’s policies\nEthernet (PoE) IP — since there may be a high cost involved in and procedures, together with data protection\ncameras will not upgrading and converting to a new transmission and CCTV legislation. EMC requirements will\n. network. Analogue cameras can also transmit need to be considered, such as defined in\ngenerally require high definition pictures, making them appropriate standard EN 50121-4.\na local power for various surveillance needs. These cameras\nsupply” also have cyber security advantages because Camera lenses |\nthe cable connections require a physical access A lens has components and characteristics that\nfor them to be breached or damaged. They are determine its capabilities. These include the\neasier to configure, but will not provide as many focal length, type of aperture and focus control.\nfeatures as IP systems. The focal length and size of the image sensor\ndetermine the angle from which the lens accepts\nPower over Ethernet (PoE) IP cameras will not light to focus on the image sensor. Any lens with\ngenerally require a local power supply but must a focal length greater than the standard lens is a\nbe able to operate in the railway environment. PoE telephoto lens, while a lens with a focal length less\nextenders will need to provide sufficient power than the standard lens is a wide-angle lens.\nto meet the camera's operational requirements.\nConnections to individual cameras can be via Camera lenses shall normally be fitted with either\nwireless such as Wi-Fi, but a local power supply an auto-iris fixed lens, vari-focal lens or zoom\nwill be required and the wireless connections lens. Remote vari-focus, zoom, controlled back\nshould be encrypted for security. Possible focus and remote camera alignment will all\ninterference with other Wi-Fi channels in the area contribute to efficient operation and maintenance\nshould be assessed. of the system, and will eliminate the need for\nNotices may Day/night cameras and low-light or night vision working at height to adjust the camera.\nbe required at cameras can be used to capture images in dark Cameras mounted on extendable or hinged posts\nlocations in environments. Low-light cameras are designed to ”will facilitate easy maintenance and minimise\nperform in some level of ambient lighting, such as ”working at height during both installation and\nareas of CCTV indoor conditions, station lighting, or a full moon maintenance, but no hinged or extendable\ncoverage to but are not intended for use in complete darkness. post should come close to any electric traction\ninform members __ Night vision cameras used in CCTV systems system or other hazards. Fixed camera mounts\nof the public that typically consist of near-infrared (NIR) and infrared ”with adjustable horizontal and vertical planes\n(IR) cameras with built-in IR illuminators and are will maximise operational effectiveness. Camera\nan area IS being designed to allow the viewing of night scenes. positions should be selected to enable routine\nMonitored and The IR light emitted can be at wavelengths that access (for cleaning and replacement) without the\nrecorded’ are invisible to the human eye. Some operational need for blocking train movements or isolating\nenvironments may require a thermal imaging overhead power. Individual and isolated columns\ncamera to detect situations even if conditions supporting lighting or cameras should be\nsuch as fog or smoke are encountered. These positioned to avoid creating obstructions to the\ndetect infrared or heat radiation that is invisible to | Movement of station users. The camera assembly,\nthe human eye. housing and sunshield should take account of\nthe effects of sunlight during the course of the\nThe most complex CCTV systems may day and also the seasons of the year in order to\nFrom left. Traditional incorporate hundreds of cameras and sensors maintain the viewing requirements of the system.\ncamera housing and a integrated into one overall security network.\ndome camera housing. With larger quantities of data being collected, it is\nae\n|\n4 .\n, 4 1 可 av\n(ate\n17",
      "source_file": "15_Telecoms.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 18,
      "text": "IRSE News| Issue 271 | November 2020\nNotices may be required at locations in areas and management of the system, especially if\nof CCTV coverage to inform members of the the information is consistent with details in the\npublic that an area is being monitored and asset register.\nRecorded recorded. These will need to be provided in Monitors may be required for public behaviour\ni hould accordance with national and local legislation, . os ,\nImages snou ; , and surveillance monitoring, for example at ticket\nictl such as the General Data Protection Regulation te li hiah f ificati\nbe strictly (GDPR) and the UK Data Protection Act1998, gate lines. so higher performance specifications\ncontrolled should be considered to enhance visibility\nt t CCTV workstation and monitors of the display. Public surveillance monitors\nOo preven To provide good picture quality, the minimum May require additional vandalism and ingress\ntampering or monitor resolution should be at least that of protection suitable for the location in which the\nunauthorised the cameras. Multiple camera images at original Monitor is being installed, such as a minimum\na high-resolution screen, so for example, a internal monitors.\n30\" 4K resolution monitor could display 4 x Control system\n15 1080p resolution cameras. The camera\nidentification should be easily available so the ONVIF (Open Network Video Interface Forum)\noperator knows where they are looking. Is an open industry forum for the interface of\n7 , physical IP-based security products. The ONVIF\nA bank of monitors to create a ‘video wall specification covers how IP products within video\nis commonplace in larger control centres. surveillance and other physical security areas\nThese can be programmed to periodically can communicate with each other. Therefore,\nchange the picture displayed on the monitors procuring CCTV systems in compliance with the\nto help relieve the boredom from seeing the ONVIF specification will assist interoperability\nsame scene all the time and to concentrate between network video products from different\nthe multitude of camera images on to a suppliers. ONVIF aims to provide standardisation\nsensible number of screens. A typical railway of communication between IP-based physical\n. CCTV control room could have 500 cameras security products to give interoperability\nExternal remote covering a route with about 50 monitors in regardless of the brand, and is open to all\naccess will also the video wall. companies and organisations. Using ONVIF\nneed security An ergonomic assessment of the operator's equipment will help with not becoming locked\nvia firewalls and workstation location should be undertaken in to any particular proprietary technical solution\ncompliance to determine the most appropriate size and devised by individual manufacturers.\n\n. in 。 。 | position. ens ne oe systems ha System security is important so access to the\nwith individua dusty, se een one Per om h system and any recorded images should be strictly\ncompany s an open srchitecture, will help with the controlled to prevent tampering or unauthorised\nsecurity policies” . viewing. This could be via electronic access\n\n¥P wor life ERPC me mv system and controls, including but not limited to passwords\nInteroperability WIN Olner systems. or encryption, to prevent unauthorised access\nAn agreed format for event reporting and to the building, system and recordings, with an\nalarms will be required and telemetry data from _—_ audit trail and record of who accessed the system\nall camera input channels with time/date and and when. Different levels of user privileges,\ncamera description will provide a consistent such as Administrator, User and Maintainer,\nformat to identify station, camera location and may be appropriate. Further information can\ncamera number. This will assist the operation be found in BSI document ‘Code of Practice\nA number of dome\ncameras providing\ncomprehensive\nmonitoring of a ticket ‘\nbarrier. \"Me\n4 a . £\n4 arn |\n上 * ok\n1 ee 一 . = —_— ke. \\ . . if\n{ | pico | re 二,一三 oe ~\n18",
      "source_file": "15_Telecoms.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 19,
      "text": "IRSE News | Issue 271 | November 2020\n7一\n。 1 if 4\n| \\ |\nAY\n; , Py SN 、 On) ¢ 4 \" : : \")\n- a 20 Wa =i ll | |\nTAN |\nr ‘AS ED ie sas! |\nOo ‘ 7 。\nAn historic clock at for Legal Admissibility of Information Stored Video storage\nLondon Victoria station, i ' i , ,\nFendon、 ictoria station: Electronically’ (BIPOO08) or from local Police The system will need to store recordings for all\nvery modern speaker Crime Reduction Officers. connected cameras for a time period of typically\narrays. External remote access will also need security 31 days so as to assist with any post incident\nPhoto Institute of Sound, via firewalls and compliance with individual investigations. All video data once past the stated\nCN en ae company’s security policies. The system should time period should be automatically deleted\n9 prevent transmitted images from being corrupted —_ unless marked for retention. A facility for local\nor modified in transit. Where the proposed system OF remote users to mark specific pictures or\ndoes not provide the specified security functions, | Sequences identified as relevant to an investigation\nthe network or transmission medium used could for retention should be considered. To optimise\n“Accurate clocks be employed to provide equivalent security. storage capacity, ag reement from stakeholders\n; should be obtained as to the circumstances in\nare important Video analytics such as the detection of unusual which images will be recorded for review and\nfor a smooth- movement in a normally static picture may be at what resolution, together with date and time\nrunnina railway” specified in the design, as these can further stamping requirements. Care may need to be\ng y improve the overall effectiveness of the CCTV taken that any video compression does not\nsecurity solution. Video analytics monitor the compromise video quality.\nvideo streams in near real-time and automatically\ncreate security alerts when recognising specific Clocks\ntypes of events and activities. Video analytics Accurate clocks are important for a smooth-\ncan also be used for analysing historical data running railway, and telecoms engineers in\n“The positioning to identify specific incidents and patterns many railway companies have provided clock\nof clocks needs (forensic analysis). systems for many years. Originally they were\nto take into Using a video analytics system to automatically provided using centrally located master clocks\n2 monitor camera video feeds and providing alerts communicating with slave clocks via telecoms\naccount similar for events of interest enables efficiency and cost cables. More recently clocks are Global Navigation\ncriteria to PA, reductions by reducing the need for human Satellite System (GNSS) controlled, so just need\nCIS and CCTV concentration and helps operators to notice and a power supply and possibly an external antenna\nrespond to threats sooner. Typical uses are for to receive the satellite signal. The positioning\nsystems with perimeter protection intrusion management, of clocks needs to take into account similar\nregards to height, crowd management and situation awareness. criteria to PA, CIS and CCTV systems with regards\nThey can also be used for ‘footfall’ counting to to height, maintenance and not obstructing\nmaintenance and . , . . signal sighting\n。 assist the commercialisation of retail space on ;\nnot obstructing stations and passenger loading on trains. Internet connection for trains\nsignal sighting On initial installation, consideration should be Most train passengers now have an expectation\ngiven to fit spare switching, optical and Cat 5E/6 that a connection to the internet will be available\ncopper cable (where appropriate) for at least an on trains. With an on-board internet connection,\nadditional 10 per cent spare capacity in agreement real time ticket sales via debit/credit card are\nwith stakeholders’ policy. This will allow expansion possible, along with seat occupancy reporting\nfor future requirements. and real time seat reservations. Communications\n19",
      "source_file": "15_Telecoms.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 20,
      "text": "IRSE News| Issue 271 | November 2020\nand preventative maintenance are also key to Internet connectivity can be improved by\nenhancing operational efficiency. This could providing digital on-board repeaters (D-OBR). A\ninclude data to monitor and manage the train, D-OBR is an active multi-band, multi-operator\nand if adequate bandwidth is available real time repeater which is designed to provide coverage\nforward and rear facing CCTV cameras for track within train vehicles by amplifying and re-radiating\nand signalling maintenance. While GSM-R will (repeating) the external 2G, 3G and 4G/LTE mobile\nprovide the wireless connection for ERTMS / operator signals through dedicated ceiling -\n. CBTC movement authority, it does not have mounted antennas. A D-OBR will provide Internet\nAntennas are sufficient capacity for train Wi-Fi applications access to mobile phones without a Wi-Fi facility;\none of the most and use of public 4G or 5G LTE networks is more however, most passengers now expect Wi-Fi\ncritical items usual for provision of the internet connection. 2 be available, although some train operators\n. The replacement for GSM-R, known as FRMCS ave ‘quiet coaches ' to restrict nuisance use by\nto deliver good (Future Radio Mobile Communication System), some travellers who can adversely impact the\nconnectivity on is planned to provide for all train connectivity Journey EXPErIENnce.\nand off the train” requirements, including business and passenger One or more external mounted wideband\ncommunications. antennas can be provided on trains and\nTo improve or provide an internet connection on connected to a communications device known\nra , as a Mobile Communications Gateway (MCG).\ntrains it is likely to require equipment both on the A wideband antenna capable of receiving a\ninfrastructure and train. Like many applications, wide range of Mobile Network Operator (MNO)\nsuch as operational voice and ETCS/CBTC, this services and 2.5GHz or 5GHz point to point Wi-Fi\nwill require close working between rolling stock connections at stations can be provided, with\nand S&T engineers, and for each to have an 6GHz Wi-Fi systems also being introduced. Care\nappreciation of the engineering principles for both — will be needed on the location of the wideband\ninfrastructure and trains. train antennae so they do not interfere with the\nBy their construction, train vehicles create train GSM-R antenna.\nattenuation which degrades the usable signal Antennae are one of the most critical items to\nin the train. The degree of attenuation varies deliver good connectivity on and off the train,\nbetween 5 to 35dB depending on the rail vehicle and creating an efficient antenna solution will\nprofile and a loss of 3dB results in halving the do much to improve system efficiency. Many of\navailable power. The on-train user experience the radio frequency problems associated with\ncan vary as a result of the differing levels of signal antennae also stem from poor fitment of feeder\nattenuation due to a significant mix of different cables, which should be installed in accordance\ndevices, with an increasing trend towards the use with the manufacturer's instructions.\nof multiband smartphones and tablets. Multiband The MCG (or number of MCGs) provides ‘a\ndevices incorporate wider band receivers which cloud’ of connectivity to the train via a number\nweaken the performance for any one single band, —_ of MNO services and external Wi-Fi connections\nand coupled with multiband antennas becoming aggregated together. Fixed Wi-Fi at stations\nintegrated into the handsets themselves makes or trackside is a good way of enhancing the\nreception on-board trains even more challenging. —_ connectivity as this is within the control of the rail\nThere is a significant cost involved in the industry. At terminal stations it can provide a good\nSr Passengers on design and implementation of additional public link to a train and this is where many people open\nthat a e onnection to the Operator radio sites along rail routes and careful their device and ‘log on’. Wi-Fi systems are ‘licence\ninternet will be available consideration is required for any additional public free’ so care may need to be taken to prevent\non trains. radio coverage to avoid signal interference with interference from other Wi-Fi systems, which\nPhoto Icomera. GSM-R and FRMCS. could be located away from the railway.\n’ aa一\n-, e\n: e\n~ | [\n一 |\nPp \\\n20",
      "source_file": "15_Telecoms.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 21,
      "text": "IRSE News | Issue 271 | November 2020\nThe connectivity to the MCG may also include satellite Railway telecoms is managed in a different way to a public\nconnections, although some systems can be troubled by higher — telephone network. An example would be that railway operators\nlatency times to and from a moving train. A train compares expect any engineering or station works that will disrupt the\nunfavourably with a more stable platform like an aircraft, train service, to be pre-planned, agreed with them and to be\nwhich is how an internet connection is provided in the air told when a facility is restored. Similarly, if a significant fault\nindustry. Satellite communications will not work in tunnels or occurs it has to be investigated to ascertain the root cause so\ndeep cuttings. that, if necessary, steps can be taken to prevent recurrence.\nor , Such situations demand telecommunication requirements that\nAn acceptable customer service in order to support email and «eg: ; , 。 :\n。 , - , , may be difficult to obtain from the service provided by a public\nsocial media browsing can be provided with a data bandwidth telecom operator\nas low as a few hundred kbits/s, but obviously the more P\nbandwidth the better. Limiting each customer to a maximum A railway telecom engineer is expected to understand the rules\nwill help to provide an acceptable service to all customers and procedures employed on the railway so that when they are\non the train. In order to provide a reliable non-discriminatory designing systems to support the operation, they can define\nservice, certain high bandwidth applications, such as video and what functionality is required and also understand the safety\naudio streaming services or peer-to-peer file sharing, may need and performance implications of any failures. So if an off the\nfiltering and restricting. On train bandwidth requirements will shelf piece of equipment is used, the engineer needs to be sure\nvary depending on the number of active Wi-Fi customers and that it is fit for the purpose intended, for example, it provides\nmay increase as passengers become aware of Wi-Fi availability, sufficient protection to be used in places of high induced\ntherefore additional bandwidth should always be planned for. voltages or vibration.\nFinal thoughts If it is decided to use a public telephone system (fixed or\nSo, given all that has been covered in both parts of the back mobile) to support a railway application, then the possible\n. . shortcomings of using the standard facilities should be\nto basics of railway telecoms, what makes railway telecoms ; ; 。\n。 , . considered. For instance, the radio coverage may change over\ndifferent from providing a public telecoms network? ; ,\ntime and not cover areas of the track. A public operator may not\nMany pieces of equipment can be used for railway and public be able to provide diversity between two circuits for the last few\ntelecommunications e.g. cables, transmission and exchange miles at a reasonable cost. The public service may be turned\nequipment. There are pieces of equipment which are specific off for maintenance overnight and at short notice. If these\nto the railway such as signalling centre concentrators and shortcomings are acceptable then the use of public services\nGSM-R cab radios. These items are normally developed to can provide a cost-effective solution for some railways.\nprovide a feature which is unique to the railway — e.g. using the , ,\n. There may be a temptation for some governments and railway\nGSM-R frequency bands or needing to be designed to prevent a , , ,\n, , 。 - , , authorities to ‘sell off’ the railway telecoms assets and resource\nan activity which may cause risk, such as two drivers speaking , , .\n, , , to raise finance or for commercial purposes. This has occurred\nto a signaller at the same time. The equipment also has to ; ;\n; , ,, , several times across the world. However, in nearly every\noperate correctly in the railway environment which is normally ; . .\n. . . example, the railway authority has had to buy back or re-install\nharsher than an office environment. Factors to take into , , ,\n\n, . mer . . its own telecoms infrastructure, plus rebuilding a telecoms\naccount include Electromagnetic Compatibility (EMC), vibration, : 。 -\ntemperature, and humidity workforce. Telecoms is a vital part of railways operations and\n\n‘ , with the increasing use of digital signalling systems and the\ninternet of things, it is becoming ever more important.\nAbout the authors ...\nPaul Darlington CEng, FIET, FIRSE, joined the S&T department = Trevor Foulkes MA, CEng, FIRSE joined British Rail in 1979 as\nof the London Midland Region of British Rail in 1975 as a a sponsored management trainee engineer. After graduating\ntrainee telecoms technician. After maintaining telephone from Fitzwilliam College, Cambridge his training was based\nexchanges, he became an instructor at the regional S&T in the S&T department of the Western Region, followed\ntraining centre. In the 1980s he moved to the telecoms by a series of roles in the design of systems and the\nproject office in Birmingham and was involved in designing management of technicians and engineers.\nand implementing CIS, CCTV, SPT and radio systems. In 1994 Trevor joined Railtrack and specified telecoms\nMoving to Railtrack in 1994 Paul led the asset management works for the south and west of the country after which\nof telecoms for the north west of England and became he joined HQ and set national standards for equipment.\nengineering manager for all disciplines. In 2008 he moved He then joined the West Coast Main Line (WCML)\nto London as head of telecoms engineering for Network resignalling team in 1996.\nRail and finished his full-time career as route asset manager In 2000, he led the business case development for the\nsignalling in Manchester. Paul also led the work to enhance\n, 。 。 , telecoms network, now known as the Fixed Telecom\nthe Network Rail network with IP, which led to the creation , , ,\n, , Network (FTN), before becoming the design authority for\nof Network Rail Telecoms (NRT) and the Network Rail FTNx\n. the FTN and GSM-R systems. In 2012, he was seconded to\nIP network. He also chaired the safety approval panel for , :\nthe High Speed 2 project to develop the control, command\nthe GSM-R Network. , , , ,\n& signal engineering design. He also led the Spectrum\nRetiring in 2012, today Paul is an engineering writer, managing Group of the UIC project developing the next generation of\neditor for IRSE News and also interviews applicants for operational radio to replace GSM-R.\nprofessional registration with the IET and IRSE. Trevor retired in 2015 and is chair of the London &\nSouth-East Section of the IRSE and has assisted with the\ntelecoms aspects of the new Certificate in Railway Control\nEngineering Fundamentals (module A).\n21",
      "source_file": "15_Telecoms.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    }
  ]
}