{
  "doc_id": "53b497e2-88d8-4cf3-871e-bc6539dbac3b",
  "pages": [
    {
      "page_number": 1,
      "text": "Institution of Railway Signal Engineers\nIn the first of a planned series of ‘back to basics’ subjects Operational requirements for\non train control and communications, this article train control systems\nsummarises the fundamental requirements for a train Th t ll dt tth ds of\ncontrol system. These requirements will be familiar to © system Win nee Oo meen me NEES ©\nexperienced signalling engineers, but are recommended operators in terms of\nreading for anyone new to railway control and 。 permitted train movements (such as normal running;\ncommunications and for IRSE members preparing to joining/ splitting; platform sharing, shunting);\ntake the IRSE Exam. 。 permitted routing of trains;\nThe requirements were originally set out in the IRSE Signalling * Capacity provision and utilisation;\nPhilosophy Review (2001) and have subsequently been 。 and flexibility of operations.\nreviewed and revised a number of times. They are available in Th t tribute to efficient\nfull via the IRSE website at irse.info/ex3ous. © system may aiso contribute to emeient resource\nmanagement, such as efficiency in traction energy\nThe requirements are not mandated by the IRSE, although consumption, and minimising wear and tear on the track.\ncontrol system them as essential for any train If, in addressing requirements for safety, the proposed design\nconstrains the operability of the railway, the impact of this will\nThe word ‘signalling’ is defined by the IRSE as all the equipment, need to be assessed and minimised (but without compromising\nelectrical, mechanical or otherwise, methods, regulations and acceptable levels of safety, of course).\nprinciples whereby the movement of railway or other traffic is In order to deliver the timetabled train service, the specification\ncontrolled. Throughout the requirements, and in this article, the , ; sas as\nMey ai ni and attainment of appropriate levels of reliability and availability\nphrase “train control system” includes the people, procedures , , , ,\nand technology used to signal trains; and where the single word are essential. Reliability and availability also contribute to overall\n” We ; Heya 0\" levels of system safety. Maintainability is essential in order to\nsystem” is used it means the “train control system”. Where or : ,\n, , , , ensure that the specified levels of reliability and safety continue\nthe phrase “signalling system” is used, this means the part of tob tth hout th ice life of th t\nthe train control system which is implemented by means of 0 DE MET MPOUgTIOUE Me service lire ore system.\ntechnology, which could be both infrastructure-based and To achieve required levels of overall availability, the provision\ntrain-borne. The requirements are equally applicable whatever of degraded modes of operation is desirable. However, human\nform of train control system (as defined above) is used to intervention as a means of safely controlling train movements\ncontrol train movements. Accordingly, they are written at a under failure conditions (e.g. signallers authorising trains to pass\nhigh level, with the intention that users interpret and apply the signals at danger, manual on-site operation of points) entails\nrequirements through the specific method of train control that significantly higher risk and is therefore not the preferred means\nis proposed for a railway. of meeting this requirement. Transitions to and from degraded\nThe requirements are in three sections. The first deals modes of operation will ness to timely op Tsk 60 oy\nwith operational requirements, the second with functional ace degradation 3 we tie timely and safe mechanisms\nsafety requirements, and the third addresses supporting or recovery to normal operation.\nsafety requirements.\n16",
      "source_file": "6_Fundamental requirements for a train control system.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 2,
      "text": "IRSE News | Issue 259 | October 2019\n. ,\nSee . dia 本 _ _ 7 - woo\n| r . — 7 * —ia\nih po ows ° ,\n| | | ne\n| a , -\n=) | 一\n. 7 ne ent | 上 TM : coo , - 一-人\n~二- wee 7 oS ee .\noes it ‘ | x | at ie, 4\nTrain control has a long history but is evolving rapidly as technological change offers new\nalternatives to manage the safe movement of trains to deliver the optimum experience for\nrailway passengers and freight users. There is however a series of underpinning requirements\nfor any train control system. Photo Shutterstock/hxdyl.\nFunctional safety requirements for The train driver (or the automatic train operation sub-\ntrain control systems system [ATO]) will require unambiguous, consistent and\n, , , , timely information that enables safe control of the train.\nBefore a train is given authority to move along a section of , , .\n, This may include:\nline, the section of line needs to be proved to be secure (see\nbelow) and clear of other traffic, to prevent derailments and 。 proceed/stop information;\ncollisions, and to avoid conflict with movement authorities e the provision of warning information regarding the\ngiven for other trains. approach to the end of the movement authority or a section\nExceptions to this are circumstances where a train is permitted of lower speed line, to enable the train to brake safely;\nto enter an occupied section of line, such as for platform 。 the provision of speed, routing, gradient, braking\nsharing, coupling of trains, permissive working, and shunting. capability information.\nWhere the train is stationary at a station, depot or siding, In addition, data entry sub-systems may be required in order to\nactivities such as train preparation, loading, unloading, closing input train parameters that are relevant to the safe operation of\ndoors must also be completed before the train is moved. the train control system (e.g. weight, length, braking capability).\nHowever, these activities are not normally regarded as part of Sufficient space will be required between following trains\nthe functionality of the train control system. to allow each train to brake to a stand safely; this is usually\nThe term “secure” (see above) refers to a limited set of safety calculated on the assumption that the train ahead is stationary.\nrequirements, primarily relating to the position and locking Suitable control measures will be required in order to prevent\nof points, and the routing of other trains. Signalling systems and/or mitigate the consequences of a train:\ndo not usually prove that the line is clear of all obstructions, a\nor that the gauge is correct and the track is physically stable, * passing the end point of its movement authority;\nso other control measures may need to be considered to 。 exceeding the maximum permitted speed;\nmanage these risks. 。 moving without authorisation.\nWhen authority to move along a section of the line has been Examples of technical solutions for these include overlaps, train\ngiven, the security of the line needs to be maintained for the protection/warning systems, flank protection, approach control/\nmovement until the complete train has: release of signals, provision of trap points and speed signs.\nd cl fth ti f line: It may also include other measures, e.g. driver competence,\n* Passed ¢ car ore secon ° Ine, or provision of information to drivers and operating rules.\n。 the authority has been rescinded (withdrawn) and the train\nhas come to a stand: or Protection ie be requires cr re public and trains at we\n; ; aL ; crossings, although not all level crossings are necessarily\nee ne oe tn ns 出 Ta lon protected by the signalling system itself (in simple cases an\nficient t t tand safely bef 9 th independent means of protection may be adequate based on\nsu Ot the cect ° ort lin ss 本 机 © a crore me risk). The operation of a level crossing will need to minimise the\nnae the section of line over which authority to move road closure time, otherwise this could lead to crossing misuse\nad been given. by pedestrians and road vehicle drivers.\nIn some signalling systems sectional route release is used,\nwhereby parts of a section of line are released progressively Trains, worksites and workers will need to be protected during\nwhen the train has passed clear, to facilitate earlier setting engineering work. This could include:\nof other routes.\n17",
      "source_file": "6_Fundamental requirements for a train control system.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 3,
      "text": "IRSE News | Issue 259 | October 2019\n。 facilities for controlling the access of trains to sections of The compatibility of the operating rules with the rest of the\nline where work is taking place or where safety has been train control system (and their completeness) is essential for\nreduced as a result of engineering work; the safe operation of the railway under normal, degraded and\n。 ensuring that the section of line is clear of obstructions (e.g. emergency conditions.\nengineering vehicles) when work is complete and before Even though the system may be highly automated, there will\ntrains are allowed to run over it; always be a measure of dependence on human interaction,\n。 restricting the speed of trains to help protect track workers for instance during degraded mode operation or during\nor because of the condition of the track; maintenance. Appropriate allocation of functions between the\n; , , ; ; control system to make it easy for operators and maintainers\nIn order to provide a safe and efficient railway the signaller , , , -\n. . . . . , to perform their actions safely, is vital. The human factors will\nwill require unambiguous, consistent and timely information, .\nigs nee need to be addressed to help provide a safe and easy system to\nand suitable control facilities, to enable the safe authorisation are\n, , operate, both for operators and maintainers.\nof train movements (the term signaller also include other\npersonnel who may have responsibility for authorising train Modern signalling systems usually revert to a safe state, such\nmovements). This includes the provision of information as signals automatically restoring to “stop”, although this may\nrequired under failure and degraded mode conditions, as well not always be necessary or desirable (and indeed mechanical\nas for normal operations. Ancillary information systems such signalling systems do not generally do this). Designing the\nas train describers, critical fault alarms and data entry systems system so that failures and faults are self-revealing to operators\nmay also be required. When designing the signaller interface and maintainers will aid prompt and safe rectification, and will\nsystems, human factors assessments will contribute to safety help to avoid situations where a fault is latent (hidden) and does\nand efficiency. not reveal itself until some other event occurs.\nFacilities for communication between signallers and others Unsafe interactions of the system with other railway systems\nwill be required, for both normal operation and degraded/ and equipment need to be avoided. This includes both\nemergency working. This includes communication with: interactions where there is an intentional interface with other\n; ; systems and equipment, such as other railway infrastructure\n。 train drivers; , , , , :\nand trains; and interaction where there is no interface, such as\n。 signallers in neighbouring control centres; electromagnetic interference. Unwanted external influences\n。 train operators and route controllers; that could adversely affect the safety and availability of the\n。 level crossing users; system include:\n。 emergency services. 。 environmental/ climatic effects;\nThe nature of the communications systems will need to 。 cyber-attacks on software-based subsystems;\nbe appropriate for the purposes required, for both normal 。 vandalism:\noperations and failure/degraded mode situations. 。 unwanted electrical/radio interactions with non-\nA means will be required for preventing trains from being routed railway systems.\nonto a section of line with which they are not compatible. Problems can occur when introducing new rolling stock on\nSituations where this requirement could apply include: routes with older signalling systems, which may not be immune\n。 incompatibilities of gauge between track and train; to interference generated by new trains. Introducing new rolling\nincompatible traction | t for the train: stock in a controlled manner will facilitate early identification\nCompatible traction SUPPly systems Tor te train, and rectification of problems not addressed at the design stage.\n。 incompatible train-borne train control sub-systems;\nae , , Systems that are designed so far as possible to prevent the\n。 restrictions on access to tunnels for certain types of trains; wap: , . ,\n~~ possibility of inadvertent errors during maintenance and repair\n* restrictions on specific train types being permitted on work, and which incorporate diagnostic systems for monitoring\nroutes, adjacent lines etc, at the same time, such as the health of the equipment, will contribute to its continuing\nhazardous freight and passenger trains. safe operation and minimise the risk of introducing undue risk\nIn order to instruct a train to stop in an emergency, appropriate to either the operational railway or the personnel carrying out\nfacilities will be required. This could be met by functionality the work. These considerations may have implications for e.g.\nwithin the signalling system itself to enable a movement the design of equipment and its physical location.\nauthority to be withdrawn, or by the use of an alternative/ Personnel who design, build, test, commission, operate and\nindependent means such as radio communication with the nar ,\n, . . maintain the signalling system, or in any other way form part\ndriver. The speed and reliability with which a message can be , , ,\n, , of the train control system, will need to be competent in\ngiven to a train to stop needs to be commensurate with the é ; ,\n- . - ; order to perform their tasks and duties safely and efficiently.\nrisks associated with the emergency. The risk of stopping trains , ,\n, , , : This includes the competence of designers, testers,\nin unsuitable locations also needs to be taken into account. dri mie ae\nrivers, signallers, maintainers and others whose activities\nEssential supporting safety requirements for contribute to the overall safe working of the system. The\ntrain control systems application of suitable procedures for personnel selection,\ntraining, assessment and periodic review will contribute to\nThe assignment of safety targets for a train control continuing competence.\nsystem will need to:\n。 be commensurate with, or better than, the levels of safety .\nperformance of comparable systems already in service; What do you think?\n。 meet the reasonable expectations of users; What other ‘back to basics’ articles would you like to see\n。 comply with legal requirements. in IRSE News? Why not share your experiences with other\nengineers? Email editor@irsenews.co.uk.\n18",
      "source_file": "6_Fundamental requirements for a train control system.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    }
  ]
}