{
  "doc_id": "5fed1eb5-fb7a-4330-a7df-d1e2567e0707",
  "pages": [
    {
      "page_number": 1,
      "text": "Institution of Railway Signal Engineers\na\nBack to basics: train protection\nQuestions for the Certificate (Module A) will not be set\non the text which has been struck through game\nEffective from October 2023 exam | BA ae\na ASICs |\nThis, the fifth article on ‘back to basics’ Supporting the driver starts with providing clear\nthemes, covers the subject of train and concise signal indications so there is no\nprotection. The fundamental requirement confusion in the meaning and limited opportunity\nof a railway signalling system is to ensure a to read the wrong one. One can wonder how\ntrain movement can be completed with the drivers could see a dim oil lamp flickering behind\nminimum of risk from human error, while a coloured lens as they approached many of the\nat the same time allowing as many trains mechanical signals still in service, at least in the\nas possible to run on a given infrastructure. UK until as little as 15 years ago. Many years ago,\nMuch of the focus of a signalling engineer is drivers had the advantage of a dark sky with the\non the design of the infrastructure control general absence of town and street lighting. Now\nsystem that ensures safe routing of the trains of course most signals are colour lamps but often\nand supports the person responsible for against a much brighter background. The problem\nthat activity, the signaller. But the other key is how do we help the driver respond to those\noperative is the driver. signals and what other support do we need to give\nThe history of railway signalling is very often about them to limit the number of accidents. There are\ntwo main errors a driver can make:\nthe development of systems to prevent the wrong\n“The driver signal being given to a driver and the evolution 。 Failure to control the speed of the\nis constantly of the technology that underpins that function. train correctly.\n. Relatively little relates to supporting the driver, 。 Failure to stop at the defined End of\nmaking although it would b t there i ty (EOA\n; gh it would be wrong to assume there is Authority (EA).\njudgements none. It is worth considering the different rolesto | . . ,\n, , , , tis these functions a train protection\nabout the safe see if there is any underlying reason for this. The\n, , , , ; , system must address.\nmovement of signaller is dealing with a fixed set of equipment . . . .\n. on that has a limited range of states and thus a limited ©The remainder of this article will start by\ntheir train set of options. The requirement is to set specific examining the various types of train protection\nroutes at given times to permit the safe passage of and how those may affect the performance of the\na train, and to be reminded which of those actions __ railway. It will then provide a generalised review\nhave yet to be completed. The driver onthe other — of the development of systems to outline the key\nhand is constantly making judgments about the requirements with examples of systems from the\nsafe movement of the train based on information UK and other countries.\nfrom their own route and train performance . 。\nknowledge, signs at the trackside and the signals Warning or protection\nseen. And in the case of signals seen these can Within the overall scope of train protection there\nand often will be changing minute by minute as are two main sub divisions, warning systems\nother traffic moves. So the computational task of and protection systems. A warning system will\nassisting a driver is significantly more sophisticated normally be associated with the location at which\nthan that required to support a signaller. Maybe braking should commence whereas a protection\nthis is why train protection systems seem to have system will aim to stop the train at or soon after\nevolved more slowly, with the sophistication of the End of Authority (EoA). A warning system\ntrain protection requiring computing power akin will alert the driver to take note of information\nto a processor not a logic box. presented from the trackside and may initiate\n10",
      "source_file": "13_train protection_update.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 2,
      "text": "IRSE News | Issue 268 | July/August 2020\n、 et Fo mE 2 上 ry\nver, . a aE : at q = ad , AAA - <a 4 f\ng + J = \\ -_ fo. fo YY wa\nSupporting the driver braking action if the driver fails to acknowledge investment in a comprehensive trackside ATP\nby relaying accurate the warning. After acknowledgement the train is installation. Many of the systems introduced\ninformation inthe cab and usually solely under driver control. A protection prior to the turn of the century (2000) can be\nreducing the possibility . ae . .\nof mistakes being made system will enforce a brake application should considered to be of this form.\n, the System detect the train is being driven outside\nhas been a long running i 。 。 san 。\nfocus of the command, safe parameters. There are several sub-divisions Train protection with intermittent update\ncontrol and signalling of protection systems. It should be noted there is These systems continuously monitor the\nindustry. The view may overlap between some of these classifications. movement of the train to ensure it is within the\nhave improved from the . safe envelope. The driver is provided with an\nsteameratothemodern Train stops indication of the current maximum safe speed but\nday (as shown above) Probably the most basic but effective form of train otherwise drives to the signals and signs observed\nbut increased speed and . , , , , , ”~ , . .\ntraffic complicates the protection, train stops are typically mechanical at the trackside. The train picks up information\nsituation. devices that trigger a brake application if passed about the infrastructure ahead including the\nPhotos Westinghouse when in the ‘protecting’ position. They are traffic conditions at intermittent intervals, usually\nB&S Archive/ usually associated with a stop signal. A train stop from a balise or beacon or from inductive loops\nChippenham Museum and _ will ensure the train comes to a halt at braking laid in the track. The intermittent intervals are\nShutterstock/aapsky. distance beyond. To be effective in eliminating usually associated with a signal, to facilitate the\naccidents they require an extended protected inclusion of information about the extent of any\nlength of track beyond the signal, which limits current movement authority and any speed limits\napplication to lines with relatively low top speeds associated with that authority.\n(around 80km/h) and good brake performance ; ,,\n. These Systems provide full supervision of the\n— typically metros. There are two fundamental . . at:\na driver at all times and will intervene to reduce the\nweaknesses with such systems; firstly, they , ie ,\n. train speed back within the safe envelope prior to\nreduce capacity because the extended overrun\n; returning control to the driver. The exception to\ndistance increases the headway between trains, ,, , , ,\n。 this is in the event of a Signal Passed at Danger\nand secondly, they do not address the issue of rare é\n(SPAD) when a ‘trip’ state is entered and the\noverspeed at other locations. There have been ,\nmae . train is brought to a halt. The systems normally\n\" 。 applications where timed release of train stops is , , ,\nTrain stops ; include roll back protection, a function of most\nj used to monitor speed, especially approaching ATP systems, to prevent the train rolling awa\nreduce capacity buffer stops or high-risk junctions, but they are y tOP ing y\nee: ; when brakes are released but traction power\nbecause difficult to implement successfully. is not applied\nextended i i | ;\n\n. Intermittent train protection Because the system only receives intermittent\noverrun dista nce Intermittent train protection is provided at those updates, the system may restrict track Capacity\nincreases locations assessed to pose significant risk. These because the train must be driven according to the\nthe headway are usually junctions with substantial traffic ora last update received and may thus continue to\n\n。 \" particular layout that creates additional risk, for enforcea reducing speed even though the signal\n\nbetween trains example where there is a chance of head-on ahead has changed to a less restrictive aspect. A\n\ncollision. As a train approaches such sites it passes “means of partially overcoming this constraint is\n\nthrough a speed trap and if above a pre-set speed ”to have ‘infill’ in the form of loops or additional\n\nwill experience a forced brake application. balises which augment the update frequency,\n\nIn more recent systems it will be fed information especially approaching critical signals.\n\nabout the current conditions and then calculates One advantage of such ATP systems is, because\n\nthe safe speed profile to be followed. the train is being driven on conventional signals,\n\nModern systems of this type usually require the system can be overlaid on the railway to\n\nthe fitment of an Automatic Train Protection enhance safety. It is thus possible to partially\n\n(ATP) system to the trains but avoid expensive equip either or both track and trains with only\n\n11",
      "source_file": "13_train protection_update.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 3,
      "text": "IRSE News | Issue 268 | July/August 2020\nselected portions of the route and chosen trains elsewhere is a typical example. If a distant\nbeing protected. One disadvantage with this is signal is approached with a clear indication the\nthat an unfitted train which SPADS, may encroach driver receives a bell (or gong) sound and is free\non the path of a fitted train, resulting in a serious to continue. Should the signal be at caution\naccident. Thus, this arrangement would ideally the sound is a buzzer (or horn) and the driver\nonly be used as a migratory configuration. must acknowledge this both to turn off the\n. . . . sound and prevent a brake application. After\nTrain protection with continuous update acknowledgement the driver is responsible for\nThese systems have the facility to provide updated the continued motion of the train. These basic\nmovement authority information at any time. functions are almost identical to the French\nConsequently, they are often part of an in-cab “Crocodile” system.\nsignalling system because the driver is continually —\nfed information on the current safe speed and is HHstnteresting to note Row the technetegy of\nno longer required to watch for lineside signals this systent has changed the baste systent was\nor signs. There may be other reasons, outside developed by the Great Western Raitway- trated\nthe scope of the signalling system, for the driver in- 1906 -ancimptemented shortly afterwards\nto watch the passing trackside and one of the across thei Retwork_ initially the Communicator\nchallenges is to ensure the right balance is struck Pebweertracicand-train-was-a- ramp in the track\nbetween watching the displays in the cab and with af electrical teed te indicate clear and ne\nwatching the line. electrcat charge wher at eatition this follows\nthe—fat-safeprncipte because the absence of\nAnother challenge with these systems is that the electricity could arise in several failure situations\ndriver is given advice on the safe speed profile whereas the mechanicalifting ofthe contact\nbased on the train parameters encoded in the shee-would fail rauertess-often_the _preblent\n“If these system. If these parameters are wrong the driver with amechanical contact systentis wearand\nmay be advised to brake later in the journey than tearespecially as speed and frequency of use\nparameters are is desirable, with the risk of passing the End of inereases-as-was inevitable when Multiple Aspect\nwrong the driver authority (EoA) - the equivalent of aSPAD. This is Signalling {MAS} beeame-commen_the form-of\nmay be advised of particular concern for variable formation trains, AWS implemented by British Railways from the\nto brake later especially locomotive-hauled freight trains, but is 1950s-uses magnetic induction to-convey the\n. . 7 also relevant at times when adhesion is poor. signal status to the train During the 1950s when\nthan is desirable the-systertwas being tastatted semiconductor\nThe major advantage of such systems is the ability mm\nto enhance the capacity of the infrastructure. devices were Rew se the equipment on the\nBecause the train and infrastructure are in regular train-used relays. today the togic is performed\ncontact, and with a safe speed display in the cab, bya PLC and the magnetic fete detected by a\nthe limitations of fixed lineside signalling with Halt feet sensor\na limited number of aspects can be removed. AWS uses-a permanent magnet centrally located\nThus, a fixed block railway is no longer limited between the rails te initiate the onboard system\nto say four or five aspect signals, meaning closer and previde the driver with awarning ifthe\nrunning is possible and, more importantly, signalis_at caution orstep-An electromagnet\nrelease of trains held at a converging junction is pesitioned immediately afterwards where a\ncan happen significantly earlier with very short signalmay show dine clearaspect_this second\nblock sections. This form of protection is a mragnetis- energised when the signatis clear\ncorner stone of moving block systems and the (green and efectively cancels the warning,\nheart of Communication Based Train Control instead sounding a beltin the cab {see Figure 二\n(CBTC). Metro railways have been able to gain FheFrench“Creeedile’ system-conveys the twe\nsignificant uplift in service frequency as a result messages from the infrastructure to the train by\nof such application, for example the Victoria line different voltages applied te the “Crecedile“ ramp\nin London increased from around 30 to 36 trains collected by awire_-brush-on the driving vehicle\nper hour in the peak as a result of implementing mechanically contacting the ramp.\nCBTC. Continuous update train protection\nthus offers enhanced performance and options to-ensure the twe stiecessive magnets are\nfor reduced trackside equipment as well as detected at tow speed the systent delays outptt\nimproved safety, making the business justification *@ the driver for approximately one second after\nmeasurably easier. passing the permanent magnet this provides\ntine ferasiowhmeving train te detect the\nThe advantages of in cab signalling and increased electromagnet orierte initiating the warning\nCapacity by removal of lineside signals usually sequence—ttthen-gives the driver around three\nmeans either all trains must be fitted with a seconds to acknowledge awarning and observe\nsuitable system or the configuration of existing the signal lt ne acknowledgementis received\nsignals needs to be amended to allow changes the brakes-will be applied _On passing the signal\nin operational rules. This poses a significant cost displaying the caution aspect the train should\nhurdle before such benefits can be gained. step -aterbefore the associated step signal Thus\nWarning systems 4 ws ; ) ¢ 本 ee ee ll\nWarning systems are usually designed and iterpreted-as- about 180M.\npositioned to alert the driver to the presence of a\na signal or sign at the trackside. The Automatic A-key technicat chatienge for AWS arese with tts\nWarning System (AWS) in the UK and used application to third rait electrified infrastructure:\n12",
      "source_file": "13_train protection_update.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 4,
      "text": "IRSE News | Issue 268 | July/August 2020\now a ~ > ee Sint Pes AS了 EER e 1S RTE\nee - < 4 a age Sette Renee eC ea\n$ . . v fp . - mrt .. 1 oye Sate en Shy.\nmo - Pea cans Ra\n| Se NSS Reed\n| ie MA eh | Soe Sas\nro ae = Ss < = 5. nS a. os 4\nThe “Crocodile” system conveys two messages to the train by different voltages fed\nto the ramp. The right hand photo shows Eurobalises, TBL antenna and Crocodile\ntogether in a Belgian application.\nPhotos Wikimedia CC-BY-SA Charlotte Noblet (left) and Francois Metchior.\n- AN :\nElectromagnet & «tp...\n* i> ‘. ~~ , ° 4 ,\noo Permanent magnet 2 2.# . AWS receiver\nSe pe\n- \\ “ai. wee > ach pre Hall effect\n-2 3 Dragging equipment TPWS receiver\neee ramp\nAWS. Left trackside magnets, right, train-carried equipment.\nPhotos David Fenner.\n1) Signal green. Train responds to both magnets,\nsounds bell to driver, no action.\n2) Signal NOT green. Train responds to one magnet,\nsounds horn to driver. If driver does not respond\nto horn brake applied after 2-3 seconds. If driver\nresponds no action by system. Control Centre\nControls points and signals.\nWatches train position from\ntrain detection sections.\n, All signals fitted with AWS\nElectric magnet\nonly energised when Permanent\nsignal green magnet\nTrain detection section 1 Train detection section 2\n2\nV\nAF, ail\nCC CC一|\n了\n/OSCS CeCe—\n<—___—___>\nApprox 200m\nFigure 1 — AWS application Trains with AWS or full TPWS can share the line.\n13",
      "source_file": "13_train protection_update.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 5,
      "text": "IRSE News | Issue 268 | July/August 2020\nWhere high current DC traction systems are used accidents caused by excess speed. The need to\nthere is a risk of cross track cables creating ‘stray’ continue to reduce the harm caused by accidents\nmagnet fields. In this case the AWS detectors on together with these human factor weaknesses\nthe trains were desensitised and extra strength subsequently resulted in the development of the\nmagnets provided for the trackside AWS functions Train Protection Warning System (TPWS).\nto minimise the risk of false AWS information from\nA feature of AWS and many similar systems is\nthe stray fields.\nthey give the driver one of two indications at\nAnother challenge is the increasing use of bi- every signal. Thus, any failure of the train borne\ndirectional signalling. With the magnets in the equipment is quickly revealed to the driver and\ncentre of the track, trains in either direction will can be managed through appropriate procedures.\n“Another detect the fields. Thus, trains passing over an In the case of AWS, the use of a permanent\nchallenge is the installation intended for the opposite direction of magnet ensures that a complete failure of the\nmovement will experience a warning since the trackside installation is very remote and similarly\nincreasing use\npermanent magnet will be the last item passed. the driver will note a wrong indication. It should be\nof bi-directional On tracks where this is an infrequent occurrence understood, AWS is not a fail-safe system with a\nsignalling” a sign may be installed to remind the driver this high SIL rating. It is therefore important that faults\nwarning does not apply to them. In locations are reported promptly and suitable measures\nwhere such movement is more frequent or would taken to operate safely after discovery.\nresult in the need to regularly acknowledge\nBasic protection systems\nirrelevant AWS warnings, the permanent magnet\nis surrounded by an electromagnet coil which The earliest protection systems were train stops\nsuppresses the permanent magnetic field when placed on the track at the location of a stop\na reverse direction movement is signalled. Thus, signal, as previously described. When the signal\noutputs are required from the interlocking is showing a stop aspect an arm is raised typically\nsystem not just to indicate when the signal is 50-60mm above rail height. This engages with a\nshowing a green aspect but also when a reverse trip cock on the train which opens a vent on the\ndirection route is set. Occasionally the signalling brake pipe forcing a brake application. The train\narrangement may enable one AWS installation will be passing the signal at danger before the\nto be used for two signals reading in opposite brakes are applied in which context this is a SPAD\ndirections. In this case the permanent magnet mitigation measure rather than prevention. When\nwill have two electromagnets one either end the signal is clear the trip arm is lowered below\nassociated with the relevant signal. rail level. Train stops were normally provided\non metros operating in tunnels because of the\nMultiple aspect signalling has resulted in most\nsignificant risk of a collision in such locations.\nsignals being equipped with AWS meaning the\nExtension to other locations has followed. To gain\nneed for driver acknowledgement can become\nfull protection requires a long enough overrun\n“Train stops are a semi-automatic reaction, especially when\nto bring the train to a halt from the maximum\nstill a mitigation operating a congested railway on restrictive attainable speed prior to the brake application.\naspects. Indeed, this caused the Southern\nmeasure rather For metros this is usually an associated design\nRegion of British Rail to experiment with a more\nconstraint limiting capacity and creating some\nthan a control sophisticated form of Signal Repeating AWS\noperating constraints such as restricting speed\nsystem” (SRAWS) during the early 1970’s but in the end\nthrough closed stations when the overlap at the\nthis was not adopted. The problem of instinctive\nnext signal is based on the maximum attainable\nresponse is exacerbated by the application of the\nspeed from a standing start. For main line railways\nsystem to severe permanent and all temporary\nthe concept is often not practicable due to higher\nspeed restrictions. These requirements arose after\nspeeds and extended braking distances.\n“Classic” trainstops on the Berlin S-Bahn, photo taken in 2007.\nPhoto Kabi/Wikimedia.\n14",
      "source_file": "13_train protection_update.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": false,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 6,
      "text": "IRSE News | Issue 268 | July/August 2020\n1) AWS as before.\n2) If train speed less than overspeed sensor value\nwhen signal red no action, if overspeed brakes\napplied for minimum one minute.\n3) If train (front end) passes train stop when signal\nred brakes applied for one minute.\nControl Centre\nControls points and signals.\nTPWS equipment active Watches train position from\nonly when signal red TPWS only fitted to signals protecting train detection sections.\njunctions and other \"high risk\" signals\nTPWS train stop AWS TPWS overspeed\nsensor\nTrain detection section 1 Train detection section 2\nTypically up to 350m\nFigure 2 – Typical TPWS installation.\nTrain stops have moved on significantly from this TPWS is considered to have a high probability\ntechnology, but they are still a mitigation measure of stopping a passenger train within the overlap\nrather than a control system. An early advance provided the approach speed is not greater than\non mechanical contact train stop systems was 75mph (120km/h) and adhesion can deliver the\n“Indusi”, first installed in Germany and surrounding braking effort of the train. Where approach speeds\ncountries in the 1930s and revived in the 1950s. are greater than 75mph and risk is assessed to be\nSeveral enhancements have subsequently high additional overspeed loops may be provided\noccurred leading to the system known as PZB90. earlier on approach to the signal (Figure 3\nThree tones are generated on the driving vehicle overleaf). The system substantially mitigates the\nand interact with passive tuned coils mounted risk with a SPAD but does not eliminate it.\nas required trackside. The tuned coils cause\nThe speed trap function of TPWS is determined\nthe relevant frequency on the motive unit to\njointly by the train and the infrastructure. The\nresonate resulting in an impedance change and\ntrain has a preset on board timer. At the trackside\nthus activating the required action. The 2000Hz\nthe arming and trigger loops are separated by\ntone is a train stop forcing a brake application\na predetermined distance corresponding to\nand is will typically resonate on passing a red\na defined speed based on the standard timer\nsignal. The 1000Hz tone is typically associated\nsetting. Current implementations assume two\nwith a caution signal and requires a driver\nstandard timer settings, one for passenger trains\nacknowledgement followed by a speed reduction\nand a longer setting for freight trains. Thus, the\nwithin a set time whilst a 500Hz tone requires a\nspeed trap will activate if a train passes above a\nlower maximum speed and is often placed shortly\npredefined speed based on its ‘type’. This gives\nbefore a red signal.\nrise to not infrequent cases where a marginal\nIndusi tuned coils are installed on the sleeper overspeed results in a heavy brake application that\nends so they are naturally only detected by a was probably ‘unnecessary’ in terms of the train\nvehicle travelling in one direction and do not need being able to stop where required. This can cause\nsuppression for opposite-direction movements. drivers to dislike the system which is a concern as\nTPWS in the UK has related functionality in that it may lead to misuse.\ntones, in this case six of them around 65kHz, are\n“TPWS is only TPWS is an intermittent train protection system\ntransmitted by track mounted loops this time\nprovided at because it is only provided at locations that are\ncentrally mounted in the track. Three frequencies,\ndeemed high-risk. Those are defined as signals\nlocations that two arming and one trigger, are used for the\nprotecting a convergent junction and selected\nare deemed normal direction of movement and the other\nother signals (where the SPAD risk is assessed as\nthree for trains in the opposite direction on bi-\nhigh-risk” high), buffer stops and severe speed reductions\ndirectional track. These provide the functions\nwhere the approach speed is or exceeds 60mph\nof a ‘speed trap’ for a train travelling faster than\n(approximately 100km/h).\ndeemed safe and a train stop (Figure 2). Should\neither the speed trap or train stop function be The TPWS system is active to stop a train so\nactivated a full brake application is initiated and a key requirement is confirming the trackside\nmaintained for one minute, bringing the train to equipment is functioning when required. This\na stand. The location at which the train stops is is done by monitoring the current fed to the\na function of the train brake performance and transmitting loops. Should this fall outside the\nthe initial speed prior to the brake application. intended parameters an indication is given to the\nThere is no certainty this will be in a safe location. supervising signaller and the signal in rear held\n15",
      "source_file": "13_train protection_update.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": false,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 7,
      "text": "IRSE News | Issue 268 | July/August 2020\nTPWS equipment TPWS only fitted to signals protecting\nactive only when junctions and other “high risk\" signals\nsignal red\nTPWS train stop AWS TPWS overspeed TPWS+ overspeed AWS\nsensor sensor (when used)\nTrigger loop Arming loop Trigger loop Arming loop Electromagnet Permanent\n(only active when magnet\nsignal green)\nG 图 8 图 G 国/ 图 8 8 8 8 Ne, G 8 8 G 8 8 8 8 8 8 8 \\e 8 6 L\nWan\n| | ane Ly | ide TH\nWTrPTrterorererieraerieenrteerteenrenrenrenrenrpeaereaenreaeuenrenenrenrenrpenrenenrtenenrteuenrnenrenrtenrepertenenrtieenetenrtrtinaepBrtinaitta\n/OBCS8— Oo © oy\n_ >\nTypically up to 350m\n二一\nTPWS+ typically 750m\nFigure 3 — Typical TPWS installation including AWS.\natdanger Sima the-on—beard eatip ments The infrastructure profile must reflect the\nself-diagnesticte-confiraitis functonatatthe permitted speed, including any temporary speed\nstartofajeurmeyandis seme cases imtermiternty — limits, covering at least the distance within the\nthereafter ASWwith AWS this systentwas fet current movement authority. This includes speed\ndesigned in accordance with SH 4 reauirements, limits over junctions which may vary depending\nse-safety needs tebe controlled by suitable on the route allocated. It also needs to include\nprecedures inthe event ofa fant. the gradient profile over the same distance as\n, , changes to gradient can have a significant effect\nASS i > cart prevent al accitk on stopping distance.\nas they areinternmittent systems. Beth systems\nare _ provided with faectittes te atteow the drverte The location of the EoA either needs to be known\nreset the system aftera brake intervention and or at least it is beyond the range that currently\ncontinue with the journey _Sueh resets required needs to be considered (e.g. when driving on\nte-be conducted undereeoentroted circumstances green signals or the equivalent). To calculate the\ninveling-_conamuncation with the sigraterer ongoing speed profile, it is obviously necessary to\nacontrotter_tabeth-cases there is_evidenceof know the current speed and how far the train has\ndrivers sometimes resetting umithout following travelled to enable the remaining distance to any\nthe-cerrect precedure with the peterntial tere speed change to be determined.\nserous accident: The braking performance of the train is a\nFull ATP systems with key parameter in performing the safe speed\nintermittent update envelope calculation.\n“Full ATP systems FullATP systems continuously monitor the The data about the infrastructure including route\ncontinuously movement of the train and intervene with a brake set and signal status is usually fed to the train\nmonitor the application should the speed go outside the safe intermittently as data telegrams by balises or\nenvelope. An indication of a suitable speed is given beacons, most of which will be associated with\nmovement of the tothe driver, this speed usually having a small a signal (Figure 4). Some systems use inductive\ntrain” margin beneath the safe speed envelope. These loops laid in the track to pass the relevant\nsystems are normally designed in accordance with _ telegrams. Infill may be provided where the\nSIL 4 requirements. intermittent transmission of data has a significant\nimpact on operational capability.\nTo enable the train to continuously calculate\nand monitor the safe speed profile information is The need to know speed and distance travelled\nneeded about several parameters: results in some fairly complex configurations of\nequipment on board the train. The wheel to rail\n* Infrastructure profile. interface is notoriously challenging with relatively\n。 Distance to the end of the movement authority low adhesion. This makes simple odometry\n(i.e. stop signal) (EA). inadequate for the purposes of ATP especially as\n。 Current speed of the train. the objective is a system with high safety integrity.\nDistance travelled. Slip (during acceleration) and slide (during braking)\nare relatively likely, both creating erroneous\n* Braking performance of the train. information if reliance is placed on wheel rotation.\n。 Maximum train speed. Some systems use an unpowered and under\nbraked (or unbraked) axle as the sensor input.\n16",
      "source_file": "13_train protection_update.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 8,
      "text": "IRSE News | Issue 268 | July/August 2020\n1) Beacon tells train ‘colour of signal’, permitted speeds\ndistance to next beacon, gradient etc.\n2) Train computer calculates maximum safe speed, Gua\nadvises driver by display in cab.\n3) Driver obeys lineside signals and signs.\n4) If driver exceeds safe speed brakes applied. Control Centre\nControls points and signals.\nA beacon is connected to every Watches train position from\nInfill loop updates trains signal colour and informs train train detection sections.\napproaching signals where of signal state\ntime may be lost if signal\nchanges aspect\nTrain detection section 1 ____Traindetectionsection2 __Train detection section 3 _\nGB g8 8 88 8 8 86 26 2 四 ee ee ee ee ee ee ee ee ee ee ee ee ee ee ee ee ee ee ee ee ee ee ee ee ee ee ee ee ee ee ee ee ee ee ee ee 图 图\nae ED CC | CC一\nVt Pe PPA A\nV V V\nJOO AWS @ © AWS OOO AWS\nSignal 1 TBL beacon Signal 2 TBL beacon Signal 3 TBL beacon\n\nFigure 4 — ATP with Another risk with wheel rotation is the slow but issue. It is a far more complex challenge for\n\nintermittent update (as steady change in size as the wheel wears. Doppler _ variable formation locomotive hauled trains,\n\nused by Network Rail radar is sometimes used, but is not without especially freight trains. The usual arrangement\n\nbetween London and , , ,, , ,\n\nBristol). challenges especially in damp or snowy conditions _ is to request the driver to enter or select brake\nand of course like wheel rotation it is subject to a data as part of train preparation. One challenge\nsteady build-up of position error unless corrected. in defining the brake performance is whether the\nUse of a Global Navigation Satellite System (GNSS) — system needs one or both the service brake and\noffers another means. However, it rarely covers all emergency brake parameters, and ensuring the\nconditions, examples being tunnels and urban or rolling stock and signal engineer are discussing\nother ‘canyons’ where lost or reflected signals can the same function! The rolling stock engineer will\naffect the calculated position. Thus, odometry for often regard the emergency brake as the brake\nATP is often a mix of systems to counteract the of last resort (i.e. a vented air pipe) which may\nweakness of any one of them and to support the result in a lower deceleration rate because electric\ndetermination of the margin of error on the actual braking and wheel slide prevention systems may\nestimated position which will tend to increase over _ be disabled. If the emergency brake rate is lower\ntime and distance travelled. Balises or beacons than the service brake rate it will tend to dominate\n\n“Odometry for on the infrastructure are frequently used as a the operating profile because it will require the\n\n\" reference point to correct accumulated error. Not __ train to be slowed earlier than the service brake.\n\nATP is oftena surprisingly odometry problems are potentially Thus, it is important to be clear between parties\n\nmix of systems to the biggest cause of train equipment failure for exactly what the parameters mean and how\n\ncounteract the some ATP systems. they will be used.\n\nweakness of any A further result of the challenge with odometry The inputs from the above data sources are\n\n\" is the need for a “release” speed with many ATP typically fed to a multi-channel processing\n\none of them ; ;\nsystems. Because the train cannot know exactly system prior to being presented to the driver as a\nwhere it is the ATP system will assume worst permitted speed indication and when necessary to\ncase error and therefore bring the train to a halt the brake activation interface.\n\na short distance prior to the current EOA. This is . .\na significant problem if the next update function Full ATP systems with continuous\nis located close to the EoA and in the case of the update\nEoA being at the end of a station platform when, These systems have the same basic functionality\nfor station purposes, it is important to get close to —_ and challenges as described for intermittent\nthe platform end. To counteract these challenges, update systems, but the data about infrastructure\nit is normal for the ATP system to return full condition is able to be updated at any time. Such\ncontrol to the driver on final approach to the EoA 。 systems allow in cab signalling as the driver can be\nprovided the train is then operated below a low informed of an update to signalling conditions via\n“release” speed. This of course means there needs __ the cab display.\nto be a short safe overrun beyond the EoA should\nthe train pass beyond the EoA, when a “trip” state Early systems achieved continuous update by\nwill be entered to bring the train to a stand. transmitting codes to the train via track circuits.\n\nIn practice the number of codes capable of\nBraking capability is the final parameter the system transmission this way is severely restricted. So\nneeds. This is generally relatively simple for fixed usually the train was given a maximum running\nformation multiple unit trains, although a given speed and a target speed to achieve at the end of\naxle may under-perform due to a maintenance the section. Information such as speed restrictions\n\n17",
      "source_file": "13_train protection_update.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 9,
      "text": "IRSE News | Issue 268 | July/August 2020\n一、 ane sas Sor ae ae\nme LE og on | 本 人 oon\nrey Ree pret SN oo oe 四 、 =\nOpposite ends of — or gradient would have to be used as part of the The major advantage of mobile data packet\nthe coded track train design process when configuring the system for systems is the much larger and reliable data\nprotection speed the railway. This method of providing continuous bandwidth, meaning more of the processing can\nspectrum: Loe, , , , , ,\nLeft the LGV-Est line in update is limited to lines using rolling stock with be performed on the train and be relevant to the\nFrance, equipped with very similar brake performance, or at least has to specific train, resulting in better optimisation.\nTVM430. be based on the worst brake performance train They also both open the way for the train to\nRight, London permitted. It was the backbone of the original inform the infrastructure of its position and its\nUnderground's Central London Underground Victoria Line automatic train operating performance.\nLine. operation system from 1965 until recently and is\noro Su tterstock/olrat the basis of the signalling on many of the French CBTC\nutterstock/T tatty. LGV lines signalled using TVM 430. A significant Many current resignalling projects for metro\nchallenge with such systems is the need to ensure __ railways are based on Communications Based\nthe train can detect the track circuit code prior Train Control (CBTC). As the title suggests this is\nto shorting the track circuit current as part of the a highly integrated form of train control covering\ntrain detection role. Thus, assuming the detector is all the important functions of train movement\nat the front of the train, it is necessary for all track including route setting, train location, movement\ncircuit feeds to be ahead the train which means authority often based on moving block, train\nthat reversal of feed and detector functions is supervision and train driving. In the latest systems\nnecessary for any lengths of track used reversibly. CBTC is often used on a railway working under\n, , Automatic Train ration (AT high\nAnother early method of providing continuous uromale ira Ope ane | 0) ora ngner grade\n, , of automation with the objective of providing the\nupdate was via a loop usually between the rails maximum achievable capacity on the routes fitted\nwhich radiates data to the train. The German LZB pacity\nsystem is perhaps the best known of this form and CBTC systems incorporate continuous ATP\n1 is also the parent system for several others of this protection using radio communications between\nCBTC systems type (e.g. SELTrac). In this particular case the data the train and the trackside installation. The actual\nincorporate rate is low by modern standards (1200 baud up form of the radio link, which is also used for other\n: link to the train; 600 baud down link). Thus, the aspects of the CBTC system, varies between\ncontinuous 1 人 1\n. data volumes handled between track and train both supplier and application and may include\nATP protection are relatively low (circa 85 bits per telegram). As Wi-Fi and 4G/LTE, although the majority of new\nusing radio a result much of the calculation is performed in systems are likely to use 4G/LTE. The detailed\nCommunications” the LZB control centre and limited target speed methods of implementation are proprietary to\ndata is passed to the train. The loops in the four the manufacturer.\nfoot 1 i ; ;\nroot are crossed every 00m which both reduces Most systems of this type have been implemented\ninterference and provides a distance monitoring aan .\n, , - on individual lines of a metro or on people mover\nfunction to the train by reversing the phase of the -\nradiated sianal systems (e.g. at airports). This has the advantage\ngna. of a limited range of rolling stock making the train\nThe system is in relatively widespread use through = parameters consistent and thus maximising the\nGermany and Spain, especially on high speed lines, | capacity gain from moving block.\nwith other applications in Austria and elsewhere. Two disadvantages are the need, especially on a\nThe most recent systems in this category are high capacity metro, of having a highly reliable\nurban CBTC train control systems and ETCS system requiring layers of redundancy, and the\nLevel 2 and above, both of which use radio proprietary nature of the systems from each\nsystems to transmit data between track and train. manufacturer which for commercial reasons\nrestricts the use of such systems on a large\nnetwork of lines.\n18",
      "source_file": "13_train protection_update.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 10,
      "text": "IRSE News | Issue 268 | July/August 2020\nETCS Level 3, which is not yet fully developed, will\nUntil the around the 1990s most EU countries enable train detection to be based on data\nhad their own train protection systems as well as received by the RBC from the trains in the area. It\nsignalling and communications arrangements. will therefore facilitate the reduction or removal\nThis resulted in relatively closed markets for of lineside train detection equipment and facilitate\nsignalling products and required different the introduction of short virtual blocks or perhaps\nsystems to be available on any driving vehicle Moving block. A significant challenge at present\nthat might cross from one country to another. is from variable formation trains (e.g. freight and\nThe advent of through international trains such locomotive hauled Passenger trains) and proving\nas Eurostar required the trains to be fitted with they are complete at all times.\nmultiple train protection and communication Other ETCS levels also exist, including those\nsystems and for the drivers to be trained in the working with a national ATP system through a\ndiffering signalling arrangements. The opening Specific Transmission Module (Level STM), and\nup of markets prompted the EU to propose a Level 0 when an equipped train is operating over\n“The advent common standard for rail traffic management unfitted infrastructure and is thus subject only to\nand especially signalling, train protection and train ceiling soeed supervision.\nof through radio communications across the EU states which - 7*P ° ,\nInternational culminated in the definition and development of In addition to these primary levels there also exist\ntrains such as ERTMS including ETCS and GSM-R for track to options for Limited Supervision which effectively\n; train communication. provides train protection only at critical locations\nEurostar required and thus corresponds to intermittent train\nthe trains to ETCS provides three primary levels of protection. Finally, there are proposals for ETCS\nbe fitted with implementation together with others to suit Hybrid Level 3 which provides Virtual blocks as\nItiole train specific needs. well as conventional train detection, delivering\nmump © Level 1 is essentially an intermittent update ATP capacity benefits for trains that are Level 3\nprotection and system associated with existing lineside signals enabled, without having to bar the route to Level 2\ncommunication with the same facilities and restrictions interms of 0 unfitted trains. An article about ETCs Level 3\nsystems” ‘infill’. The primary track to train communication See cE Nome was published in the April 2017\nmedia is the balise with infill loops an option. ,\nLevel 2 adds a Radio Block Centre (RBC) and Positive Train Control (PTC)\nprovides continuous update of movement In North America there is currently a programme\nauthority and all associated infrastructure data by to implement Positive Train Control (PTC) on\nradio. For ETCS the currently specified radio link all intercity passenger lines, and on freight lines\nis via a continuously open GSM-R call. However, carrying more than 5 million tons per annum\nthis is likely to change as train radio moves to of inhalable toxic substances. PTC is a form of\npacket switched (4G/LTE or 5Q). In the interim ATP in that it requires the prevention of collision\nGSM-R may be supplemented with General due to passing the end of authority or passing\nChina's CTCS system Packet Radio Service (GPRS), a 2/3G packet through misaligned points and speed supervision\nshares many concepts oriented mobile data standard, to support ATP to prevent derailment at speed restrictions\nwith ETCS but has in busy areas. It therefore has the functions of a whether permanent or temporary. There is no one\nsevered Keoo up continuous update ATP system. Lineside signals mandated solution but there is the requirement of\nwith infrastructure can be removed but Level 2 retains trackside interoperability between systems as many vehicles\ndevelopments across the train detection and interlocking functions. Such a travel over several networks. It also requires\ncountry. system can provide the basis for Automatic Train provision of arrangements to protect track\nPhoto Shutterstock/ Operation (ATO) and has been implemented on workers. Whilst several systems were proposed\nkikujungboy. the Thameslink core through central London. most installations have settled on one of three\nsystems and all will operate with each other.\nie Sm |\n~ Fe as:\n- ba : .\nee - oa\n- <a\n_ ”一 一 -一\n19",
      "source_file": "13_train protection_update.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 11,
      "text": "IRSE News | Issue 268 | July/August 2020\n\n:rt eee tN Of .= Te =, ‘ee\n*M me @ : Lae Fb ent 4\nwera i ed ak my Sao | > ae: Paty\nRees 8b ero a Bes URGE eas\nas SVE 此 _ 7? car ”一 ane? el pe Cah “4 >, a We er aS\n-_ | Bo “we me ALE a ee ia Se\n\n. : jy 『 四 “f° . - :\n\n2 ~ same car} 1) - “4 oy ‘s ae eH e oo ae , 本 Mi\nwg oP 7) Le FE / nr cs Meee aye ee rear eee a ae\n7 BES? ok we}, Sees 3 eee fe Shy ei oe Eas GSO) Lee ae ee .\n\nIn a similar way that CTCS The PTC system was mandated by law signed in Conclusion\nwas created to meet the 2008. The original law required the system(s) to In this article | have attempted to summarise the\nneeds of China, PTC was ”be in place by 2015 but costs and challenges in | 1\ndeveloped to meet the implementation mean this date has been pushed Scope of train warning and protection systems\nspecific needs of North b in to th d of 2020. Th f P ti and to highlight some of the major issues the\nAmerica’s railroads. Union edith “oo ° tro and e Le Ing implementation of ATP faces as well as giving an\nPacific has been one Conaitlions trom Metro and COMMUrer Fallways insight into some of the systems that exist.\nof the adopters of this to long heavy haul freight lines means variety of\ntechnology. solutions is too great to discuss here and could\nPhoto Shutterstock/ well be the subject of a separate article.\nAngelDiBilio.\nAbout the author ... “Back to Basics” and the IRSE Exam\nDavid joined the S &T department of the We hope our ‘Back to Basics’ series is\nSouthern Region of British Rail in 1968 as a interesting to all members, bringing topics\nstudent engineer, with his first appointment that underpin our profession into focus ina\nin the telecommunication design office. He simply understood, yet comprehensive way,\nsupported the testing and commissioning of making continuing professional development\npassenger information systems, including the straightforward.\ng 9\nautomatic operation of platform indicators at , , , ,\nLondon Bridge and Waterloo East and setting to those of you nope me veto the industry\na career profile linked with development ,\nof new system ed developme and are working to build up your knowledge.\ny For those considering taking the IRSE exam,\nIn the 1980s David led a team involved with these articles should be particularly relevant\ntrain describer development and a new system for your studies.\nto distribute train location information via As an example. why not think about how\nthe national teleprinter network, followed by would er this ” ection from the 5019\nthe development of the Integrated Electronic Module 5 of the earn based on what vou've\nControl Centre (IECC) including automatic learnt from the article? y\nroute setting. He was also involved in improving |\nelectromagnetic compatibility between train “Describe a system which provides train\ndetection and new rolling stock. protection for a stop signal or limit of\nMoving to Railtrack in 1994 he was involved TOVemnen 1 one, : diag ram, Clearly\nwith the development and implementation 9\nof TPWS and the development of ERTMS in (i) How the speed of a train approaching a stop\nEurope, his work including the implementation signal or a limit of movement authority is\nstrategy for the UK. Before retirement David monitored and controlled;\nmanaged the safety assurance process for the (ii) How a train is prevented from ignoring a\nCambrian ERTMS pilot. David is one of the . . . ae\ncontributing editors of IRSE News. signa) oP 1 aithority. ae ect ora limit of\n(iii) The necessary interfaces to the signalling\nsystem including the interlocking and\ncontrol system.”\n20",
      "source_file": "13_train protection_update.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    }
  ]
}