{
  "doc_id": "6803314f-e757-4d36-b99b-770302fb10fa",
  "pages": [
    {
      "page_number": 1,
      "text": "Institution of Railway Signal Engineers\na\nBack to basics: Principles of\n一 [PACK To\n4 David Nicholson 1 BA S / C S ,\nThis article continues the ‘back to basics’ on the general public, it is usual for governments\nseries, looking at the principles of safety to establish legislation with which those providing\nengineering as applicable to a railway, the service must comply. The legislation is usually\nparticularly hazard and risk assessment, aimed at reducing the amount of potential harm\nidentification and analysis techniques. to the general public and workers, whether that\nPrevious ‘back to basic’ articles have harm is shock, injury, permanent damage (e.g. loss\ntouched on the safety inherent in each of of a limb or hearing loss) or fatality.\nthe systems discussed; this article considers This is not a simple action for governments to\nhow safety is achieved. ; . , .\nachieve as the public they are seeking to protect is\nDefinitions not consistent in their perceptions of acceptable\noa levels of risk. There is often a large outcry from\nBefore we begin, it is necessary to be clear h , , , - .\n, . on definitions and what is meant by the the public when a single train accident results in\nIf we wish to , several deaths, but the very many single deaths\n. different terms used. .\navoid harm. we that occur each day on the roads is felt tolerable.\nhould k t 。 Safety: Freedom from unacceptable risk. This inconsistency is something that railway, and\n> 4 ve 9 e Risk: The combination of the likelinood of other, engineers have learnt to live with.\nr rl ing i\neauce ris OO aera n harm and the degree From the definition of ‘risk’ we can see that if we\n¥ wish to avoid harm, we should seek to reduce risk.\n¢ Harm: Physical injury, material damage. This is achieved either by reducing the likelihood\ne Severity: A measure of the amount of harm. of occurrence of harm, reducing the severity of\ne Accident: An unintended event or series of the harm, or both. Putting it another way, we can\nevents that results in harm. reduce risk through two different approaches:\nwa the first is to reduce the likelinood of an event\n° Hazard: A condition that could lead to an happening where the outcome may be harm; the\naccident; a potential source of harm; an ,\n. a second is to reduce the amount of harm should\naccident waiting to happen. th\nat event take place.\ne Cause: Any event, state or other —\nfactor which might contribute to the The definition for a hazard can also be expressed\noccurrence of a hazard. as ‘an accident waiting to happen’. No accident\n. , has taken place, but there is a dangerous situation\ne Safety measure: An action reducing the ,\nrisk of a hazard where if something else happens, it can lead to\n. ore a or 7 an accident. Thus, for any given hazard, all that\nThe definition of ‘safety’ introduces the concept is needed is a trigger event to start the process\nthat some risk is acceptable. This might seem which ultimately leads to the accident. An\nsurprising at first reading, but there are plenty example hazard is a level (or at grade) crossing\nof people who indulge in activities that others with no form of protection. The hazard (the\nconsider too dangerous (e.g. bungee Jumping or accident waiting to happen) occurs when a train is\nflying). Others can see the benefits that it brings to approaching. There has not been any accident, but\nthem (e.g. thrills or speed of travel). one could happen if there was a car approaching\nThis raises the question of who determines (the trigger event). An approaching car may now\nwhether a risk is acceptable or not. Sometimes collide with the train resulting in an accident with\nthis is purely personal (whether to bungee jump or ”consequences beyond the railway boundary.\nfly), but when a service (such as rail travel) impacts\n10",
      "source_file": "12_principles of railway safety engineering.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 2,
      "text": "IRSE News | Issue 267 | June 2020\n\\@_ \\@_\n\\ ©\na a 4\n~~ “TT / =\nne oo ———\nan an i SS <> \\\n一 & iD /o 8S\nPl e Pl —\n| e ef j | ef j\n= y © FP = XS ue ¥ p\nJ] ¥ | I] KR OEY\n[| | ele [Ti See\nFigure 1 — Hazard to accident. Figure 2 — Hazard to accident - reduced risk.\n3\nElimination 8\n2\n5\n@\nSubstitution c\n2\n2\n. . ©\nEngineering Controls §\na\nS\n和 5\noO Qa\nZ\nFigure 3 — Hierarchy of control.\nThis sequence of events is illustrated in Figure 1 traffic lights to stop road traffic; provide railway\nwhere: the level crossing is the wall; the hazard staff to stop traffic; have the train sound its\n\"Bick reducti is shown as the bucket of stones on top of the horn on approach; ensure good sight lines.\n\nISK reauction wall; the trigger event is the hand knocking the 。 Reducing the severity of a collision: Reduce\nmeasures are bucket over; and the accident is the stones falling the speed of approaching trains; provide\nsometimes onto the flowers. space for a car to divert into at the last minute;\nexpressed in Risk reduction design cars to survive the impact of a train.\n\n. This last point about car design is outside the\na hierarchy of From the diagram, we can see the accident can be scope of railway projects but indicates how\ncontrol prevented, or limited, quite simply by: solutions can lie outside of the expected areas\ne Removing the hazard: Design the railway of interest as shown in Figure 2.\nwithout a level crossing. Trying to limit the number of falling stones in\n。 Reducing the frequency with which the hazard Our illustration in Figures 1 and 2 is not a perfect\noccurs: Reduce the number of trains that solution. Any of the examples given above can fail.\nuse the crossing. If the means to limit the falling stones is shown as\n。Reducina the frequency of the triaaer barriers with holes, it is obvious that some stones\nevent: Reduce the Surber of mare ihat use still make it through the holes in both layers and\nthe crossin for instance by providing an crush the flowers underneath. But the impact, or\nalternative ond more attractive route for car severity, of that accident Is (hopefully!) smaller\ndrivers to use) than it might have been if no protection was put in\n; place — fewer flowers are crushed!\n。 Reducing the likelinood of a collision: Design\na level crossing system that warns of an Risk reduction measures are sometimes expressed\napproaching train; install barriers and road in a hierarchy of control. This is shown in Figure 3.\n11",
      "source_file": "12_principles of railway safety engineering.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 3,
      "text": "IRSE News | Issue 267 | June 2020\nge Wieser Be\n4 . a : 1\n|\nSU Ane pomgs - SoS =a! Nitta\nAi WACHT _ ‘ode Ficht gedoofa is yd - a 7 -\n- “31089 egn tein komen ; > a\nSubstitution may see a The explanation of the different levels is as follows: Safety benefits and costs\nwith a bridee Ce * Elimination: design out the hazard (e.g. remove It is expected that the engineering and operations\nbridges bring their own the need for the road to cross the railway). teams will implement good practice and adopt the\nset of hazards. 。 Substitution: replace the hazard with hierarchy of controls from the outset. Choosing\nPhoto Shutterstock/ something less hazardous. For instance, we which control in the hierarchy to apply introduces\nlvonne Wierink. could replace the level crossing with a bridge. — the concept of calculating the costs involved to\nWhile in this example this might seem very introduce a safety feature and then comparing\nclose to elimination, bridges bring their own that with the safety benefit.\nset of hazards due to bridge strikes, or vehicles Calculating the costs is relatively straightforward\nor objects falling onto the railway from the . . ,\nbridge thereby blocking the line). by asking questions such as: How much will it\n; . cost to provide this extra design feature? How\n* Engineering: use work equipment or other much do any extra parts or items of equipment\nmeasures to help separate people from cost to purchase? How much more will it cost to\nthe hazard. Examples are warnings, alarms, operate and maintain the railway with this safety\n. . guarding dangerous machinery from human feature implemented?\nThe temptation incursion (e.g. for level crossings, provide lights\nis to rely on the and audible alarms as the train approaches). Determining the safety benefit over the lifetime\nlower levels of » Administrative Controls: Identify and the safety measure is a little harder and, at\na implement procedures necessary to work imes, controversial, not least because in addition\nrisk reduction safely with the hazard. For example, we could to fatalities, there are so many different types of\nprovide instructions and training both for injury (both physical and mental). Does the age\ntrain driver and road users on how to use the of the individual matter? Or the number of their\ndifferent types of level crossing. dependants? Does the number of injuries or\n。 Personal Protective Equipment (PPE): This is fatalities in any one incident make a difference?\nwhy motorcyclists wear crash helmets. Or A number of countries have adopted a method of\nwhy people erecting scaffolding are tethered. converting injuries and fatalities into a common\nThere is no example here for a level crossing. measure. One method is shown below as a\nBut it is, for example, why many railway Comparable Fatality Score (CFS) (note that other\nadministrations require their trackside staff countries and other railway administrations may\nto wear high-visibility clothing. This makes have different conversion rates):\nthem more visible to the train driver, who ol, .\n“Determining can sound the train's horn, thereby giving the > 10 major YATES tol fatality.\nthe safety trackside staff more time to get clear of the ¢ 100 minor injuries to 1 fatality.\n, approaching train. 。 1000 negligible injuries to 1 fatality.\nbenefit overthe +, ; a ; . :\noa e temptation, because it’s both inexpensive and ”Each CFS is converted into a monetary value,\nlifetime of the quick to implement, is to rely on the lower levels a figure that is set independently, usually at a\nsafety measure of risk reduction, namely administrative controls national level, typically with a figure around £1.5m\nis a little harder or PPE. People are unreliable at carrying out to £2m per comparable fatality. By comparing\n。 instructions and obeying alarms, particularly under the risk to life without the safety measure to the\nand, at times, stressful conditions. Therefore, the reliance on risk with the safety measure, a reduction in the\ncontroversial” these lower levels of control should only be used CFS can be calculated. This benefit can then be\nwhere elimination, or substitution or the use of compared to the cost of implementing the safety\nengineering controls cannot be achieved. measure. This allows for a simple Cost-Benefit\nAnalysis (CBA). If the cost of implementation\nis much higher than the reduction in CFS,\n12",
      "source_file": "12_principles of railway safety engineering.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 4,
      "text": "IRSE News | Issue 267 | June 2020\nthen the project does not have to implement subroutines and self-modifying code can\nthe safety measure. In the UK, for example, a result in faults in operation.\nproject is obliged by law to reduce risk to As — 。 Adherence to standards: People have spent a\nLow As Reasonably Practicable (ALARP) and itis lot of time documenting how things should\nthis process of comparing project costs with a be done so that those who follow can benefit\nreduction in CFS that enables the project team to from their experience. It also ensures that\njustify its decisions. people adopt a common approach to their\nThe demonstration of sufficient safety level is understanding of functional operation.\na complex and challenging process. Different 。 Configuration Management: We need to\n“Demonstration countries will have different approaches to ensure that people are working from the\nof sufficient demonstrate what is acceptable and what is correct design information, and that the final\n; not. Adopting good practice through adherence design drawings are marked correctly so\nsafety level is to standards or qualitative arguments may be that the installation, test and commissioning\na complex and sufficient, with a CBA only used in the more engineers can have confidence they are\nchallenging complex situations. However, CBA on its own is installing, testing and commissioning the\n本 not sufficient to demonstrate acceptable safety correct design.\nthat adherence to statutory duties is not required, the system know what they are doing!\njust because they offer a good CBA. Legislation of knowledge and experience, which can\nseem necessary when judged by a alone. An , ;\nit should be noted that benefits may not be limited Ore ec an We ean error ine\nto safety. There may, for example, be efficiency or gn, We\" , i,\nenvironmental benefits as well before it is installed. This means designing\nfor testability and validation, checking and\nDefence in depth reviewing designs, performing simulations, doing\nHow do we design systems that are ‘safe’? software code walkthroughs and undertaking\nWe consider a process known as ‘Defence in development testing.\ndepth’. This consists of seven sequential steps as Fault avoidance: Even where the design is error-\ndiscussed below. free, faults can occur in operational service, and\nError avoidance: We work to prevent design errors so controls must be applied to minimise the risk.\n, . : These controls include:\noccurring in the first place by:\n* Keeping the design simple. An overly 。 Design for reliable operation, by ensuring\ncomplicated system makes it harder to detect coves lew too ru stressed nen oh\nerrors in the design of the system. Safety and in nk ee an nent | ee m cn d\nnon-safety elements of the design should be for in oh on on vn ta ng b eh ne\nkept separate. Avoid novel design features ‘liable comDonen as > ¥ CHOOSING\nPersonal Protective and the use of subtle techniques that are not P 7\nEquipment is important, clearly understood by others. Don't provide 。 Perform proactive maintenance when in\nbut cannot guarantee functionality that isn’t required in case it is service by maintaining at regular intervals or by\nworkers safety. inadvertently activated. This is particularly having systems that alert the maintainer when\nPhoto Shutterstock/ ertinent for software where complex in need of maintenance.\nlan Stewart. P P\ntall _—_— TY, Va Ve > TF 1 ~\np . EE : :加 -: 日 4 1 +; : 1 ok\noF IBIS oc © ORD oy eel oo 1\n“\"v 多 1 ‘Duy pala 1 =_- rp , 5 rae Fi . ” , ! * ; , ARMY Ff el cae a as 7. FF fj f ,\n“一 See. . -和 - - a . . . . wo. “ -~ ane lee\n. 一 本 . ~<a » wwe \"tf | ‘\n: 人 _ - _ 4 - m=, , 、 * ”\n; -- ~ “ 一 一一 a — . 一 机 2 em 4\n-一 wot vey “ 四 we td oo E ae aan . 4 = <\n13",
      "source_file": "12_principles of railway safety engineering.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 5,
      "text": "IRSE News | Issue 267 | June 2020\nFigure 4 — Simplified\nstation fire panel\ninterface diagram : y\na er : lm\nzy 可 : To safe g\n多 2 floor 了\n| | | 上 ~ Actuator YC 】\nNow\n人 hear Be\n~ Gatelines .. ,\n四 本 this! Public\n. . , address ’ 4\nFault detection: We are dealing with real-life Failure handling: We can ensure that we can\nmechanical and electrical systems which will wear — handle failures well through:\nand fail. So we want to ensure that faults can be , , , ,\ni . . 。 Using known physical or electrical properties\ndetected and rectifed before any life-threatening gs\n, , , to ensure that should a fault occur, it fails to a\nsituation arises. We do this through: , .\nknown state (e.g. gravity returns a signal arm to\n。 Specifying appropriate testing and the stop position).\noy h d maintenance intervals and thresholds. 。 Provision of alarms or other warning indicators.\n; ow are azards 。 Where there are several similar items, these 。 Instructions for people to follow in the event\nidentified before can be compared to determine where their that something does go wrong.\nthey result in behaviour diverges. _ Hazard mitigation: Finally, given the system\naccidents?” 。 Provision of in-service self-diagnostic facilities. may fail in an unsafe way despite all the above\n。 For software, the use of watchdog timers or best efforts, we consider implementing other\nplausibility checks on data. measures to reduce the overall risk such as crash\nFault tolerance: Knowing that faults will occur, we | Worthiness of vehicles.\ncan design our systems to tolerate certain levels of Hazard identification and analysis\nfaults. Examples include: .\n- This is all good theory. But how are hazards\n¢ Redundancy: Providing more than one identified before they result in accidents? There\nchannel for the same information or control are three areas we need to consider:\nflow. A common approach in computer-\nbased systems is to have three computers 1. The functions the system has to perform.\nundertake the same calculation and a voting 2. The users of that system and how they are\nsystem checks that at least two of them agree. expected to interact with it.\nThis is known as a 2-out-of-3 voting system). 3. Interfaces with other systems.\nNote this protects against random hardware , ;\n, In order to do this, the system you are analysing\nfailures (one channel may fail) but not against\n. needs to be comprehensively defined and\nsystematic faults where there is a software . . -\n, understood. Consider the introduction of a\nfault which causes all three channels to ; .\nstation fire panel in an underground station as\nproduce the same wrong output. oo.\nshown in Figure 4.\n。 Diversity: This is similar to redundancy except\nthat the channels use different hardware The fire panel has one function: upon receipt\n(the 2-out-of-3 voting system uses different so they can perform their functions.\nmicroprocessors), functional diversity (e.g. In this example, there are three groups of people:\nautomatic braking, but with a driver on board firstly the one who presses the actuator who\nto act in case the automated system fails), may need some instruction or guidance on when\nmanufacturing diversity (procure the same to press the actuator and what to expect next;\nproduct but from different suppliers). secondly station staff who need training in the\n14",
      "source_file": "12_principles of railway safety engineering.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 6,
      "text": "IRSE News | Issue 267 | June 2020\nNo part of the intended result is achieved or the intended condition is absent\nMore (higher\nQualitative modification/increase (e.g. additional material)\nQualitative modification/decrease (e.g. only one of two components in a mixture)\nReverse/opposite Logical opposite of the design intent (e.g. backflow)\nComplete substitution, something completely different happens (e.g. wrong material)\nRelative to clock time\nRelative to clock time\nTable 1 — Hazard identification guidewords.\n5 Frequent Less than 1 year 1 in 6 months The event is likely to occur frequently\n(probably annually).\nProbable 1 year to 5 years The event is likely to occur often.\n5 years to 10 years 1 in 10 years The event is likely to occur several times.\n2 Remote 10 years to 100 years 1 in 50 years The event can be expected to occur\nduring the lifecycle.\nImprobable 100 years or greater 200 years The event is unlikely but may by exception occur.\nTable 2 - Likelihood categorisations.\nNegligible 0.001 Non-reportable injury\nMajor injury or multiple minor injuries\nSingle fatality or multiple major injuries. Equivalent to 1 CFS\n| 5 | Catastrophic | | Multiple fatalities\nTable 3 — Severity categorisations.\nevent of an alarm; thirdly members of the public representation from people who are experienced\nwho are expected to evacuate the station when in the system being considered, the environment\nthe alarm is activated. Designers and maintainers in which it will operate and how things might\nare also important for any system but are not go wrong. A HazlD involves systematically\nconsidered in this particular scenario. considering each function, each user operation\n. ; Fj te interf identified h of (or reaction in the case of members of the public)\nA HazlD involves Ve Separate Interlaces are laentined, €acn o and each interface. The conversation is seeded\n. which will have electrical, mechanical, physical with quidewords to encourage the meeting to\nsystematically and functional properties. These are: hi C bout h he f rag int 3\nconsidering each t ink a out how t e unction, user or interface\n。 1. The actuator input. might not work as intended. An example of\nfu netion, user 2.The fire damper which closes the damper to potential guidewords and their meanings are\noperation and restrict the flow of oxygen to a fire. shown in Table 1.\ninterface” 3. The ticket gates, designed to open to permit The workshop members can consider whether\nthe quick and safe exit of passengers. each deviation from intended operation represents\n4. Automated public address system which a genuine hazard. Once all reasonably foreseeable\ninitiates announcements alerting passengers to “hazards are identified, the hazards can be analysed\nthe need to evacuate the station. to determine their likelinood and severity of\n5 Lifts which t let outcome. This aids understanding of the risk\n” SW i. fe tle MOVE PEOple to a and enables effort to be focussed on those\nceme sate Noor. a with the highest risk. This analysis is often done\nIt is quite usual to hold a Hazard Identification qualitatively, and it is usual to see categorisations\n(or HazlID) workshop. It is important to get of likelihood and severity similar to Tables 2 and 3.\n15",
      "source_file": "12_principles of railway safety engineering.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 7,
      "text": "IRSE News | Issue 267 | June 2020\nMedium High High High High _Intolerable risk: Activity not\nMedium Medium High High High permitted. Hazard to be\navoided or reduced.\nLow Medium Medium High High Tolerable risk: Control measures\n\n2 | Remote Low Low Medium Medium High to reduce risk rating to a level\nwhich is as low as reasonably\npracticable (ALARP).\n\n1 Improbable Low Low Low Medium Medium Negligible or low risk: Control\nmeasures to be maintained and\nreviewed to control residual risk\nas far as reasonably practicable.\n\nTable 4 — Risk matrix. This allows a matrix of risk classification to be “.experience teaches us that society requires a\ndeveloped where particular combinations of cadre of concerned citizens — engineers foremost\nlikelinood and severity can yield a risk that is among them - to urge proper action and to\nintolerable, tolerable or negligible. An example is persist when rebuffed.\nshown in Table 4. ” . . .\n\nEngineers, being human, are also susceptible\nNote that all of the above tables are examples. to the drowsiness that comes in the absence of\nDifferent railway authorities may have different crisis. Perhaps one characteristic of a professional\ncategorisations and different acceptable levels is the ability and willingness to stay alert while\nof risk. All such categorisations and levels must others doze. Engineering responsibility should not\nbe justified, and this is typically done in a safety require the stimulation that comes in the wake\nplan. In extreme cases, likelinood and severity of catastrophe.”\nmay need to be calculated quantitatively; this is Staying alert requires the engineer to identify,\nmuch harder to do. ; __, .\nthen assess the risks arising from the works being\nNow the hazards are identified and their risk has undertaken. As engineers, we need to be alert\nbeen considered, safety measures can be designed to how the design will be operated and how\nto reduce those risks to a more acceptable level. the system will be maintained. We must foresee\nA project may need to bring together anumber of | changes in the operating environment that will\nrepresentatives to determine if a risk is acceptable affect the System s operation and consider how\nbased on proposed measures. that design will eventually be decommissioned.\nRisks can arise through many areas. This includes\n“There will Causes vs hazards the physical aspects, human behaviours, the\nalways be A common mistake in this process is to confuse processes which govern how tasks are performed,\n. . causes of hazards as hazards. This can result and the ability of people to perform a task when\nengineering in a long list of so-called hazards to manage, under pressure. Having assessed the risks, the\nfailures” increasing the time and cost involved to complete = engineer must design the system (consisting of\nthe design. Avoiding this confusion is achieved people and processes as well as the products\nby being clear about the functions of the system themselves) to mitigate against those risks.\nbeing developed, its users and its interfaces. This\nusually entails developing a diagram showing all About the author ...\nthe possible interfaces, making sure this includes\nthe human interactions as well as technical David is the professional head of discipline for\ninterfaces. In the fire panel example, the function Engineering Management in SNC-Lavalin Atkins\nof providing an alert to each of its interfaces could = Nd works to grow the skills and knowledge of\nhave a hazard of ‘No alert to the interfaces’. This those who provide the technical leadership of\ncould happen because the power supply to the projects. Beginning with an understanding of\npanel was faulty. The failing power supply is a the operational needs, he specifies, designs and\ncause of the hazard. changes railways to make them safe, operable\nand fit for purpose.\nBe alert! _ As a railway systems engineer with a broad\nSamuel C Florman was a Civil engineer who knowledge of rail systems, disciplines and\nstarted his career in the 1950s. In his book, “The operations, coupled with experience across the\nCivilised Engineer’ he writes (p149): whole development lifecycle, David has taken\n“There will always be engineering failures. projects from initial concept through design and\nBut the worst kinds of failures, the most development through to implementation.\ninexcusable, are those that could readily be He is currently working in the Engineering\nprevented if only people stayed alert and took Management Office of the East Coast\nreasonable precautions. Digital Programme, bringing digital railway\ntechniques to Network Rail’s main line from\nLondon to Edinburgh.\n16",
      "source_file": "12_principles of railway safety engineering.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    }
  ]
}