{
  "doc_id": "7fa8dcb9-83a0-4fb9-98c8-1526a20b707d",
  "pages": [
    {
      "page_number": 1,
      "text": "Questions forthe Certificate (Module A) will not be set on the text which has been\nstruck through but will be set on new reading list editions nos. 24, 25, 26 & 27\nEffective from October 2023 exam\nInterfaces and Interactions between Railway Control & Communications\nand Related Systems\nAn introduction for candidates taking Module A of the IRSE Professional Examination\nKimberley Chang, February 2021\nversion 2 - April 2023\nThe railway system is made up of various subsystems which interact to deliver the required outputs,\nnormally the movement of passengers and freight. The way these systems interact all have a role to\nplay in the safe and efficient running of the overall railway. Railway control and communications\nsystems are designed and operated whilst taking into account their interactions with related\nsystems. This article gives an overview of the interfaces and interactions between railway control\nand communications systems and the related subsystems in the railway environment.\nProminent subsystems are:\ne = Signalling;\ne Telecommunications;\ne Operations, including control centres, passenger information and public address systems;\ne Drivers;\ne Rolling stock;\ne Permanent way / track -including the rails, fasteners, sleepers and ballast / slab track as\nwell as on-track train detection & monitoring systems;\ne Civil Engineering structures, including bridges, tunnels and stations;\ne = Electric traction supply;\ne Electric power systems;\ne Evacuation systems.\nDuring the life of a railway system, changes will be made either to enhance its capacity and\ncapability, renew life expired assets or add new services. When making changes to one part of the\nsystem it is essential that the impacts of the change on other parts of the system are considered if\nthe overall system is to continue to perform its functions safely and correctly.\nInterfaces and Interactions with Operations\nControl Centres and Signallers\nThe railway is controlled by signallers at signalling control centres who input their instructions via a\ncontrol device, such as a computer screen, control panel or lever frame into the interlocking. After\nchecking the instructions are safe, the interlocking passes the instructions on to the trackside\ninfrastructure. It is important that the state of the infrastructure is feed back to the signaller in the\nform of indications on the computer display screen, indications panel, positions of the levers or by\nsimply looking out of the window!\nThe interfaces with the signaller are described in more detail in the Back to Basics Article “Operator\nInterfaces” (IRSE News, Issue 269, September 2020).\nTrain Describers\nTo set the correct route for a train, the signaller needs to know the identities of the individual trains\nas they enter, pass through and leave the control area. Each train is allocated a train reporting\nPage 1",
      "source_file": "22_Interfaces and Interactions between Railway Control v2.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 2,
      "text": "Interfaces and Interactions between Railway Control & Communications and Related Systems\nnumber, to identify the train. The train reporting number allocates each train a unique identity\nwhich may be based on a combination of the train type, destination, operating company and an\nidentity number.\nThe train reporting numbers are initially entered into the system by the operator, which may be a\nsignaller, or depot controller at the start of the train’s journey. The train describer then uses\ninformation from the interlocking about the status of the signalling system to “step” the train\nthrough the control area. At the fringes of the control area, the information is passed to adjacent\ntrain describers via a telecoms link.\nThe train reporting numbers can be manually altered, or interposed by a signaller if required. This\nmay occur when a train has reached the end of its timetabled service and needs to start a new one,\nwhen a train divides to form two separate services or two trains join to make one.\nThe train describer system is not safety critical, as the interlocking protects trains from unsafe\nmovements if a train is misrouted.\nPassenger Information & Public Address Systems\nA passenger information system delivers real-time information to passengers about the nature and\nstate of the railway. The customer interface usually consists of:\n\ne visual information display screens at stations and on trains;\n\ne audio announcements at stations and on trains;\n\ne mobile phone applications; and\n\ne railway operator or travel planner websites.\nPassenger information and automated public address systems usually take their inputs from the\ntrain describer and the timetable information to create real-time data. More information on\npassenger information systems can be found in the Back to Basics article “Telecoms Part 2” (IRSE\nNews, Issue 271, November 2020).\nInterfaces and Interactions with Drivers\nThere are several train-borne systems that perform the role of interfacing between the signalling\nsystem and the train driver.\nAutomatic Train Protection\nAutomatic train protection systems are designed to prevent or mitigate the consequences of trains\npassing signals at danger, over-speeding or overrunning buffer stops. Examples include: train stops\non metro systems, the Automatic Warning System used in UK and Australia, or the European Train\nControl System.\nAn automatic train protection system take information about the status of the signalling system,\nsuch as signal aspects, issued movement authorities or permissible speed information. The system\nautomatically intervenes if trains are travelling too quickly to safely stop at a signal at danger or\nbuffer stop, or decelerate sufficiently for a speed restriction. The intervention may consist of an\nalarm and/or visual indication in the driver’s cab, or go further and automatically apply the brakes\nuntil either the train has slowed sufficiently or stopped completely, depending on the system\ninstalled.\nAutomatic Train Operation\nAutomatic Train Operation is used to help automate the operation of trains and can vary in the\ndegree of automation offered. This varies from no automation at the lowest level, to full\nPage 2",
      "source_file": "22_Interfaces and Interactions between Railway Control v2.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 3,
      "text": "Interfaces and Interactions between Railway Control & Communications and Related Systems\nautomation, including starting and stopping of trains, operation of doors and handling of emergency\nsituations. It is primarily in use in metro systems, but is becoming more widespread on mainline\nrailways. Automatic Train Operation takes input from the signalling system to determine how far\nahead the line is clear, and trackside beacons that transmit brake commands to the train. The train’s\non-board computer calculates the required the braking curve to bring the train to a stand at the\ncorrect position in platforms or at junctions. The braking calculations are updated frequently to\nensure accuracy.\nDriver Advisory System\nThe driver advisory system aims to optimise the driving of the train, saving energy and improving\nperformance. The system consists of a control centre subsystem that evaluates timetable\ninformation and routing strategies, and sends the processed information to the train. The train’s on-\nboard subsystem uses this information to calculate energy efficient speed profiles to achieve train\ntimings and issues advice to the driver. Some of these systems are static, so the information is\nreceived by the on-board subsystem at the start of the journey, whilst others are connected to the\ncontrol centre subsystem during the journey and updated dynamically via radio.\nSecure Train to Signal Box Radio\nSecure train to signal box radio (including GSM-R) is used to communicate between the train and the\ncontrol centre. The driver is provided with an in-cab terminal which can be used to display and send\nmessages or voice communications between the driver and operational staff. More information on\nsecure train to signal box radio systems can be found in the Back to Basics article “Telecoms Part 1”\n(IRSE News, Issue 270, October 2020).\nInterfaces and Interactions with Rolling Stock\nBraking Characteristics\nThe braking characteristics of the rolling stock vary between train types, with some having much\nbetter braking performance, such as modern passenger trains, than others, such as heavy freight\ntrains. Signals are required to be positioned such that the space between the first caution signal and\na signal at danger is sufficient for all train types authorised to run that route, with sufficient warning\nto stop (plus a safety margin).\nIst caution signal at\nFF signal spacing —————————__>\nservice braking distance-———————>}<- s >}\ns = safety margin\n\nIn some cases, the signal spacing would allow for trains with better braking performance to run at\nhigher speeds than others, whilst still maintaining sufficient distances between signals. In these\ncases those trains may be permitted to travel at a higher speed.\nThe braking characteristics of the rolling stock authorised to run on a route also impact on signing of\nmaximum permissible speeds. Where there is a large reduction in maximum permissible speed,\nsufficient warnings for the speed reduction needs to be given for the trains to slow to the lower\nspeed. This may be via lineside signage, or restrictive signal aspects to force a train to slow down.\nPage 3",
      "source_file": "22_Interfaces and Interactions between Railway Control v2.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 4,
      "text": "Interfaces and Interactions between Railway Control & Communications and Related Systems\nThe braking characteristics of trains impact on the design and efficacy of automatic train protection\nsystems. Some train protection systems evaluate train speed against the distance to a speed\nrestriction or signal at danger and intervenes or sounds a warning if the train is travelling too quickly\nto brake sufficiently.\nFor trains fitted with in-cab signalling systems, movement authorities are issued via radio and\ndisplayed in the cab for the driver. The train’s on-board system calculates braking curves using speed\nrestriction information, train current position and speed, train braking characteristics and the\ndistance to the end of movement authority. The system warns the driver of possible over-speeding\nand may intervene by applying the brakes to slow the train if it is necessary.\nDefinition of Track Clearance Points\nWith track-based train detection systems, such as track circuits, treadles or axle counters, the\nposition of the train is determined by the positions of its wheels. At the front and rear of a train or\nlocomotive, there is an overhang between the end of the train and the nearest axle. At junctions or\nconflicts, the position of axle counters or insulated rail joints need to be positioned accounting for\nthe overhang so that the signalling system can detect a train fouling an adjacent line.\ndirection :\nof travel\n\nf everhong—e-s—> s - sofety margin\n\n# |\n\ntrack section\n\nclearance\npoint\nthe junction is detected by the signalling systern,\n\nInterfaces and Interactions with Permanent Way\nGradient\nGradients affect the ability of trains to accelerate or decelerate because gravity acts on the mass of\nthe train. The ability to maintain safe train separation needs to take gradient into account, which\naffects the lineside signal spacing or the limit of movement authority in in-cab signalling applications.\nWhere gradients are falling in the direction of travel (downhill), the spacing between signals needs\nto be increased to allow for longer braking distances. This is of particular importance for freight\ntrains. Where gradients are rising (uphill), the spacing between signals can be reduced due to\nshorter braking distances.\nPositioning a signal at the bottom or part way up a steep rising gradient should be avoided because\nof the time taken to accelerate and possible wheel slip during poor adhesion conditions. This is\nparticularly important for heavy freight trains or where trains may be required to stop frequently.\nPage 4",
      "source_file": "22_Interfaces and Interactions between Railway Control v2.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 5,
      "text": "Interfaces and Interactions between Railway Control & Communications and Related Systems\nIn metro systems, sometimes the stations are designed to be at the top of a rising gradient. This\nhelps to reduce braking effort to stop the train and the consequential heat generation from braking.\nCurvature and Cant\nTrack curvature impacts a train driver’s ability to see a signal, particularly in an urban environment\nor underground where there are considerably more obstructions. A straight alignment means that\ndrivers can see the signal from some distance away. This may also have its own problems,\nparticularly where there are shorter signal sections and it becomes possible for the driver to see\nseveral signals along the line of route and read one further away in error. This problem may be\nmitigated by adjusting the intensity and range of the signals so that signals that are further away\nappear less bright until the train is sufficiently close.\nAnother problem arises where there are several lines running in the same direction and it is difficult\nfor a driver to identify which line the signal applies to. This problem can be mitigated by placing\nsignals parallel to one another, by providing additional reading distance for the signals, or by\nmounting signals on the other side of the line to increase separation between signal aspects.\nCant is the slope of the track across the rails, where the outer rail of a curve is positioned higher\nthan the inner rail, providing a banked turn; thus allowing trains to move through the curve at a\nhigher speed than would otherwise be possible. This consequentially affects the maximum\npermissible speed on the line, signal spacing and required sighting distances. The cant can cause\nissues with cable routing or, at level crossings, uneven cross track profiles for road users.\nSwitches and Crossings\nSwitches and crossings, or sets of points, allow trains to change between lines or tracks. The switch\nis the part of a crossover that physically moves whereas the crossing is the fixed element of the\ncrossover. The blades of the switches are moved via a series of rods by electric point machines or\nhand-operated mechanical levers.\nA simple set of points consists of four rails. The two outside rails (stock rails) are fixed. The two\ninside rails (switch rails) can move from side to side at one end. For a train to safely pass through a\nset of points, one side of the switch must be physically touching the stock rail and the other switch\nrail must allow sufficient space for the train’s wheels to pass between it and the other stock rail.\nThe crossing section of a set of points is usually a cast lump of metal which allows breaks in the\nrunning rails sufficient to allow the flange of the wheels to cross the running rail of the other track. A\ncheck rail help keep the train’s wheels on the track where there is a risk that the train could move\nlaterally. The check rail simply guides the wheel by applying a barrier to the wheel.\nA common arrangement of points connects two parallel lines of a double track railway. This\ncombination is known as a ‘crossover’ and both point ends are often worked together under one\ncontrol so that they are always in correspondence with one another, that is, both set for the straight\nPage 5",
      "source_file": "22_Interfaces and Interactions between Railway Control v2.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": false,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 6,
      "text": "Interfaces and Interactions between Railway Control & Communications and Related Systems\nroute, or both set for the route over the crossover. Crossovers, and some other arrangements of\ncrossings are illustrated on the next page.\nFlat crossing, where two low speed lines cross.\nThere is no useable connection between the\nSimple crossover between two parallel lines.\ntwo lines.\nSwitch diamond, for higher speed junctions. Single slip, where two tracks cross and it is\nThere is no useable connection between the possible to move from one line to the other.\ntwo lines. Double slips have a slip on each side.\nPoint Machines\nPoints can be controlled by direct connection to a control lever, such as in a mechanical signal box or\nground frame, where the movement of the points are under the direct control of a human.\nMore commonly, the points are driven by a point machine, powered by an electric motor or\nhydraulic system, with the movements controlled by the interlocking. In both cases, when the points\nare in use, they are required to be locked in position, so that the points cannot be moved by the\nsignalling system or the vibration of the train. This is particularly important when they are facing\npoints and helps to prevent derailment and damage to the points.\nThe interlocking must know the position of the point blades, to check that the points are in the\ncorrect position for the safe movement of trains and have not failed or become obstructed. An\nindividual detector rod is attached between the point blades and point machine that proves the\nposition of the point blades by making the appropriate contacts within the point machine. If the\nblades are out by as little as a few millimetres, the rods will not be in the correct position and will\nprevent the contacts operating. The state of the contacts is fed back to the interlocking so that the\nsignalling system is aware of the lie of the points.\nOther types of point machine exist that apply locking and prove point lie in different ways, but the\nrequirement for locking and detection of points is essentially the same.\nCatch/Trap Points\nIt is sometimes necessary to derail a train deliberately to protect against potential collision with\nanother train.\nCatch points are designed to derail anything running against the normal direction of traffic, such as\nloose wagons that have no or ineffective brakes and have “run away”. The spring catch point\nconsists of one point blade, normally open in the derailing position. A train moving in the normal\ndirection will push the point blade closed against a spring and continue unimpeded. A train moving\nin the wrong direction will derail at the spring catch. Another type of catch point is the wide-to-\nPage 6",
      "source_file": "22_Interfaces and Interactions between Railway Control v2.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": false,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 7,
      "text": "Interfaces and Interactions between Railway Control & Communications and Related Systems\ngauge type, consisting of two switches that work in opposite directions with the switches either both\nopen or both closed. These are operated by the signalling system and a train travelling over these\npoints whilst in the open position will be derailed.\nTrap points protect lines from trains on adjacent lines that have passed a signal at danger, typically\nat the exit from sidings or freight loop lines. They are controlled by the interlocking, with locking and\ndetection of point lie fed back to the signalling system.\nJunctions\nWhere two railway lines meet, there is potential for conflict between trains. Signals, or limits of\nmovement authority are required close to junctions to prevent trains traversing the junction when it\nis not safe to do so and to authorise trains to traverse the junction when it is safe.\nSignals are usually placed with a safety margin (overlap) between the signal and any potential points\nof conflict to protect trains traversing the junction from a train overrunning one of the protecting\nsignals due to an error in braking judgement. It is undesirable for signals to be placed at very long\ndistances from the junctions because this would reduce the junction capacity due to the increased\ntime required for a train to clear the junction after being given a movement authority.\nTrack-Based Train Detection\nTrain detection systems are described in more detail in the Back to Basics Article “Train Detection –\nthe Basics” (IRSE News, Issue 261, December 2019).\nOther Rail-Mounted Equipment\nOther equipment than can be placed on the track/ between the rails includes:\n• Axle counters. These count the number of axles passing over a given point. They are\nclamped to one of the rails and their location can be constrained by, for example, the\npresence of check rails or third rails for traction power.\n• Train protection systems. There are many different systems, but all involve track mounted\nequipment sending information to the train by electrical, magnetic or physical means.\n• ETCS (European Train Control System), CBTC (Communications Based Train Control) and\nautomatic driving systems. These typically require equipment fixed to the sleepers between\nthe rails to transmit to or receive information from trains. The equipment can include\nbeacons or transmitters (often known as balises or transponders) and loops of cable.\nPage 7",
      "source_file": "22_Interfaces and Interactions between Railway Control v2.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": false,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 8,
      "text": "Interfaces and Interactions between Railway Control & Communications and Related Systems\n• Hot axle box detectors. These consist of infrared scanners that measure the abnormal levels\nof heat generated by failing bearings in axle boxes. Failed bearings cause the axle to seize\nand can cause derailment, so early detection is essential.\n• Other items can be fitted to the sleepers rather than the rails such as beacons for on board\ntrain announcements or speed restrictions and loops of cable for coded track circuits.\nInterfaces and Interactions with Civil Engineering Structures\nThere are many structures around a railway line, either forming part of the railway or forming the\nsurrounding environment. Sometimes the position, size or nature of those structures impact on how\nthe signalling system is designed, constructed, maintained or operated.\nTunnels, Viaducts and Bridges\nTunnels impact greatly on the ability to position signalling and telecoms equipment. Sometimes this\nis unavoidable, such as with the underground metro systems found in many cities worldwide. It is\npreferable for trains not to stop within tunnels or on viaducts due to the risks associated with\nevacuating a train in these places. Where reasonably practical to do so, signals are placed so that no\npart of the train is within a tunnel, viaduct, or anywhere else with limited clearance.\nTunnels and viaducts also present a challenge for the installation and maintenance of equipment,\ndue to difficult access for staff, particularly if the tunnel or viaduct is long.\nLimited clearance within tunnels can make it very difficult to place signals clear of the train’s\nkinematic envelope, and this is sometimes managed by using special, smaller tunnel signals.\nThe ability of a driver to see signals at the minimum reading distance can be adversely affected by\nthe walls of the tunnels, particularly if clearance within the tunnel is tight, or the tunnel is curved. It\ncan be difficult for a driver to see the aspect displayed by a signal against a sunlit background if it is\nplaced close to the exit of a tunnel, especially if the tunnel is long or narrow.\nBridges can also affect the ability of drivers to see signals immediately beyond it, as they may be\nobscured by the walls or span of the bridge.\nStations and Lineside Buildings\nIf a passenger train is stopped at a signal and any part of the train is within a station platform,\npassengers may attempt to board or alight the train. This is a particular problem if the train’s doors\nare not centrally locked. For this reason, stop signals are generally either positioned at the end of\nplatforms or at least a train length beyond the end of the platform. Signals placed at the platform\nends are preferably 20-25m from the stopping position of the train so that they can easily be seen by\nthe driver when the train is stationary.\nA driver must be able to read, interpret and understand a signal aspect for a sufficient distance on\nthe approach. However, buildings, platform furniture, waiting shelters, canopies and passenger\nstanding on the platforms can adversely affect this, particularly if the platform is curved. To aid the\ndriver, an additional signal can be provided on the approach to the station, or part-way along the\nplatform to give the driver an early indication of the next signal aspect.\nThe proximity of platforms to the railway line can make installation, inspection and maintenance of\nlineside equipment difficult. Where practical to do to, equipment such as train detection equipment\nare placed clear of the platforms so that staff can work on equipment in a position of safety.\nPage 8",
      "source_file": "22_Interfaces and Interactions between Railway Control v2.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": false,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 9,
      "text": "Interfaces and Interactions between Railway Control & Communications and Related Systems\n\nIn built up residential areas, where noise may be a problem for residents nearby, unnecessary\nrailway-related noise must be kept to a minimum. The audible alarms on level crossings may sound\nat a lower level at night, or restrictions on the use of train horns on the approach to footpath\ncrossings may be imposed, enforced by signage or regional / national operating instructions.\n\nOther Limitations on Signalling Equipment\n\nOther structures that can also impact on the sighting of lineside signals include electrification\ngantries, large signal gantries or pipe bridges.\n\nTrains should not stop on level crossings unless it is unavoidable, so signals need to be positioned so\nthat they would not cause a train to obstruct the crossing when standing at the signal. Vandalism is\nalso a risk at level crossings, so all equipment should be a sufficient distance from the crossing,\nideally placed beyond security gates and anti-trespass guards / devices.\n\nInterfaces and Interactions with Electrification and Power Systems\nTraction Power Supplies\n\nTraction power is delivered by means of an overhead wire or at ground level via a third (live) rail\nclose to the running rails, and collected by the train by a roof-mounted pantograph or rail-level pick-\nup shoe. To create a complete circuit, there is a traction return, which can take several forms.\n\nThird or Fourth Rail Electrification\n\nWhere traction power is delivered by a third rail, the return current is carried by the running rails, or\nalternatively via a fourth conducting rail. The latter mechanism can be seen in the London\nUnderground or Milan Metro.\n\nOne of the difficulties with using one of the running rails for traction return is that the running rail\nmay also form part of the signalling train detection circuits. In this case there is the need for the\nsignalling equipment to be able to distinguish between the traction current and the track circuit\ncurrent. Train detection boundaries must also allow the traction return current to flow past the\nboundary to the next track section, but prevent the flow of track circuit current across the boundary.\nFor more information on how this is achieved, refer to the Back to Basics article “Train Detection —\nthe Basics” (IRSE News, Issue 261, December 2019).\n\nOverhead Line Electrification\n\nEarly versions of overhead line electrification also used the running rails to carry the traction return\ncurrent. A major issue with this is that any conductor carrying a current generates a magnetic field\nthat can induce a voltage in nearby cables, particularly if they run alongside the conductor for great\ndistances, as is often the case with signalling and telecoms cables. To overcome this, the running\nrails can be electrically bonded so that the return current is shared amongst all running rails in the\nvicinity, reducing the current in each individual rail. This reduces the level of electromagnetic\ninterference in the signalling and telecoms cables. An advantage of this is that traction current takes\nmultiple paths so, in the event of a rail break, the traction return can return to its source by an\nalternative path.\n\nTo reduce the amount of electromagnetic interference, a dedicated return conductor wire is\nprovided, running parallel to the overhead line at approximately the same height. The return\nconductor is bonded to the running rails so that it carries some of the traction return current. The\ncurrent in the return conductor flows in the opposite direction to the overhead line, so the\nelectromagnetic fields generated by the return conductor partially cancels that generated by the\nPage 9",
      "source_file": "22_Interfaces and Interactions between Railway Control v2.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 10,
      "text": "Interfaces and Interactions between Railway Control & Communications and Related Systems\noverhead line. The current carried by the return conductor is weaker than the overhead lines, so\nthere is still potential for interference in the lineside signalling and telecoms cables.\nElectromagnetic interference in lineside cables can be reduced further by using booster\ntransformers, which force nearly all of the traction return current from the rails to the return\nconductor. This increases the distance between potential sources of electromagnetic interference\nand other lineside cables, and consequently reduces the level of interference between them.\nNeutral Sections\n\nSources of traction power (feeder stations) need to be electrically insulated from one another, so a\nneutral section is provided where no traction power is supplied. This is sufficiently long to ensure\nthat no train can be electrically connected to two separate supplies simultaneously, but not so long\nthat a train will not have enough energy to reach the next live section.\n\nIt is important that the signalling system is designed such that no train ever comes to a stand within\na neutral section, as any electric train would not be able to accelerate away again.\n\nImmunisation\n\nThe effects of induction in signalling circuits can be limited by designing the signalling circuits and\nequipment to be immune from the unwanted currents. This is particularly important in the design of\ntrain detection systems where track circuits are used. In areas of AC electrification, DC track circuits\nmay be used, and vice versa. Alternatively, AC track circuits can be used that have no harmonics in\ncommon with the traction current, enabling the track circuit receiver to distinguish between the\ntrack circuit current and any traction current that may be present in the rails.\n\nSignal Sighting\n\nOverhead line equipment can affect the ability of a train driver to read and interpret lineside signals\nand signs when they are obscured by equipment, even if just momentarily. This is a particular\nproblem where overhead line masts are on the inside of curves and may be overcome with the use\nof cantilever structures for the overhead line masts or alterations to the positions of signals and\nlineside signs.\n\nEquipotential Bonding and Earthing\n\nTo protect lineside signalling equipment against contact with the traction supply, either directly,\nsuch as when overhead wires come down, or indirectly, such as when other equipment is made live\nby an electrical fault, signalling equipment is bonded to earth.\n\nIn areas electrified by overhead line, any metal equipment beneath or near the overhead line is\nbonded to a running rail carrying traction return current so that if the wires carrying the traction\ncurrent were to fall, the equipment is earthed via the running rail, protecting the equipment from\ndamage and staff and public from electric shock.\n\nIn third/fourth rail electrified and non-electrified areas it is not usual practice to bond all metal\nstructures to the traction return rail.\n\nSignalling & Telecoms Power Supplies\n\nSignalling and telecoms power supplies must provide a constant, stable supply for the correct\noperation of equipment. It must also be safe for the staff to work on, with measures in place to\nprotect staff and the public from electric shock under fault conditions.\n\nSignalling equipment within apparatus cases must be earthed to protect staff and equipment from\nelectric shock from contact with exposed conductive parts, such as circuitry, and other conductive\nPage 10",
      "source_file": "22_Interfaces and Interactions between Railway Control v2.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 11,
      "text": "Interfaces and Interactions between Railway Control & Communications and Related Systems\n\nparts that could be made live by an electrical fault. Other protective measures include enclosing high\nvoltage equipment in insulated units, providing insulated covers for live parts or insulating\nconductors.\n\nSignalling and telecoms equipment is commonly powered by a dedicated supply, and may be backed\nup by an uninterruptible power supply in case of failure of the supply point, to allow time to change\nto an alternative supply.\n\nInterfaces and Interactions with Evacuation Systems\n\nSignalling systems must be designed to minimise the risks associated with emergency evacuation of\ntrains or railway infrastructure. The system should be designed to minimise the risk that an\nevacuation takes place in an area where it is difficult for passengers to exit a stricken train. It is also\nimportant that access to the site is possible for emergency services and rescue teams to provide\nassistance. For this reason, signals within tunnels, viaducts or steep cuttings are avoided if practical\nto do so.\n\nThe signalling system may also be required to respond quickly to protect a hazard, such as a train\ncrash or fire. In many cases, trains involved in an incident may already be protected by the signalling\nsystem. However, there may be a requirement for passengers to exit the train in a hazardous area\n(or indeed they may do it contrary to instructions) and the signaller will require a mechanism for\nprotecting the site — by replacing all signals in the area to danger or sending an “all trains stop”\ncommand via the radio, for example. Emergency communication and signalling intervention is\nessential to prevent further problems or disaster.\n\nPage 11",
      "source_file": "22_Interfaces and Interactions between Railway Control v2.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    }
  ]
}