{
  "doc_id": "8ad0e8f5-4e25-439b-97d4-6612dafe310f",
  "pages": [
    {
      "page_number": 1,
      "text": "Rail Accident Investigation Branch\nRail Accident R rt\n. “Th ; -\n(3 i! 7 、 —s\nee BREE ge aps pe | 7\n. . cad . . , re , et we re? . —_ me < — So eet ef\na a a a a\nPassenger train collision with a derailed\na\nlocomotive at Bromsgrove\n23 March 2020\nReport 14/2020\nNovember 2020",
      "source_file": "R142020_201119_Bromsgrove_23032020.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 2,
      "text": "This investigation was carried out in accordance with:\n\ne the Railway Safety Directive 2004/49/EC\n\ne the Railways and Transport Safety Act 2003\n\ne the Railways (Accident Investigation and Reporting) Regulations 2005.\n\n© Crown copyright 2020\n\nYou may re-use this document/publication (not including departmental or agency logos) free of charge\nin any format or medium. You must re-use it accurately and not in a misleading context. The material\nmust be acknowledged as Crown copyright and you must give the title of the source publication.\nWhere we have identified any third party copyright material you will need to obtain permission from the\ncopyright holders concerned. This document/publication is also available at www.gov.uk/raib.\n\nAny enquiries about this publication should be sent to:\n\nRAIB Email: enquiries@raib.gov.uk\n\nThe Wharf Telephone: 01332 253300\n\nStores Road Website: www.gov.uk/raib\n\nDerby UK\n\nDE21 4BA\n\nThis report is published by the Rail Accident Investigation Branch, Department for Transport.",
      "source_file": "R142020_201119_Bromsgrove_23032020.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 3,
      "text": "Preface g\n2\na\n\nThe purpose of a Rail Accident Investigation Branch (RAIB) investigation is to\n\nimprove railway safety by preventing future railway accidents or by mitigating their\n\nconsequences. It is not the purpose of such an investigation to establish blame or\n\nliability. Accordingly, it is inappropriate that RAIB reports should be used to assign\n\nfault or blame, or determine liability, since neither the investigation nor the reporting\n\nprocess has been undertaken for that purpose.\n\nRAIB’s findings are based on its own evaluation of the evidence that was available at\n\nthe time of the investigation and are intended to explain what happened, and why, in a\n\nfair and unbiased manner.\n\nWhere RAIB has described a factor as being linked to cause and the term is\n\nunqualified, this means that RAIB has satisfied itself that the evidence supports both\n\nthe presence of the factor and its direct relevance to the causation of the accident or\n\nincident that is being investigated. However, where RAIB is less confident about the\n\nexistence of a factor, or its role in the causation of the accident or incident, RAIB will\n\nqualify its findings by use of words such as ‘probable’ or ‘possible’, as appropriate.\n\nWhere there is more than one potential explanation RAIB may describe one factor as\n\nbeing ‘more’ or ‘less’ likely than the other.\n\nIn some cases factors are described as ‘underlying’. Such factors are also relevant\n\nto the causation of the accident or incident but are associated with the underlying\n\nmanagement arrangements or organisational issues (Such as working culture).\n\nWhere necessary, words such as ‘probable’ or ‘possible’ can also be used to qualify\n\n‘underlying factor’.\n\nUse of the word ‘probable’ means that, although it is considered highly likely that the\n\nfactor applied, some small element of uncertainty remains. Use of the word ‘possible’\n\nmeans that, although there is some evidence that supports this factor, there remains a\n\nmore significant degree of uncertainty.\n\nAn ‘observation’ is a safety issue discovered as part of the investigation that is not\n\nconsidered to be causal or underlying to the accident or incident being investigated,\n\nbut does deserve scrutiny because of a perceived potential for safety learning.\n\nThe above terms are intended to assist readers’ interpretation of the report, and to\n\nprovide suitable explanations where uncertainty remains. The report should therefore\n\nbe interpreted as the view of RAIB, expressed with the sole purpose of improving\n\nrailway safety.\n\nAny information about casualties is based on figures provided to RAIB from various\n\nsources. Considerations of personal privacy may mean that not all of the actual\n\neffects of the event are recorded in the report. RAIB recognises that sudden\n\nunexpected events can have both short- and long-term consequences for the physical\n\nand/or mental health of people who were involved, both directly and indirectly, in what\n\nhappened.\n\nRAIB’s investigation (including its scope, methods, conclusions and recommendations)\n\nis independent of any inquest or fatal accident inquiry, and all other investigations,\n\nincluding those carried out by the safety authority, police or railway industry.\n\nReport 14/2020 November 2020\n\nBromsgrove",
      "source_file": "R142020_201119_Bromsgrove_23032020.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 4,
      "text": "This page is intentionally left blank\nReport 14/2020 November 2020\nBromsgrove",
      "source_file": "R142020_201119_Bromsgrove_23032020.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 5,
      "text": "Passenger train collision with a derailed\nlocomotive at Bromsgrove, 23 March 2020\nContents\nPreface 3\nSummary 7\nIntroduction 8\nDefinitions 8\nThe accident 9\nSummary of the accident 9\nContext 9\nThe sequence of events 14\nAnalysis 18\nIdentification of the immediate cause 18\nIdentification of causal factors 18\nObservation 25\nPrevious occurrences of a similar character 25\nSummary of conclusions 26\nImmediate cause 26\nCausal factors 26\nAdditional observation 26\nRecommendation and learning points 27\nRecommendation 27\nLearning points 27\nAppendices 28\nAppendix A - Glossary of abbreviations and acronyms 28\nAppendix B - Investigation details 29\nReport 14/2020 5 November 2020\nBromsgrove",
      "source_file": "R142020_201119_Bromsgrove_23032020.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 6,
      "text": "This page is intentionally left blank\nReport 14/2020 6 November 2020\nBromsgrove",
      "source_file": "R142020_201119_Bromsgrove_23032020.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": false,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 7,
      "text": "Summary\n=\n=\na\n\nAt about 22:44 hrs on Monday 23 March 2020, the 21:05 Cardiff Central to\n\nBirmingham New Street service collided with a class 66 locomotive that had derailed\n\nat the end of a siding, south of Bromsgrove station. The passenger train suffered\n\nsignificant damage along one side of all three vehicles, although it did not derail. There\n\nwere four passengers and two crew on board the passenger train and none reported\n\nany injuries.\n\nThe locomotive had just arrived in the siding and was to act as a ‘banking’ locomotive,\n\nassisting heavy freight trains up the 1 in 37 Lickey incline, to the north of Bromsgrove\n\nstation. It derailed after running through the buffer stop at the end of the siding and\n\ncame to rest fouling the main line. The driver of the locomotive was not injured in the\n\ncollision, although the locomotive suffered damage to the corner of the leading cab.\n\nThe driver did not stop the locomotive before it reached the buffer stop because he\n\nbecame distracted from the driving task by personal issues arising from the national\n\nCOVID-19 lockdown announced earlier that evening.\n\nThe collision occurred because there was insufficient time between the locomotive\n\nderailment and the passenger train’s arrival for the alarm to be raised and the\n\npassenger train to be stopped.\n\nRAIB has made one recommendation to Network Rail to review its processes and\n\nstandards for managing buffer stop collision risk on non-platform terminal tracks.\n\nRAIB has also identified three learning points for drivers, relating to compliance with\n\nmobile phone policies in the driving cab, informing signallers of accidents and safe exit\n\nfrom trains during an incident.\n\nReport 14/2020 7 November 2020\n\nBromsgrove",
      "source_file": "R142020_201119_Bromsgrove_23032020.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 8,
      "text": "=I Introduction\n2\n3\n2 Definitions\n1 Metric units are used in this report, except when it is normal railway practice to\ngive speeds and locations in imperial units. Where appropriate the equivalent\nmetric value is also given. Railway mileages are referenced to a zero point at\nLondon Road Junction in Derby. ‘Left’ and ‘right’ are relative to the direction of\ntravel of the vehicle being referred to.\n2 The report contains abbreviations explained in Appendix A. Sources of evidence\nused in the investigation are listed in Appendix B.\nReport 14/2020 8 November 2020\nBromsgrove",
      "source_file": "R142020_201119_Bromsgrove_23032020.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 9,
      "text": "The accident S\n3\nOo\noO\no\nSummary of the accident 上\n3 At about 22:44 hrs on Monday 23 March 2020, a locomotive collided with the\nbuffer stop at the end of a siding about 700 metres south of Bromsgrove station.\nThe locomotive derailed and came to a stop foul of the adjacent main line. Less\nthan a minute later, a northbound passenger train collided with the corner of the\nlocomotive, but did not derail. The passenger train came to a stop between the\nlocomotive and Bromsgrove station.\n4 No-one was hurt.\n5 The passenger train suffered extensive damage to one side of all three vehicles.\nThe front left corner of the leading vehicle was particularly damaged in the area\nof the driver’s door. The locomotive suffered damage to the front left corner of the\nleading cab. There was also damage to the underside of the locomotive and this\nresulted in a diesel fuel spill during recovery (figure 1).\n6 The buffer stop, and the associated track at the end of the siding, was also\ndamaged during the collision.\nPA eR ae 四 a Z is\npo AN ¥ | Ss i {ce | \\\" |\neee ¥ a ae Aen - Nea : 2 下\n一 De ; EO ay tg Ses aries “9\n加RS an\n— ; CA > RS i NS _\na. Seay AGI Uy eon ae am\nFigure 1: The locomotive and the passenger train after the accident (second image courtesy of\nCrossCountry)\nContext\nLocation\n7 The accident occurred at 56 miles and 8 chains, at the end of the up Bromsgrove\nneck siding, about 700 metres to the south of Bromsgrove station on the Bristol\nto Birmingham main line (figures 2 and 3). This is a siding which is routinely used\nby locomotives waiting to assist heavy freight trains up the 1:37 Lickey incline,\na practice referred to as ‘banking’. The siding runs parallel to the up Gloucester\nmain line and ends at a buffer stop.\nReport 14/2020 9 November 2020\nBromsgrove",
      "source_file": "R142020_201119_Bromsgrove_23032020.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 10,
      "text": "了 本 ee eee oe cere ak ee Ae tee, a\n© ie Cg eee Be ee” lta aa pe AE} ay, Cas ae\n全 大ra we oe a pave 区 _ Beighem “ oh Egy at 全 ) Recon Se ae) ea Ne Fa Org LES Jie ee ES « _ va\n° y Bee Joe Sg fe es 和\nS ‘As A 5 NEST inn oR eae ete ee ye” meee oie ys pose SON\n® ee os RE Lest Ns ro re Leen oka]! Sh,\n3 BY dws SA. Se NaN ORE ea Fate “Lee. OY nati\n> ® at 7 ue ar ay 4 cee TSS, bey ens Bow: fry Mires SEO ON ae Shee\nwoe 1 SA pale CLA ff Neaivecncichy Ne Pane\n人 7 V dan {gre 多 6 EY wr ; .他 as oe . v 4 POR Ge eS ail] inal If JF — of\n. eas > ! j Park on fé og Paige Te nes ve BPRS AAA c Ignet a. | ve 及 are ke\nPa, 1 a a a ee ae EON GR 2 Po REO Se dS LINE Been\ni j SS Te a | over cas Ba ad LP 90 Wee 多 comme] 1 ASE ayo eas\n地 vo Pe wae: De Buscnove Zo\" 8 , ee De eee\n‘, 2 4上 aed | Net ahd 2% x oa hers aX stan Mee % ypwer KS oi. es . cone. 2 “ . rye\nei . 加 ger op 93 , SR Sens | FS ake, . 六 ~~ &\ni. nd NS\n了区 eee — FS NS , FF CEO TSEC L坟 RAR ae” = WB étore ow gs? E Ne BEN OSS, dy \\ anion\n& a ae Te a AS eS Re me ae ener. SRY FR fgg REN eet\n本 fo Bhs eee AeA f ley oN A pe oy ol J\noa . 1 wo 4 - NO =: BAUS SO CRATE a . A e pb ae a 33\n4 oe ~ 以 oS re) We 人 Eg ee ras & . . } , 1h fetrom Vibe?\na Rae. J. Os 一 La Location of accident [oe Snes\nOy ne eee Sense nc ge: AR和 Be a ee\nPi iia ie A es 1 a Be, LT Oe. 本 Stoke «| ae uP ae Oke? pr. “ NS SS fw RS BT tag AN cam\n“KY Ae ACen dae Anal + ee Veep ele ae ces.\naie it i ny ae pa a Ss am sane Pp is. _s ere ne Pot 8\na | yer “og NA EY Beals Aaron Ne f se SN ere - re) Bs\nBe eB ON NT Je ae eae a “BE =a. a os eT pe\nMr\narg rant Crores 全 oa Nae meee iy PHN ain VN Sa im FES a de® 4 : 和 Bentley Si co. hag a: PbS. So, | es tee °\nFigure 2: Extract from Ordnance Survey map showing location of accident\nLickey incline Bromsgrove To Bristol\nDown Gloucester\n-全 Down Gloucester =\nown Bromsgrove station loop\n-一 NT ores VT =e 3\nTo Birmingham Up Bromsgrove loop\nUp Bromsgrove neck\nBromsgrove Bromsgrove\nNorth Junction South Junction\nprs Not to scale\nN Some lines and features omitted for clarity\nFigure 3: Track layout at Bromsgrove, showing the route of both trains\n8 At this location, the maximum permitted speed on the up Gloucester main line is\n90 mph (144 km/h). The maximum permitted speed on the up Bromsgrove neck\nsiding is 15 mph (24 km/h). The siding and main line are on a downhill gradient of\n1 in 283 and a gentle right-hand curve, in the direction of travel of the locomotive.\n9 _ The signalling in the area is controlled from the Bromsgrove workstation which\nis located at the West Midlands Signalling Centre. Although the line from\nBirmingham as far as Bromsgrove station is electrified, the location of the\naccident is beyond the end of the electrified area.\nOrganisations involved\n10 DB Cargo (UK) Limited was the owner and operator of the locomotive and the\nemployer of the locomotive driver.\n11. XC Trains Limited (trading as CrossCountry) was the operator of the passenger\ntrain and the employer of the staff on board it.\n12 Network Rail is the owner and maintainer of the railway infrastructure, including\nthe siding and buffer stop.\nReport 14/2020 10 November 2020\nBromsgrove",
      "source_file": "R142020_201119_Bromsgrove_23032020.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 11,
      "text": "13 DB Cargo, CrossCountry and Network Rail all freely co-operated with the 5\ninvestigation. 3\nTrains involved\nThe locomotive F\n\n14 The diesel locomotive that derailed, 66057, was part of a small sub-fleet of class\n66 locomotives that had been modified to undertake banking duties on the Lickey\nincline. A banking locomotive is moved against, and sometimes coupled to, the\nrear of trains requiring assistance, in Bromsgrove station (paragraph 7), before\nhelping to provide power up the incline. If the banking locomotive has coupled\nto the train, a remote coupler release is operated, disconnecting it on the move,\nwhen the train has reached the top of the incline. The train then continues, and\nthe banking locomotive returns down the incline to Bromsgrove, ready for further\nduties.\n\n15 On the night of the accident the locomotive was due to bank its first freight train\nfrom Bromsgrove at around midnight.\n\nThe passenger train\n\n16 The passenger train was a three-car class 170 ‘Turbostar’ diesel multiple unit,\nnumber 170107. CrossCountry reported that there were 4 passengers on board at\nthe time, including an off-duty DB Cargo driver, as well as two train crew.\n\n17 It was operating service 1M87,' the 21:05 hrs train from Cardiff Central to\nBirmingham New Street. The train had left Worcestershire Parkway station about\n12 minutes before reaching Bromsgrove, and was running about 2 minutes late.\nIts next scheduled stop was at Birmingham New Street.\n\nRail equipment/systems involved\n\n18 The buffer stop consisted of a metal framework that was fixed to the jointed rails.\nIt did not contain any sliding friction elements or hydraulic buffers. It was fitted\nwith two permanently illuminated red lights (figure 4).\n\n19 The buffer stop was installed in its current location (figure 5) around 2004, as\nidentified from historic satellite imagery. Prior to this, the siding had ended ina\nbuffer stop located about 90 metres further south.\n\nStaff involved\n\n20 The driver of the locomotive had worked on the railway for 18 years, with\n14 of those driving for DB Cargo and its predecessors. He held the relevant\ncompetencies for driving class 66 locomotives and his route knowledge for the\nroute to Bromsgrove was up-to-date. He regularly worked this shift, operating the\nbanking locomotive to and from Bromsgrove. DB Cargo stated that there were no\nsignificant safety-related incidents on the driver’s record.\n\n21 The driver of the passenger train had been driving trains for 44 years.\nCrossCountry reported that there were no significant safety-related incidents on\nhis record.\n\n1An alphanumeric code, known as the ‘train reporting number’, is allocated to every train operating on Network Rail\n\ninfrastructure.\n\nReport 14/2020 11 November 2020\n\nBromsgrove",
      "source_file": "R142020_201119_Bromsgrove_23032020.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 12,
      "text": "一\n了了\n@\n© ,\nre)\nQ, :\n2.\n@\n=\n人\n‘\n”ae\nUp Gloucester line\nFigure 4: Up Bromsgrove neck buffer stop (image\ncourtesy of CrossCountry)\nFigure 5: Location of the buffer stop (image courtesy of Network Rail)\nReport 14/2020 12 November 2020\nBromsgrove",
      "source_file": "R142020_201119_Bromsgrove_23032020.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 13,
      "text": "External circumstances 5\n22 It was dark at the time of the accident. The weather was clear and dry, with 3\n\ntemperatures of between 2°C and 4°C recorded at local weather stations. ©\n23 There was very little local illumination and no significant sources of noise nearby. 二\n24 ltis possible that if the accident had occurred during the hours of daylight, the\n\ndriver might have seen the locomotive slightly earlier, and been able to reduce the\n\ncollision speed a little. However, there is no evidence to suggest that any other\n\nexternal circumstances affected the accident.\nReport 14/2020 13 November 2020\nBromsgrove",
      "source_file": "R142020_201119_Bromsgrove_23032020.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 14,
      "text": "了 The sequence of events\n\n”\n\n:\n\n5 Events preceding the accident\n\n9 25 The locomotive driver had last worked on the previous Saturday, two days before\n2 the accident. He worked the night shift, getting home at around 08:30 hrs on the\n3 Sunday morning, and rested until about midday. He spent the rest of the day at\n8 home, going to bed at around 23:30 hrs.\n\n26 He woke at about 08:00 hrs on the Monday morning and did not try to sleep\nduring the day.\n\n27 At 20:30 hrs, the driver watched the Prime Minister make a statement on\ntelevision relating to the COVID-19 pandemic. This was the statement which\ninstructed people to stay at home, except for limited, predefined reasons, and that\nno-one was allowed to meet with friends or family unless they lived in the same\nhousehold. Immediately after watching this broadcast, the locomotive driver set\noff to work, which was a 20-minute drive away.\n\n28 While en-route to work, the driver received a phone call from a family\nmember and there was a worried discussion about what the earlier televised\nannouncement would mean for his childcare arrangements.\n\n29 The driver arrived at Bescot yard, near Walsall, and booked on punctually, by\ntelephone, at 21:11 hrs. He prepared the locomotive and departed at 21:32 hrs.\nAlthough this departure was 27 minutes behind the published schedule, the\ntimetable for the journey was such that it was possible to recover this time before\nBromsgrove. The locomotive travelled via the Sutton Park line before being\nstopped for a few minutes at a red signal at Castle Bromwich curve. At 22:07 hrs,\nafter the signal cleared, the driver took the locomotive towards Bromsgrove via St\nAndrews Junction and Kings Norton.\n\n30 After passing Kings Norton, over a period of 11 minutes, the driver received three\ntext messages on his personal mobile phone. These were from the same family\nmember as the earlier phone call and all related to concerns about childcare\nand the closure of schools. The driver sent four text message replies to these. At\n22:38 hrs he received a picture message showing advice from the school relating\nto school provision, and he sent a text reply. Table 1 and figure 6 show details\nof these timings and the approximate locations at which the messages were\nreceived.\n\nReport 14/2020 14 November 2020\n\nBromsgrove",
      "source_file": "R142020_201119_Bromsgrove_23032020.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 15,
      "text": "Approximate Location 和\n22:24 Kings Heath (44.5 miles)\n22:28 | Text reply sent After Kings Norton (47.5 miles) Q\n22:29 Northfield (48 miles) 5\n22:31 | Text reply sent Longbridge (49 miles) S\n22:34 | Text reply sent Barnt Green (51.5 miles) 8\n22:35 After Barnt Green (52 miles) 广\n22:36 | Text reply sent M42 overbridge (53 miles)\n\n22:38 | Picture (of text) message received | Blackwell Road (53.5 miles)\n22:38 | Text reply sent After Blackwell Road (54 miles)\n2242 |- ~~~ | Bromsgrove station signal\n22:43 |- | Buffer stop\n2 | olision with passenger train\n\nTable 1: Detail of message timings on mobile phone, along with later events\n\n31 The locomotive passed signal BA3611 at 22:39:51 hrs at 38 mph (61 km/h), and\nwas routed from the down Gloucester line to the up Gloucester and then onto the\nup Bromsgrove loop through the station (figure 3). The train was only two minutes\nbehind schedule arriving in the station.\n\n32 The driver slowed the locomotive for the approach to signal BA7623, at the south\nend of the platforms in Bromsgrove station. This signal is approach controlled,\nmeaning that it was held at red for a fixed length of time as the train approached\nit, before it cleared to a proceed aspect. This feature is intended to ensure that\nthe speed of approaching trains is reduced, because of a speed restriction on\nthe route beyond the signal. The signal is also fitted with the Train Protection and\nWarning System (TPWS) which will automatically stop any train passing it at red.\nAt 22:42:01 hrs, when signal BA7623 cleared to a proceed aspect, with a route\nset for the up Bromsgrove neck, the driver released the brake and applied a low\npower demand. The train passed the signal at 6 mph (10 km/h).\n\n33 After passing the signal, the driver's thoughts returned to the picture message\nthat he had received at 22:38 hrs (paragraph 30). At 22:42:43 hrs, while travelling\nat 18 mph (29 km/h), he shut off the power, returning the controller to neutral. At\nthis point the locomotive was travelling at less than the maximum permitted speed\nof 30 mph (48 km/h) for the first 350 metres towards the up Bromsgrove neck,\nalthough this limit subsequently reduced to 15 mph (24 km/h) for the last 350\nmetres along the siding itself.\n\nEvents during the accident\n\n34 The locomotive coasted for 52 seconds towards and into the up Bromsgrove\nneck. The locomotive’s speed gradually increased on the 1 in 283 downhill\ngradient from 18 mph (29 km/h) to 23 mph (37 km/h).\n\n35 At 22:43:35 hrs, and with the locomotive 40 metres from the buffer stop, the driver\nbecame aware of where he was and made an immediate, full application of the\nlocomotive’s brakes. Four seconds later, the locomotive collided with the buffer\nstop at approximately 21 mph (34 km/h).\n\nReport 14/2020 15 November 2020\n\nBromsgrove",
      "source_file": "R142020_201119_Bromsgrove_23032020.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 16,
      "text": "PS ee Cee Gee ee oS ae OR ak\n3 2 上 ear ater SS. a Swe A, KA BO WOE\nSy - oe ave > Pi ee eid! Sez, ws YES Cur + 4 3 AR + SEN* 民有| 二一\na 一-从 vs “HEE SEY Wage } SNUG. Cemy = yy, RAGN ai NG\n: oer Renee oS ee ee Ae es\n2 和 a RY ne x 4 y eel | one z Green ZAWYA Wor D, <) ay Bea \\N\\ SN 4\n人D ae : 好 BS 四 : Se a oe ey Ts Ps we 9 。 SS or Woodcock Wp SS KR Z \\ \\ Bs : NZ 4 f\nNe ee a ae ae\no AP IA: ise Lowet INey Sf ore人NI oO SY) ae “eae nley EN 5 Naas a | ea PStirciey2 of\n@ | ey eee, | od eee roe A AS a 人 FEES he a sts Oe\n5 fxs &.. oR ev nO 81-25 aod eee J od = : ae\n了 an pars, eee Messages received eo he 5 eg 元 站 oy\nsi 四 Wp! aN rm TT LUBS . tae ge is bY we\n“oogpe” RLWC Re so eee\net ee awe i \\ é| MA aon Ato a Oe eae\noso Af fy odbc \\\\ Ny ee ee\nne oi ae EN Bogs ZA\nmV eS oo Saw 08 7 242 oe anki ee 从 ed, BY \\ TIE Bey. eu ae ah We\nPE EL ENG See\n= Ba ey Bur os OD & Whkss' Sol ele eve A AY heft an \\ ead Be I f RS: a\nWel Ze PC ait 一 < Ne 7 AS IES OF is 。 at CANS me .\nys le mi HL 7/ 、\\、 3 Si K, SEER 生气: ° Tey Bs aS a é: CONG vd: obra ge \\\n© Ped Ge i SEM sa ee as SS 和 LE kb\nai ngormagis 26 ‘a Se 4 5 aS We LESAN Sf Zi ; os: is |\n7 on eo SN DAN COVE, ye (ey ‘ 一公司 ‘High Ht Je we ‘p88 ay! ~、-\n: 过 ng age 四 < Seca PONG aT “. CNM LI a . Teyetyw Ai ts Woe :SF\n\\e: f (7 : 0 Rs ; a ‘en i 4s ; , \" awe | Cr ‘Yer Non %- Se Ya So\nDr Necks cll: Sor area A, VENT 全 aie a ae Py) Pays Pre gE NG\nAN Ao SDN TE ows aN OS An 5 NT ge Ef we ON Ue\noP i Psa it 人 ef DN 遇 “as ae P Rie : 3 aw yet Pens AB 54 vein es Oe ve Ws” A”\nope cae lf Bowe LR INS ee AN Shey\" Re pion TAG\npee : FF NES, < behind, | a aA Hackett ae Kh. & _ptiopwdgd \\ A | fee ms A\n, SP RA ENE ep oly PENS | OX CE. ~\n° 3 ; Jf 区 ball . 3 SS on as ANE . ft 4 ‘ ° a dy) a 人 7 eB o SN 了 RS\n2... eg” F Meettevue 上 ae S7,em on 2 | Off. S ° Ne yy. oF fe ee NO RS\n{alg yy d ” KR ARS lb a ro a - ps i m ONS o Ok a ~ ON + meas\nRe, glean PS delle IAS Messages sent PP\n(i 2 全 ! -S Le oO Shar Fh SS 要 f Iz AG ‘a\nrie hh = Ys Cored \" ee P\\ Si es ee, rr a Ta Tm 4 4 HE }\nrca Ri a gil? PRT see Jat eS OSS A. NS hi in te\nPL il. { IP RRR notes AsyoBarnt sere 了 bo GPS VA Lf , ose!\neee ns ne HT a LSS Re aX oH Green - a Le Ve ‘ash . ow -\nNee x pa 6 Fiat mal 3958 € 二 Be) oe os Be SN a Bishop's HS 4 TNs 4 —\n— BE Sea \\ ska EIGK ¢ Poa v ae eS 9 oa Nea Mey a , at aa mn T.-\nSST * = eet eS NS f 加 内 , a wet sae . ny Ent\n, a 大 ~s f Big bel, Re 2 ] Nenivechiigh NII “ae en] Reeoe Fm ¥ ‘| pos 中 .\nStew 4 ; 2 XK 他 Rhos a: Oy ‘i - 这 yy ER 人 = San 7 ‘ |\naA i EN vo. “soe a SF OY Y SS ; BROMSGROVE STA/ Nye | Lye andgt So Glen ong.\ni Sie Sr ee Nea (ad a BF ob 189 Lo. “ a 4 io NS 二 Fm RAR ° 5 a\nee A a, a A Ye: Le LO nek W 7 104 NA A aA é Y\nae Ge OTK Poe 7 ‘cou ge Na ea 4 IR RRA Scere uma ‘\n; COAT YN wee AS 7) 7 eG \\ 5 Cattespoot fh Hilt iP } tga — PC\n人 GAA: 如 Woad.dy. dpe Vigo? OF Ne a a fra: \\ Grange Pm 时 a sos a,\nks Wie < ek E eo et K ¥ 1 g~ Stoney Lane 3, Cr A | \\ . : D 有 : eo ae\nY Oo, BR My} GF hg. , CO The Ss Fm: oi iT eee . 一 a NF 65 sa\nTore cn ee a AER Sct DAM 08 i\ner: Pe SE fig 1 x 254 ( 0 0. OY ; : i :\neo co zi aN Tg SES NG\nPaO) CC Oar ma: i = ed re Os SBhohtwood. vs . Ni, “Borvestey: Park | i 呈\nse ae ey a 。 JAN KG eee Se nn NA Pont ee 人 Oy\nche 本 [pan tree R cross ; ‘o! at ss 人 . <r 从 Fite We NaS a DOT Rete\n) eng * 4 Bromsgrove station 人 ie rere Ae d TA\naL os va \\ EE Sed cay |S SY conan Nas raw GE\ne ASO? ie es . te N va J. 网 = SN a ae 。 TS im oF Wks? 全 SS AV ie re ©\n= “ = og 4 43 We sey Birchen SS Sed a ess :\n7 aie ee 22 , ad BNO, % Ape? SAS x b> RAs 2\nSe 9 Res eee Benetts Fm fo Lh &\\ 6g A 加 OO ees...\noss _Stoue Gout aah” . BE ; ; 4 Ni- eis 7\n5 PHT AR Se soar , ° a\nfi sages were receive\nFigure 6: Approximate locations of the locomotive when messag\n16 November 2020\nReport 14/2020\nBromsgrove",
      "source_file": "R142020_201119_Bromsgrove_23032020.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 17,
      "text": "36 The locomotive tore the buffer stop off the end of the siding, pushing it for about 2\n20 metres before coming to a stop. The locomotive ran off the end of the track, 2\nploughing into the ballast, with only the last two sets of wheels remaining on the 5\ntrack. As it ran on, unguided by the track, the locomotive deviated to the left, 8\ncoming to a stop with its front left corner about 600 mm away from the nearest S\nrunning rail of the up Gloucester main line (figure 1). >\n\n@\n\n37 The locomotive driver got out of the left side of the cab to investigate the o\nconsequences of the collision. He soon became aware of the sound and lights E\nof an approaching passenger train, and realised that he was on an open running\nline. He immediately ran towards the back of the locomotive to get clear of the\nopen line.\n\n38 The passenger train, 1M87, was travelling at 85 mph (137 km/h) when it collided\nwith the corner of the locomotive at 22:44:26 hrs, approximately 47 seconds after\nthe locomotive had collided with the buffer stop.\n\nEvents following the accident\n\n39 The driver of the passenger train immediately applied the emergency brake,\ncoming to a stop just south of Bromsgrove station. He reported the collision to the\nsignaller, who blocked all the lines to trains.\n\n40 Network Rail reported the accident to RAIB at 23:21 hrs.\n\n41 The few passengers on 1M87 were evacuated on foot to Bromsgrove station at\n23:55 hrs. The train was moved to the station at 03:00 hrs on 24 March, ready for\nrecovery to Tyseley depot that afternoon.\n\n42 The locomotive was rerailed by 16:00 hrs on 24 March, and left in the siding to\nawait recovery to Toton depot.\n\n43 Network Rail undertook remedial work to remove parts of the buffer stop that\nremained foul of the up Gloucester line. Work was also undertaken to clear up the\ndiesel spillage that occurred during recovery of the locomotive. The up and down\nGloucester lines were reopened to trains at 00:04 hrs on 25 March 2020. The up\nBromsgrove neck remained out of use for several days until track repairs were\ncompleted.\n\nReport 14/2020 17 November 2020\n\nBromsgrove",
      "source_file": "R142020_201119_Bromsgrove_23032020.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 18,
      "text": "5 Analysis\n<\na.\n“”\n\nIdentification of the immediate cause\n\n44 The locomotive became foul of the main line shortly before the passenger\nservice arrived.\n\n45 When the locomotive hit the buffer stop, it continued for approximately 20 metres\nand deviated to the left before coming to a stop. This caused it to foul the up\nGloucester line, which was open to traffic (paragraph 36). The passenger train\narrived less than a minute later, and collided with the corner of the locomotive\n(paragraph 38).\n\nIdentification of causal factors\n\n46 The accident occurred due to a combination of the following causal factors:\n\ne The locomotive derailed to a position foul of the main line (paragraph 47).\n\ne There was no opportunity to stop the passenger train before the collision\n(paragraph 72).\n\nEach of these factors is now considered in turn.\n\nDerailment of the locomotive\n\n47 The locomotive derailed to a position foul of the main line.\n\n48 This causal factor arose due to a combination of the following:\n\ne The driver was distracted from the driving task as the locomotive entered the\nsiding, resulting in the collision with the buffer stop (paragraph 49).\n\ne The locomotive deviated to the left after collision with the buffer stop\n(paragraph 58).\n\nEach of these factors is now considered in turn.\n\nDriver distraction\n\n49 The driver was distracted from the driving task as the locomotive entered\nthe siding, resulting in the collision with the buffer stop.\n\n50 When the driver started work on 23 March, he had just seen the Prime\nMinister's announcement of the COVID-19 lockdown (paragraph 27). He had\nalso had a telephone discussion with a family member about the impact of the\nannouncement on childcare arrangements (paragraph 28). These arrangements\nhad relied on support from other family members which would be prohibited\nunder lockdown. It was clear to him that this would make it very difficult for him to\ncontinue to manage his shift working pattern.\n\nReport 14/2020 18 November 2020\n\nBromsgrove",
      "source_file": "R142020_201119_Bromsgrove_23032020.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 19,
      "text": "51 The driver stated that it was his normal routine to put his personal mobile phone 2\non silent and in his bag, prior to his driving turns, but on this occasion, he forgot =\nto do so and it remained, on silent and vibrate, in his pocket. As a result, he was <\nalerted to receipt of the messages from the family member and he read and\nreplied to them while driving (table 1). The final message he received included\nadvice from his childrens’ school that further complicated the childcare issue, and\nthe driver also replied to this. This final incoming message occurred about four\nminutes before the locomotive passed the signal at Bromsgrove station and five\nminutes before the collision with the buffer stop.\n\n52 The driver’s use of his personal mobile phone was contrary to the DB Cargo\n‘Mobile Phone Policy’, which states:\n\n‘Personal mobile telephones must not be used whilst in the driving cab, or on or\nabout the running line’.\n\n53 The driver was aware of his employer's policy. However, the fact that the mobile\nphone was vibrating in his pocket, combined with the significant, unresolved\nchildcare issue, drew him to read and respond to the mobile phone messages\nwhile he was driving the locomotive.\n\n54 When the locomotive passed the signal at Bromsgrove station, the driver applied\na little power to enter the siding, before removing it and coasting (paragraph 34).\nAt this point, his thoughts returned to the last message relating to the school, as\nthe childcare problem was still occupying his mind. He sent no further messages,\nbut continued to worry about how the childcare issue could be resolved, while the\nlocomotive coasted along the siding towards the buffer stop. The result of this was\nthat he was temporarily distracted from the driving task while in the siding. It was\nonly when the locomotive was about 40 metres away from the buffer stop that\nthe driver became aware of his location and immediately made a full application\nof the locomotive’s brakes. However, it was too late to avoid a collision with the\nbuffer stop.\n\n55 Although the driver had been awake for approximately 13 hours before starting\nhis shift, there is no evidence to suggest that he was particularly tired at the time\nof the accident. His time awake would have affected his level of fatigue later in\nthe shift,2 and RAIB notes that this does not align with good practice in fatigue\nmanagement. However, RAIB does not consider that fatigue contributed to the\ncause of the driver's distraction on this occasion.\n\n56 DB Cargo’s ‘Fatigue Management Policy’ places responsibility on the employee\nfor reporting fatigue issues, either before or during a shift. DB Cargo also stated\nthat non-fatigue related ‘fitness for duty’ issues, such as those involving personal\ncircumstances, use the same reporting method. This policy states that:\n\n‘All employees have a duty to report if they feel the onset of fatigue at the\ncommencement or at any point during their shift, to the Control Duty Manager.’\n\n2 RAIB has examined first night shift fatigue in its investigation into an uncontrolled freight train run back at Shap\n\n(RAIB report 15/2011). This also featured in a safety digest into a buffer stop collision at London King’s Cross\n\n(Safety digest 15/2017).\n\nReport 14/2020 19 November 2020\n\nBromsgrove",
      "source_file": "R142020_201119_Bromsgrove_23032020.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 20,
      "text": "> 57 At the time of signing on, which was done remotely by telephone and not\n\n全 face-to-face, the driver did not consider that he was fatigued, nor did he consider\n\n要 that this was an issue during the journey to Bromsgrove. He also did not consider\nthat the emerging childcare issues would affect his ability to drive during his shift.\nAs a result, he saw no need to report anything under the fatigue management\nreporting system either before, or during, his shift.\n\nDeviation of the locomotive to the left\n\n58 The locomotive deviated to the left after collision with the buffer stop.\n\n59 The locomotive hit the buffer stop at 21 mph (34 km/h), which was 40% above\nthe maximum permitted speed in the up Bromsgrove neck. The result was that\nthe locomotive detached the buffer stop from the end of the siding and pushed\nits structure ahead of it. The locomotive ran off the end of the rails and ploughed\nthrough the ground ahead of it, causing the ballast to pile up. This caused the\nlocomotive to slow to a stop. It would also have influenced the direction in which\nthe locomotive travelled, with this effect being largely random. In this accident, it\ncaused the locomotive to deviate towards the up Gloucester line.\n\n60 The speed of the locomotive as it hit the buffer stop was sufficient for it to travel\nfar enough to become foul of the up Gloucester line before stopping. If the\nlocomotive had not exceeded the maximum permitted speed for the siding, it\nwould almost certainly not have travelled far enough to foul the main line.\n\nStandards related to the buffer stop\n\n61 When the buffer stop was installed in its current location around 2004, the\nrelevant standard for managing buffer stop risks was railway group standard GC/\nRT5033 issue one (‘Terminal Tracks - Managing the Risk’). This states that:\n\n‘A length of straight track, greater than the length of the longest vehicle\npermitted to use the track, shall be provided wherever reasonably practicable at\nthe approach to the buffer stop, so that any vehicle striking the buffer stop will\ndo so with its longitudinal axis at right angles to the buffer beam.’\n\n62 Although there was a very gradual curve to the main line and the parallel siding,\nthis was of such a large radius that the locomotive would have still struck the\nbuffer stop square on, in line with the intent of this requirement.\n\n63 GC/RT5033 also defined circumstances in which an overrun risk assessment was\nrequired to be carried out for a buffer stop. This stated:\n\nThe risks of harm to people and damage to critical structures arising from a train\n\noverrun at the following locations shall be assessed:\n\ne terminal or bay platforms\n\ne terminal tracks on freight lines and sidings used by trains carrying dangerous\ngoods\n\n@ where there are significant identified risks to persons or property beyond the\nrailway boundary.\n\nReport 14/2020 20 November 2020\n\nBromsgrove",
      "source_file": "R142020_201119_Bromsgrove_23032020.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 21,
      "text": "64 Because the up Bromsgrove neck was not at a station platform, was not used 2\nby trains carrying dangerous goods and posed no significant risk to those =\noutside the railway boundary, there was no requirement to undertake a specific <\noverrun risk assessment under this standard. However, there would have still\nbeen a requirement for the buffer stop installation to have a more general risk\nassessment as required by the general duties associated with the Health and\nSafety at Work etc Act 1974.\n\n65 Network Rail was unable to locate any records from installation of the buffer stop\nin its current location (paragraph 19) to indicate that an overrun risk assessment\nwas carried out, nor any findings of more general risk assessments. Bromsgrove\nstation was remodelled in 2016, but no changes were made to the buffer stop at\nthat time.\n\n66 However, a number of mitigations, of the types suggested in standards relating to\noverrun risk assessment, were present at the up Bromsgrove neck. These were:\ne@ Two permanently lit red lights were fitted to the buffer stop, to aid visibility by\n\nany approaching trains.\n\ne Imposition of a 15 mph (24 km/h) maximum permitted speed, to manage the\nimpact energy in any collision with the buffer stop.\n\ne Normal stopping position for locomotives was more than 50 metres short of the\nbuffer stop, managing the risk of trains coming into contact with it.\n\ne Use of an approach-controlled signal on entry to the siding, managing the speed\nof trains entering it.\n\ne The Train Protection and Warning system (TPWS) was fitted at this signal. This\nwould have the effect of stopping any trains that pass it at danger, well before\nthey reach the buffer stop.\n\n67 The buffer stop was not subject to any specific maintenance regime, as\ndefined by Network Rail standard NR/L2/TRK/001 module 18 ‘Inspection and\nMaintenance of Permanent Way — Buffer Stops’. Network Rail did not consider\nthe up Bromsgrove neck to be a ‘terminal track on a freight line’, and so a\nspecific buffer stop inspection regime was not required by the standard. However,\nNetwork Rail did expect routine visual inspections of the track to identify any\nsignificant defects with the buffer stop and to flag these for attention. There is no\nevidence to suggest that there was any defect with the buffer stop at the time of\nthe collision.\n\n68 The red lights on the buffer stop were subject to regular inspection by Network\nRail’s Distribution and Plant team. This included replacement of the lamps every\nsix months. Records show that this was being carried out. In addition, CCTV\nfrom a passing train shows that the buffer stop lighting was illuminated four hours\nbefore the accident (figure 7), indicating that it was almost certainly lit at the time\nof the accident.\n\nReport 14/2020 21 November 2020\n\nBromsgrove",
      "source_file": "R142020_201119_Bromsgrove_23032020.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 22,
      "text": ">\n3 . |\n‘Ss 7 8\na. 一\n®\n\nFigure 7: Train CCTV image showing buffer stop light illuminated at 18:47 hrs on 23 March 2020 (image\n\ncourtesy of CrossCountry)\n\n69 The current guidance on risk assessment for buffer stops is described in\nGIGN5633 (paragraph 84). Although intended for platform tracks, the risk\nassessment methodology can be applied to non-platform lines. It considers\nfeatures such as the layout of the terminal track, its collision history, physical\ncondition and any surrounding infrastructure and population. The output of the\nassessment is an estimation of the fatality and injury risk, expressed as ‘estimated\nyears per fatality’\n\n70 Although GIGN5633 does not define any action levels relating to this calculated\nrisk, its identically titled predecessor standard, GCRC5633, indicated a first action\nlevel of approximately 3,300 years per equivalent fatality.\n\n71 RAIB retrospectively applied the methodology of GIGN5633 to the up Bromsgrove\nneck, taking into account the mitigations present and the possibility of a\npassenger train on the adjacent up Gloucester line. This indicated a risk of one\nfatality every 135,000 years, considerably less than the threshold for action\nsuggested by the earlier standard.\n\n3 Note that the term ‘fatality’ includes statistically weighted injuries, in line with railway industry standard practice.\n\nReport 14/2020 22 November 2020\n\nBromsgrove",
      "source_file": "R142020_201119_Bromsgrove_23032020.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 23,
      "text": "Operation of the passenger train 2\n\n72 There was no opportunity to stop the passenger train before the collision. 3\n\n73 The passenger train, 1M87, was running on clear signals at around 85 mph <\n(136 km/h) on the approach to Bromsgrove. There was no possibility that the\ndriver of the train could have stopped the train before the collision, even if he had\napplied the brakes on sighting the locomotive’s lights in the dark. Furthermore,\nseeing the lights of a locomotive on the adjacent up Bromsgrove neck would not\nhave been a reason for the driver to brake, because locomotives regularly wait\nin the siding. The driver had no idea that the locomotive was foul of his line until\nhis train collided with it. However, as his train approached, he became aware of\na Cloud of dust that had been thrown into the air during the derailment, but he did\nnot have time to apply the brakes before the collision.\n\n74 The passenger train driver did not receive any warning of the derailed locomotive\nprior to reaching the collision site. Such a warning could have come from the\nsignaller, if they had been alerted to the derailment by a GSM-R% call from the\nlocomotive driver. Alternatively, the locomotive driver could have sent a Railway\nEmergency Group Call (REC), which sends a ‘stop all trains’ message to all\ntrains in the vicinity. However, the locomotive driver did not contact the signaller\nimmediately after the derailment, nor did he initiate a REC.\n\n75 The passenger train arrived approximately 47 seconds after the locomotive\ncollided with the buffer stop (paragraph 38). The locomotive came to a stop about\nfour seconds after it hit the buffer stop. A cloud of ballast dust was thrown into\nthe air, affecting the driver’s visibility of the surroundings. The driver would then\nhave taken a few seconds to recognise what had happened, having only become\naware of the buffer stop four seconds before colliding with it (paragraph 35).\n\n76 The locomotive driver’s first action after the collision with the buffer stop was to\nget out of the locomotive to investigate whether it had derailed. He would have\nfound this difficult to judge from the cab due to the dust cloud. Exiting the cab on\na Class 66 locomotive involves moving behind the driver’s seat and opening a\ndoor into a short corridor. The external door then needs to be opened before the\ndriver can climb down to ground level. This would probably have taken the driver\nabout 20 seconds to complete. It is likely that the driver would only have reached\nthe track about 20 seconds before the arrival of the passenger train. Therefore,\nhe did not have time to give any warning to the signaller or to initiate a REC. The\ndriver only had time to run to the back of the locomotive to get clear of the up\nGloucester line onto which he had alighted, and on which the passenger train was\napproaching.\n\n4 A radio in the cab of a train based ona digital railway communication system that allows communication between\n\ndrivers and signallers.\n\nReport 14/2020 23 November 2020\n\nBromsgrove",
      "source_file": "R142020_201119_Bromsgrove_23032020.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 24,
      "text": "> 77 Module M1 of the railway Rule Book (GERT8000-M1 ‘Dealing with a train\n全 accident or train evacuation ) states that in the event of a train accident, the driver\n要 should take the following actions:\ne You must immediately switch on the hazard warning indication where\nprovided.\ne /f you cannot do this, you must display a red light forward.\ne You must then check:\no if any other lines are obstructed (if in doubt, treat them as obstructed), and\ndecide the quickest way to stop any approaching trains\no the exact location of your train.\ne You must tell the signaller about the accident in the quickest way possible and\nwhether the electric traction current needs to be switched off.\n\n78 The driver was in a state of shock and confusion having just collided with\nthe buffer stop. He has stated that he did not consider the possibility that the\nlocomotive was foul of the main line at this time. Therefore, he did not recognise\nthat he needed to switch the hazard lights on. Had he switched them on, the\napproaching passenger train would not have seen them until a few seconds\nbefore the collision. It is possible that this would have caused the passenger train\ndriver to apply the brakes. However, although this might have reduced the speed\nof the train before the collision, it would not have prevented it.\n\n79 For the same reasons, the locomotive driver did not turn on the red tail lamps in\nthe leading cab, nor show any other red light through the cab window. However,\nhad he done so, again, it would have been unlikely to have had any effect on the\nactions of the passenger train driver because locomotives can often be seen to be\nwaiting in the up Bromsgrove neck.\n\n80 The driver’s actions in checking what had happened to his locomotive before\ncontacting the signaller were consistent with the wording of the Rule Book. RSSB®\nhas since reported that an amendment to the Rule Book will come into force in\nDecember 2020 which will require the driver to inform the signaller of an accident\nbefore checking if any other lines are affected.\n\n81 The ‘GSM-R Handbook’ (RSSB document RS523) describes the operation and\nfunctions of the GSM-R radio system fitted in trains and available to signallers and\noperations controllers. Section 5.3 describes the use of the REC in an emergency\nsituation. It states:\n\n@ A REC can be used during any emergency situation affecting more than one\nline or more than one train.\ne@ /n an emergency situation the driver may need to initiate a REC.\n\n5 The railway Rule Book is maintained and published by RSSB on behalf of its members. RSSB is a not-for-profit\n\nbody whose members are the companies making up the railway industry, and is registered as Rail Safety and\n\nStandards Board Ltd, but trades as RSSB.\n\nReport 14/2020 24 November 2020\n\nBromsgrove",
      "source_file": "R142020_201119_Bromsgrove_23032020.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 25,
      "text": "82 Although it associates possible use of the REC with emergency situations, the 2\nhandbook does not provide detailed guidance on what situations the REC should =\nbe used for and those for which it should not. Because a REC sends a ‘STOP <\nEMERGENCY’ message to all trains in the relevant area, there will be situations\nwhere a REC is appropriate and others where stopping all trains is not necessary.\nDB Cargo stated that its training in the use of the REC uses scenarios to test the\nresponses of drivers to emergency situations and the appropriate use of the REC.\nHowever, it also stated that there is no definitive list of situations where REC\nuse is required and the decision is largely down to driver discretion based on the\ncircumstances at the time. The locomotive driver did not initially consider that his\nlocomotive could be affecting the adjacent line and so did not consider using a\nREC.\n\nObservation\n\nBuffer stop risk assessment\n\n83 The standards and processes that Network Rail applies to assess the risk of\noverrun at buffer stops do not address those on non-platform tracks.\n\n84 Network Rail standard NR/L2/TRK/2102 issue 8 (Design and construction of\ntrack) requires the use of GC/RT5033 (paragraph 61) for the design of new or\nrenewed buffer stops. GC/RT5033 has since been superseded by rail industry\nstandard RIS-7016-INS ‘Interface between station platforms, track, trains and\nbuffer stops’. This includes the requirements for overrun risk assessment of buffer\nstops. Associated guidance on how to undertake buffer stop risk assessments is\ndescribed in rail industry guidance note GIGN5633 ‘Recommendations for the risk\nassessment of buffer stops and end impact walls’.\n\n85 RIS-7016-INS states that its purpose is to set out ‘requirements for the design\nand maintenance of station platforms for their safe interface with track, trains and\nbuffer stops’. Therefore, sidings that are not in station platforms, such as the up\nBromsgrove neck, are not covered by it. The associated guidance in GIGN5633 is\nlinked to RIS-7016-INS and so is also limited to platform tracks.\n\n86 RAIB observes that although earlier standards had some applicability to non-\npassenger terminal tracks, the current standards do not. Therefore, there is no\ncurrent requirement or guidance to specifically risk assess the overrun risk at\nbuffer stops that are not located in station platforms.\n\nPrevious occurrences of a similar character\n\n87 RAIB has investigated a number of buffer stop collisions. Examples of these\nare Sudbury (RAIB report 26/2006), Chester (RAIB report 26/2014) and King’s\nCross (RAIB report 15/2016). RAIB has also published a safety digest into a\nsecond buffer stop collision at King’s Cross (Safety digest 15/2017). However,\nthe circumstances of this accident differ from those featured in previous\ninvestigations, and as a result none of the previously made recommendations are\ndirectly relevant here.\n\nReport 14/2020 25 November 2020\n\nBromsgrove",
      "source_file": "R142020_201119_Bromsgrove_23032020.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 26,
      "text": "8 Summary of conclusions\n3\n©\n< .\nQ, Immediate cause\n已\n5 88 The locomotive became foul of the main line shortly before the passenger service\n本 arrived (paragraph 44).\n2.\na\nCausal factors\n89 The causal factors were:\na_ The locomotive derailed to a position foul of the main line (paragraph 47).\nThis causal factor arose due to a combination of the following:\ni The driver was distracted from the driving task as the locomotive entered\nthe siding, resulting in the collision with the buffer stop (paragraph 49,\nLearning point 1).\nii The locomotive deviated to the left after collision with the buffer stop\n(paragraph 58, No Recommendation).\nb There was no opportunity to stop the passenger train before the collision\n(paragraph 72, Learning points 2 and 3).\nAdditional observation\n90 Although not linked to the accident on 23 March 2020, RAIB observes that:\na The standards and processes that Network Rail applies to assess the risk\nof overrun at buffer stops do not address those on non-platform tracks\n(paragraph 83, Recommendation 1).\nReport 14/2020 26 November 2020\nBromsgrove",
      "source_file": "R142020_201119_Bromsgrove_23032020.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 27,
      "text": "Recommendation and learning points 2\na\n3)\n1 £\nRecommendation E\n©\n. . . 2\n91 The following recommendation is made:® _\ne\n1 The intent of this recommendation is to improve the management of 2\noverrun risk at buffer stops that are not located in station platforms. 3\n. . . . o\nNetwork Rail should review, and revise if necessary, the processes and E\nstandards that it applies to buffer stops installed on non-platform terminal 5\ntracks, to ensure that the risks arising from potential buffer stop collisions é\nare being adequately managed (paragraph 90).\nThis recommendation may also be applicable to other infrastructure\noperators.\nLearning points\n92 This accident demonstrates the importance of:’\n1 train drivers complying with their employer’s mobile phone usage policy\nso as to avoid unnecessary distractions while driving.\n2 informing the signaller following a train accident, even before it is\nconfirmed that adjacent lines are obstructed.\n3 train drivers, and other staff, intending to get out of their trains following\nan incident ensuring that they do so in a manner that does not place\nthem at unnecessary risk from trains on lines that are open to traffic.\n6 Those identified in the recommendation have a general and ongoing obligation to comply with health and safety\nlegislation, and need to take these recommendations into account in ensuring the safety of their employees and\nothers.\nAdditionally, for the purposes of regulation 12(1) of the Railways (Accident Investigation and Reporting) Regulations\n2005, this recommendation is addressed to the Office of Rail and Road to enable it to carry out its duties under\nregulation 12(2) to:\n(a) ensure that recommendations are duly considered and where appropriate acted upon; and\n(b) report back to RAIB details of any implementation measures, or the reasons why no implementation\nmeasures are being taken.\nCopies of both the regulations and the accompanying guidance notes (paragraphs 200 to 203) can be found on\nRAIB’s website www.gov.uk/raib.\n7 ‘Learning points’ are intended to disseminate safety learning that is not covered by a recommendation. They are\nincluded in a report when RAIB wishes to reinforce the importance of compliance with existing safety arrangements\n(where RAIB has not identified management issues that justify a recommendation) and the consequences of failing\nto do so. They also record good practice and actions already taken by industry bodies that may have a wider\napplication.\nReport 14/2020 27 November 2020\nBromsgrove",
      "source_file": "R142020_201119_Bromsgrove_23032020.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 28,
      "text": "5 Appendices\n\n3\n\n2:\n\na\n\na Appendix A - Glossary of abbreviations and acronyms\nCCTV Closed-circuit television\nGSM-R Global System for Mobile Communications - Railway\nOTDR On-train data recorder\nRAIB Rail Accident Investigation Branch\nREC Railway Emergency Group Call\nTPWS Train Protection and Warning System\nReport 14/2020 28 November 2020\nBromsgrove",
      "source_file": "R142020_201119_Bromsgrove_23032020.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 29,
      "text": "Appendix B - Investigation details a\nRAIB used the following sources of evidence in this investigation: 2\ne information provided by witnesses &\ne information taken from the train’s on-train data recorder (OTDR)\n\n@ closed-circuit television (CCTV) recordings taken from passing trains\n\ne site photographs and measurements\n\ne weather reports and observations at the site\n\n@ maintenance records relating to the locomotive and the infrastructure\n\ne a review of relevant railway industry standards and procedures\n\n@ a review of previous RAIB investigations that had relevance to this accident.\n\nReport 14/2020 29 November 2020\nBromsgrove",
      "source_file": "R142020_201119_Bromsgrove_23032020.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 30,
      "text": "This page is intentionally left blank\nReport 14/2020 30 November 2020\nBromsgrove",
      "source_file": "R142020_201119_Bromsgrove_23032020.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": false,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 31,
      "text": "人\nThis report is published by the Rail Accident Investigation Branch,\nDepartment for Transport.\n© Crown copyright 2020\nAny enquiries about this publication should be sent to:\nRAIB Email: enquiries@raib.gov.uk\nThe Wharf Telephone: 01332 253300\nStores Road Website: www.gov.uk/raib\nDerby UK\nDE21 4BA",
      "source_file": "R142020_201119_Bromsgrove_23032020.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    }
  ]
}