{
  "doc_id": "9874e634-73af-4c18-b034-3dcd68b9e3a1",
  "pages": [
    {
      "page_number": 1,
      "text": "Institution of Railway Signal Engineers\na a\na\nBack to basics: Level crossings\njee Fd Rollings a -\nIn this, our latest, “back to basics” article we Terminology\nlook at how signal and telecoms engineers There are many different terms used to describe\nhave to consider more than just the features of a level crossing around the world.\nmovement of trains around the network. © Table 1 lists some terms associated with level\nThe article makes reference to factors which crossings along with a description. Throughout\nshould be considered In the provision and this article we shall refer to ‘level crossings’, but\noperation of level crossings, although legal they are also known as ‘grade’ crossings and ‘rail’\nand cultural differences prevail in many or ‘railroad’ crossings.\n— countries which may override the generic _ .\nRoad crossing application ”principles set out in this article. What is a level crossing?\nand technology varies So having determined the need to cross the\nenormously around the 1 > ‘ , ;\nworld. This is one of Why do we need level crossings? railway on the level we can start to define this\nseveral different types of In some countries the railway came before roads as a ‘level’ crossing. The form of this crossing\nhalf barrier crossing inthe — while in others the construction of the railway may involve simply designating a place using\nUK. Half barrier crossings = divided land and roads where other rights had signs, for example, where visibility is good to see\nfull ess ver croesin than been established. Either way, it created the trains approaching. Railways in many countries\nand prevent users being need for road and rail to cross each other. Level do not have continuous boundary fences, so it is\ntrapped inside the crossings vary considerably in type, often on the important to designate safe places to cross the\nbarriers. However there same railway, but members of the public may not __ tracks. Although not usually part of the signal\nis a risk of crossing users appreciate the differences in operation as they engineer's responsibility, the levelling up of the\n‘weaving around’ the just require a place to cross the railway safely ifa | ground from the railway boundaries up to and in\nclosed half barriers. bridge or underpass cannot be provided. between the rails gives strength to the definition\nved\na ; oa) be\n- ,一部 ql 一 ! grt. ow 8 oh tn\n人 ys Ge Rr ME OU ghee ere = ~~\n有\n2",
      "source_file": "20_Level crossings.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 2,
      "text": "IRSE News | Issue 276 | April 2021\nTable 1 — UK signalling , , , , , , , ,\ntermi Active warning Warning or protection devices for road users which are activated by a train\nerminology. .\nor railway staff.\nDeck The support and surface area of a crossing which carries users and/or\ntheir vehicles.\nFull barrier crossing A crossing fully fenced between road and railway when the road is closed.\nMay use a single boom on each side or two half booms or equivalent\nequipment, e.g. gates.\nke & Grounding A vehicle stranded by coming into contact with the crossing surface/deck.\nOccurs when a long wheelbase vehicle traverses a crossing with a severe\nvertical curve or hump. This is often denoted by the sign on the left.\nHalf barrier A crossing with a barrier closing the entrance lane(s) of each\ncarriageway only.\nHumped The vertical profile of a crossing where it rises in the centre — see\nalso ‘grounding’.\nLevel Crossing A designated place where the public can cross the railway safely on the level.\nMay also be known as a grade crossing, rail crossing or railroad crossing. It\nmay include a sign or other equipment to assist the user.\nPassive crossing A crossing where the user is responsible for assuring their own safety by\nchecking for the approach of trains.\n=< Protecting signal A railway signal used to authorise train movements over a level crossing.\nSaltire St Andrews Cross or Crossbuck, commonly used to signify the presence of a\nrailway crossing. This is shown to the left.\n- Wig-Wag or A road traffic light signal with twin flashing red lights to warn road users\nflashing light signal of the approach of a train. May be used alone or in combination with\nbarriers or gates.\nof ‘level crossing’. By contrast many footpath Safety\nCPOSSINgs do not have a built-up deck, relying Accident statistics demonstrate that level crossings\ninstead on users to step over the rails. Vehicle oy ,\n, are high risk sites for railway operators as well as\ncrossings mostly need a deck to reduce the risk of nae ,\n, contributing to large numbers of near-miss events.\nvehicles getting stranded. The design of the deck ane .\n“Some countries will be informed by the tvoes of vehicle or traffic The reasons for this high level of risk should be\non using it. especiall he vertical curvature or hum obvious to railway professionals who are familiar\nInsist on 1g MN ESP y , P with recognising hazards, but level crossing users\nwhich could lead to vehicles becoming stranded me from a broad trum of ‘ety Who\nmeasures to where the body of the vehicle between axles im tb eamniliar orth the vhatactericties ofa\nmanage risk of comes into contact with the crossing surface (that ay NOt Oe ;\n\n_ . is, becomes grounded) train operations, where long stopping distances\ncollision with ’ 3 are normal, and trains are unable to deviate from\na train” What does the law say? the line of travel. Monitoring of crossing use is\n\nSome countries insist on measures to manage atch) on as pavers 9 ass tan therefore levels\nrisk of collision with a train, leaving the specific Orns t 《5 foro ae sn y have beer _\narrangements for the level crossing designer “ham an 人 Ins ern ere nave Sa OO\nto decide based on risk. Others prescribe hr anges . . lit pa “atic vievi areas ath °\narrangements in detail; often a blend of these © ile ° an ne “Sel lon gevices ang me\nregulations will apply. In some countries it is popularity of home delivery courier services.\nthe policy of the railway companies not to Selection of system\nprovide equipment unless required to do so bya ; ; .\n\n- Where the law requires protection or warning\ngovernment entity, as litigation may result where ; ,\n\n, : , systems to be provided, or the railway or other\n\nother similar crossings are not so equipped if there , , , ,\nwas an accident authority chooses to fund provision of equipment\n\nfor their benefit or the benefit of the public, care\nIn some cases, the costs of provision and should be taken in choosing the right combination\nmaintenance of a crossing fall on the railway of equipment to be safe and effective. Increasingly,\nauthority, sometimes the government or other convenience is being recognised as an important\npublic body will require actions and fund those, factor in system selection. Delaying users or\nin other cases costs may fall to the private trains has consequences, such as cost penalties\nuser or be shared. either directly or in productivity loss and can\n\n; ; lead to frustration which may result in users\nIn some countries there are many different parts ; , ,\n\n. . circumventing warnings.\nof law which can apply, especially where highways\nand road traffic is involved. Often different laws Some railways have risk modelling tools to help\nwill apply for pedestrian crossings or for crossings choose equipment configurations that give the\nbetween privately owned land such as farmers’ most effective risk reduction. Such tools also\nfields or access to a single house. help to support a financial case for investment\n3",
      "source_file": "20_Level crossings.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 3,
      "text": "IRSE News | Issue 276 | April 2021\na - SIN 中\nwe GUAR. CRUCE [i 人\naves oa a atti | eens -一\nee ee ee ae ee Be.\nSG 2 GO Gs Se? ee\nEE OM Fi 2 See ee ee\nSere rr er ao, ee a Fe eg a ES EY re\nAn unprotected crossing in risk reduction and may include benefits to interpretation of warnings is a necessary part of\nin Chile. The safety of society through a reduction in lives lost or selecting the best combination of equipment\nroad user and the railway injuries incurred. to assist users.\nis very much dependent\non the signs being A key input to the selection process is Some railways have dedicated level crossings\nobeyed. understanding the use of a crossing both by specialists while in others it is a general signal\nthe railway and by users. A census of use taken engineering responsibility. Level crossing\nover several days is helpful to identify all of the management extends to engaging with users\ndifferent types and numbers of users, and their to educate them how to use level crossings\ncharacteristics. It is important to understand safely, especially when changes are proposed\nhow long they take to traverse the crossing or implemented. This may be through school\nand whether users can pass safely if they meet visits, media Campaigns or local meetings with\non the crossing. What are the approaches like, individuals or groups.\ncan vehicles stop easily? Do vehicles approach , ,\nat speed, or is there a likelinood of becoming Proposals to change 4 Crossing OF sometimes\nstranded on the railway? to renew it, may require consultation with\nstakeholders who have an interest. Typically,\n“Some railways On the railway how many tracks are there? Do all people representing interested groups such\nhave dedicated trains pass through at line speed or are there some as the traffic authority, disability groups, the\n. trains passing at slower speeds? Is there a station emergency services, planning authorities, or\nlevel Crossings or junction nearby which affects speeds? Do political representatives may contribute to these\nspecialists and trains pass in the area or closely follow each other — consultations and expect their views to be taken\nin others itis a and therefore keep the crossing closed for long into account. Consultees may express views about\n. periods? Can visibility of approaching trains and safety, convenience, appearance, noise, lighting,\ngeneral signal therefore warning time be improved by removal of accessibility, disruption during work, to list just\nengineering lineside vegetation? some of the factors.\nresponsibility Pedestrian user characteristics may include Technical protection or\nmobility, hearing or sight impaired people, people warning systems\nwith luggage, pushing cycles, or children/young . .\nadults or those with cognitive impairment who The level crossings engineer has a lot of\nare less risk aware. Distraction factors such as equipment available which can be configured to\nmobile devices or moving in groups should also Provide an appropriate solution. At the simpler\nbe considered. end there are warning signs, or instructional\nsigns. At the complex end there are complete\nWhen level crossings are renewed these factors barrier installations with sophisticated obstruction\nmay have changed considerably so it is vital that a detection devices, which can identify people or\nthorough assessment is made whenever a change _ objects on the crossing. These should have a\nis proposed to a crossing. high reliability and assurance of safe operation\nHistorically many crossings were operated by which allows them to automatically confirm the\nrailway staff. Automation is now common on crossing Is Clear.\nsome railways which makes crossings cheaper to —- Crossings may have gates or barriers. These are\noperate and manage but this relies on increased operated either by the railway or by the road user.\nknowledge and discipline on the part of users. The road may have lights, usually twin flashing\nUnderstanding human behaviour factors and the red, which are accepted as an absolute stop\n4",
      "source_file": "20_Level crossings.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 4,
      "text": "IRSE News | Issue 276 | April 2021\nsignal, even by emergency services. Sounders crossing user may not bother to use the telephone\nmay be provided to reinforce a warning and to or may misunderstand the message being given\nassist vision-impaired users. The use of surface and cross with a train approaching. With signal\nmarkings on a road or path to identify the safe control areas getting larger and potentially\nplace to stop is another feature along with signs more telephone crossings per signaller the risks\nand other carriageway markings to help the user become even greater.\nnavigate a crossing. Where railway signals are At some types of automatic crossing telephones\nprovided, they may be controlled to only allow . . ,\n\n, are provided for users to alert the signaller if the\ntrains to proceed when the crossing is closed and . .\n, crossing becomes occupied with a failed road\nan clear; they may also be interlocked to prevent the ; ; .\nIn some , , , vehicle. In such situations the telephone is the\ncrossing being opened for road users once a train only wav of protectina the crossing from an\ncountries has been signalled until it has passed through or approaching train assuming trees a protecting\ntelephones safely stopped. signal in the right place, or an emergency radio\nare provided In some countries telephones are provided at call can be made to the approaching train with\nsome types of crossings to enable members of time to stop. Such telephones must operate at all\nat some types , . . . aon\n. the public to seek permission to use a crossing. times and self-reporting fault monitoring can be\nof crossings to These are normally provided where the warning provided to check the telephone is working.\nenable members time obtained by visual means Is less than the Where a crossing is supervised the signaller may\nf th blic t time needed to cross safely, and no other active g IS St\nO e pubic to , ane . confirm the crossing is safe to allow trains to\nk iSSI protection or visible warning Is provided. The roceed by direct observation from the signal box\nseek permission telephones need to be protected from water P y aires , , 3\nt ww , ,, or Closed-Circuit Television (CCTV) from a remote\nO USE a CFOSSING ingress, vandal damage and located in a position .\n, , , , location. A crossing attendant may be employed\nof safety and with clear instructions on their use ; aks\nto operate barriers or gates; this person would be\nto cross safely. The telephones are normally , ;\n, i, , , provided with an indicator or other information to\ndirect lines’ to the controlling signaller. The , ,\n, , advise when a train is expected.\nsignaller must only be able to talk to one crossing\nat any one time, and the crossing name must Automatic crossings may not have signals\nbe displayed to the signaller throughout the interlocked with the crossing and instead rely on\ncall. There must be no overhearing, so that one highly dependable safety features to ensure the\ncrossing user cannot hear instructions intended crossing operates for each train. It is important\nfor another crossing and the voice quality must that when a crossing operates there is not too\nprovide clear communication. The identity and much time before a train arrives, or an inconsistent\nlocation of the crossing from which the call time between the arrival of trains, which might\nis being made must be clearly and accurately otherwise encourage poor discipline by users\ndisplayed to the signaller. who may attempt to circumvent the protection or\nThere are number of problems with telephone ignore the warning.\ncrossings. The signaller may not have an accurate = Automatic crossings are activated by the approach\nknowledge of where trains are in relation to the of a train and rely on train detection equipment;\ncrossing. This can lead to misunderstanding of treadle, track circuit, axle counter or prediction\nmessages and increases the workload for the device placed an appropriate distance from the\nsignaller. Signallers are trained to use ‘safety critical crossing to guarantee timely operation. A crossing\nQuad barrier crossing communications’ protocols but communicating control device may be configured to deal with\nin the USA. with the public requires an additional skill set. The trains approaching from more than one direction.\nae As > Se Moree Si : 7 or . 一一 一 OO\nRN = pe = Tee OL\n5",
      "source_file": "20_Level crossings.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 5,
      "text": "IRSE News | Issue 276 | April 2021\n\\\nan ee\n| 、\net » _ 4\n的 . . . ot @. ze, ‘ . a\nPE a ae ae PO OE hae: SF al RS Oy sr ehhh: eg SE) OO See - Ba ccd «| meena te\nFamine EY (Ay career ited Skt SESS * ial unites 5S clan «=\nAbove, open crossing with , ;\nlights in New Zealand. < 1 | onTM 四\nRight, a pedestrian 和\ncrossing in Melbourne, a A: vY STOP\nAustralia. ( z - o ya i . 4 ’ 20m UF\n, | ' « 73 , ‘\n一 ee tee =$amg = - o 一 -<\na ee poe: Re ee! a ee\nowe 人 aR ba Ny 网\n一 -5 oe 吓人 EE L LU 人 NOES a\nas oe , ae Th ad , TV ta . ~4 _= q a: nse '\n= er ay. ad wee ess |S\ncui ea 5 OE a Ss\nSometimes automatic crossings are provided Initially ETCS was only planned for high-speed\nwith an escape route or clear exit to avoid users lines where level crossings do not exist. As the\nbeing trapped if the crossing operates when they use of ETCS has become more widespread,\nare part way across. Unfortunately this leaves an lines which have quite high populations of level\nopportunity for malicious or unsuspecting users crossings have been fitted. One feature of level\nto enter the crossing from the opposite direction crossing operation is the critical timing required.\nwhen a train is approaching. As ETCS transmits a movement authority\n‘Onsome lines on some lines it can be useful for train crewto tp {he train and the train reports its position\nit can be useful Operate a crossing, typically where line speed oe, y\n. ; ; , a transmission in a message.\nfor train crew is low and only infrequent and less time-critical\nto operate a services operate. This introduces additional While this can be accommodated in the course\npi . hazards, similar to where a signaller has to push of normal train movement it becomes important\nCrossing gates across a road; this is really only suitable where reporting the position of a moving train in\nwhere road speeds are low and traffic infrequent. relation to a crossing is concerned. A slight delay\nTrain drivers may also be required to observe a in triggering an automatic crossing could result in\ncrossing is clear after it has activated automatically the crossing not being closed for sufficient time\nbut before passing over it. This is only practical before the arrival of the train.\nwhere train s is low and there i visibilit ae ,\n, peed Is ow a d ere Is good sibility Restrictions of speed can be embedded in the\napproaching the crossing, allowing them time to ; ;\n, , , permitted speed profile to ensure that where users\nstop short if there is an obstruction. ,\nneed a given number of seconds clear sight of an\nIn-cab signalling approaching train in order to cross safely this can\nSystems such as the European Train Control Pe Ce precise and cont e ec vey without\nSystem (ETCS) in-cab signalling presents both BOON ALINE SIGE INTASHTACTUrS\nopportunities and challenges for the operation\nand management of level crossings.\n6",
      "source_file": "20_Level crossings.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 6,
      "text": "IRSE News | Issue 276 | April 2021\n. 一 .三 = x. : a\n= ie fF i ae AN 4 y+ | 一一 eee _— .\nZe. AIO “eee ee\nA lightly used, yet fully Automatic train operation Future opportunities\nequipped, crossing\nin Switzerland. Automatic train operation is commonly associated Any prediction of the future will almost certainly\nwith metros and other high density urban railways prove to be wrong. However, there are a few\nwhich do not have level crossings. Some heavy foreseeable developments which will impact\nhaul freight railways now use automatic operation _ the future of level crossings. The introduction of\nof their trains over long distances. With remote Future Railway Communications System (FRMCS)\nmanagement of the operation and driverless trains | may allow more use of wireless technology in\nit is important that level crossing use does not the control and operation of crossings, with 5G\nimpact the safety of the rail operation. Automatic likely to be used both for FRMCS and autonomous\noperation of the level crossings is preferred. This vehicle operation. Artificial Intelligence (Al) could\nis achieved, in some railways, through the use of be harnessed to allow learning from current\n“Any prediction predictor technology which allows for adequate Operations and to improve our understanding of\nf the f warning times for road users and also ensures user behaviours. The use of Al derived solutions\nof the future re | ]\n。 that the level crossing is open long enough for could prove challenging to safety validate.\nwill almost road users to clear the crossing once they have Self-driving autonomous vehicles may have\ncertainly prove committed to crossing it. Obstacle detection a significant impact on safety improvement\nto be wrong” equipment is used to identify any problem with where messages transmitted from the crossing\nthe level crossing and in particular where road may give advance notice to the road vehicle of\nand rail intersect, which informs the train control the imminent operation of a crossing, possibly\nsystem and revokes the movement authority enforcing a controlled brake application. Radio\nthrough an emergency brake application. Where communications could also be used to alert an\nbraking distances may be 2km or more advance approaching train if the crossing is occupied.\nnotice of any problem is essential to manage the These developments could reduce or eliminate\ntrain to avoid a conflict. The ability to stop a train human error or misunderstanding which\nbefore a level crossing needs to occur outside contributes to many level crossing incidents.\nthe minimum stopping distance. Anything less\nthan that is a situation that raises the likelinood\nof a collision.\nAbout the author ...\nEd is a Chartered Engineer and Fellow In 1993 he joined Railtrack as part of a Ed held the post of professional head\nof the IRSE with a MSc in Railway team preparing for privatisation before of signalling and technical lead for level\nSystems Engineering and Integration becoming signal engineer for the crossings engineering with Network Rail,\nfrom the University of Birmingham. Midlands Zone on its inauguration as the the GB main line railways infrastructure\nHis career began in 1977 as a signal infrastructure owner. owner. Today he runs a company\nand telecommunications trainee and ; ; providing signalling and level crossing\n, , wa , His involvement with level crossings , ,\nhe held various roles in British Rail systems engineering consultancy. He\nSj began in 1985 undertaking scheme . ,\nignal and Telecoms department ; . also edits IRSE News Presidential Papers.\n- , , , development for signalling and level\nincluding maintenance, design, and ; ;\n. crossings projects.\nproject support.\n7",
      "source_file": "20_Level crossings.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    }
  ]
}