{
  "doc_id": "a75a70ba-bd03-44bf-ac5d-f05b5d69828f",
  "pages": [
    {
      "page_number": 1,
      "text": "Institution of Railway Signal Engineers\na\nBack to basics: Operator interfaces\nx Ian Mitchell ee . 1\nThis article in the ‘Back to basics’ series working in this specific area. The aim is to describe\ncovers the subject of the interface between the systems in a generic manner, but using\nthe signalling system and a human operator — examples based mainly on UK main line railway\nin a signalbox or control centre. The practice. The scope is limited to the core signalling\ntechnology of these systems varies from functions and excludes voice communications,\nmechanical levers and control panels which is of course also a key element of any\nwith switches or buttons to computer operator interface.\nworkstations, but they all provide controls, Evoluti fthei f\nwhich enable the operator to manage train votution of the interface\nmovements and indications, which provide In the mechanical signalling era, the operator\nthe operator with information about the interface and the interlocking were combined,\nExample ofamechanical Status of the signalling equipment and the controls were levers above the floor of\nlever frame. Note the position of trains. the signalbox that directly interacted with the\nindicators on the front of , ae mechanical interlocking in the locking room\nthe shelf over the levers, As with other back to basics articles, the intention below, and via rods and wires to the points and\nshowing the status of is to provide an overview for IRSE members new signals on the railway outside.\npoints and signals. to the industry who do not have experience of\n23s 8 @. “Fi 0 sce 0\n; — == | — = ~ =\nware? | 、 | re a | 2\nLO YET Se 2ST Pw. : i. we f a\neT a , an i | _— , ,\n\" * 1 加“站 rr : 一 . ;\n, , Tye & \" A Ne 本 ae e- = . ot ,\n11",
      "source_file": "14_Operator interfaces.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 2,
      "text": "IRSE News | Issue 269 | September 2020\n- tas “= oo} 下 ‘ v\na | __ Oo vt ket . \\ ‘ | DR\nrn oe\n、 Wes a a. » WR\" ot ee TS] - ”一 <7\n:AN AN dm 一, sow 4 . A ~ < on er A es P\n\\ 1 of Beg 。 v- ‘ “te _ o\nna ee at = a a . “ 1 & 2th \\ Yo ee\nExamples of NX panels In the early days there were no indications the signals to give the correct proceed aspects\nat Carlisle (left) and provided - the position of the levers provided to the train, and finally replace each signal to its\nTweedmouth (right). feedback of the state of the points and signals and = most restrictive aspect after the train has passed.\nPhotos Westinghouse , , spas . . _ ,\nArchive big windows gave good visibility of passing trains. In a complex area, this will require several lever\nA signalbox diagram showing the track layout and — operations for every train, with a significant\nlocation of signals was provided, but this simply amount of physical effort where the points and\nprovided static information such as levernumbers _ signals are mechanically operated.\nfor each point and signal.\nControl panels\nThe first indications were electro-magnetic ; ; .\n, - Some early relay interlockings retained the\ndevices where the position of a needle repeated , - , ,\na: ; traditional lever interface, with rows of miniature\nthe position of the semaphore arm of a signal that ,\n, , signalling levers on a desk, but the same result\nwas out of sight from the signalbox. These devices ; ;\n. , , can be achieved equally well using standard\nare typically mounted on the ‘block shelf’ above ; .\n, , industrial switches mounted on a control panel.\nthe levers for the signals to which they apply. In , -\n, These can be arranged in rows as in a lever\nlater years the electro-magnetic indicators were ;\n; frame, or on a schematic track diagram so that\nsuperseded by modules with coloured lamps. , . .\n, , each switch is adjacent to the representation of\nThese came to be applied more widely when lever , , _\n. the point or signal it controls. This is known as\nframes were used to electrically control colour nig ;\nlight signals and power operated points and the an individual function switch (IFS) panel, as each\nSome early relay ‘9\"°'9 oP Pp poi switch controls one point or signal, with the\n. . direct Connection between lever position and the , , ,\n: - operator making the required sequence of switch\ninterlockings outside equipment was lost.\nretained th operations to set the route for a train.\netaine e When track circuits were introduced on an ,\ntraditional lever . . aera ; A further evolution of the control interface\nintermittent basis, similar indicators were provided , , , , ,\n. \" , came with the introduction of ‘route setting\ninterface on the block shelf to show the track sections , , , , aon\n, 。 , interlockings, as described in an earlier ‘back to\noccupied by trains, but when track circuiting are ,\n, , ae basics’ article. The first examples of this were one\nbecame more widespread, a better visualisation ,\n. . , control switch (OCS) panels on which an individual\nof train location came to be provided by lamps on ; ,\nthe siqnalbox diaaram switch or button was provided to set and cancel\ng g ‘ each route within the interlocking. This was further\nThe final elements of the operator interface refined into the entrance exit (NX) panel, where\nin a mechanical signalbox are the block setting a route is achieved by operating switches\ninstruments that communicate with neighbouring — or buttons at both entrance and exit of a route on\nsignalboxes. In the early days they were purely a the schematic track diagram. This provided a very\ncommunication system, by which the operators intuitive and easy to operate interface and became\noffered and accepted trains over the block section the standard method of operation from the 1950s\nbetween the signalboxes, and the indications onwards. Points on these panels are provided\nprovided the operator with a reminder of whether ”with three-position switches - the centre position\nthe section was clear or occupied by a train. allowing the points to move as required for route\nIn later years they became true controls as an setting, and the left and right positions locking the\nelectrical interlocking prevented the starting signal points in the normal or reverse positions.\nlever being operated until the block instrument The indications provided to the operator also\nindicated ‘line clear’. , ,\nevolved to provide information on the status of\nAn inherent feature of a mechanical interface is the route locking logic within the interlocking. This\nthat when routing a train through the control area, _ is typically a row of white lights on the schematic\nthe operator has to first individually move and track diagram to show the path over each train\nlock all the points along the route, then operate detection section for which a route has been\n12",
      "source_file": "14_Operator interfaces.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 3,
      "text": "IRSE News | Issue 269 | September 2020\nSE) eS 下 Sa AT\na 上 . ‘so . be 5 7 一\nExample of a first locked. The progress of a train then appears as screen as highlighting of the symbol for the\ngeneration computer the white route lights changing to red in sequence _ signalling object to which it applies, and the\nworkstation we The along the route. interlocking must reject any attempt to operate a\nand a trackerball. This re , control with a reminder applied (this check may\nis the workstation The NX controls and indications can either aL: ar\nlling Liverpool , , a be within the computer workstation interface\nCetin be combined on a single panel, or split with where an older interlocking without this facilit\nStreet terminus in London — controls on a desk immediately in front of the 3 y\natthe first Integrated , is recontrolled).\n; operator and indications on a separate panel\nElectronic Control Centre , , ,\n(IECC) commissioned by (often wall mounted) behind the desk — the latter The number of screens is determined by the size\nBritish Rail in 1989 — still arrangement is more common for large control and complexity of the area under control. It is\nin service in 2020 but due = centres with multiple operators. usually a requirement that an overview of the\nto be upgraded in the . whole of the controlled area must be visible at any\nnear future. Computer workstations time, and this is sometimes achieved on an upper\nThe operator interface in a modern control row of screens displaying fixed areas, while the\ncentre is now usually a computer workstation, operator interacts with a lower row of screens on\nwith multiple screens to display a schematic the desk where a selected area can be displayed in\ntrack diagram of the railway under control. The more detail, and to view the status of alarms and\nindications of signalling equipment status, route other information from the system.\ntting and track tion are provided b ; .\nseming a d ack occupallo P y The overview displays may be shared between\ncolour coding of the symbols on the schematic 。 i\n, , multiple workstations — sometimes this is a very\ntrack diagram, following the conventions that . ,\noe ; ; large wall mounted display covering the whole\nwere originally established for lights on panels. . .\n“The operator control centre area. This may be provided mainly\n. . The operator interacts with the system via a for the benefit of managers or other staff in\ninterface in computer keyboard and a mouse or trackerball, the room; an alternative to this is a ‘supervisors\na modern with a mode of operation mimicking an OCS workstation’ where any of the signalling screens\ncontrol centre or NX panel, e.g. click on route entrance can be selected to be displayed on a ‘view only\n. ll symbol and select a route from a drop down basis. Some control centres now cover very large\nIs NOW Usually list, or click on entrance symbol and then exit areas, with tens of workstations controlling several\na computer symbol in sequence. hundred route kilometres of railway.\nworkstation with — One significant difference between computer Computer workstations often provide additional\nmultiple screens’ workstations and the older technologies is in the functionality beyond the standard controls and\nmethod by which an operator applies a ‘reminder’ indications, such as automatic route setting (ARS)\nto prevent themselves from operating a control; or overrun management. Some of these are\nfor instance to prevent points being moved when described later in the article.\nmaintenance is being undertaken. With levers or\na panel, the reminder is simply a physical device Technology and safety\nthat the operator attaches to the control that In the mechanical and early relay interlocking era,\nprevents it being operated — a collar on a lever, the technology for the operator interface was\nOr acap over a button or switch. On a computer simply a direct mechanical or electrical interface\nworkstation, the reminder is a software function between levers, switches, lamps and relays. The\nthat needs to be designed into the signalling concept of the signalling control system as a\nsystem. A reminder is displayed on the workstation separate entity from the interlocking appeared\n13",
      "source_file": "14_Operator interfaces.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 4,
      "text": "IRSE News | Issue 269 | September 2020\nControlled signal working in Route set ahead of train to this Short bar indicates Track section occupied by train — red\nautomatic mode signal, with overlap beyond it normal lie of points circle is axle counter reset control\nr ree e\n| (CC 可www OEE |\n| 图 有\noe\neo\nAutomatic signal with Points keyed normal and reminder ARS sub areas Main signal with Shunt\nreplacement control applied to points and signal switched on and off call-on aspect signal\nScreenshot showing when remote control systems were introduced TDMs can now incorporate this sort of logic in\ny\ntypical symbols used to allow a large control centre to interface with either the office or field end equipment.\nto provide signalling multiple interlockings over telecommunications | , |\nindications on a , , With the move to electronic interlockings and\nlinks. A remote control system comprises an ,\ncomputer workstation. , , computer workstations, the same considerations\noffice end’ that connects to the controls and\n,, apply, but the safety analysis has become more\nindications on the panel at the control centre, ae , ,\nig: , , sophisticated with the arrival of CENELEC\nand a ‘field end’ that connects to relay coils . .\n; ; standards and the concept of safety integrity\nand contacts in the interlocking. The office ;\nand field ends communicate with one another levels (SIL). It is now recognised that an operator\n, , . interface failure in combination with human\nvia a telecommunications link, so that every ; ;\n; , error could lead to an accident in abnormal\nOperation of a control on the panel energises the , . , ,\n. 。 ; . working situations and so some of the functions\ncorresponding relay in the interlocking, and a relay ;\n, i, of an operator interface are categorised as SIL\ncontact closure in the interlocking illuminates a , , ; ; .\nnage lamp on the panel. The most common form of 2 (interlockings are in the highest integrity level\nWith some a ee rare SIL 4, and non-safety functions are SIL 0).\ntvpes of rela remote control is ‘time division multiplex’ (TDM)\ntyp ; y where the signalling states are coded into a digital © Where an operator interface function needs to\ninterlockings message, which can be sent through a standard achieve a particularly high safety integrity level,\nthere is a split serial interface via a modem. TDM hardware one approach is to require a sequence of controls\nbetween the typically comprises a rack of electronics, with a to be sent to the interlocking, which will only\naa i. master processor card and a variable number of accept them if they are consistent and received\nvital’ logic in input and output cards to match the number of within a limited time window. An example of this is\nthe interlocking controls and indications required. an axle counter restoration control, which requires\nitself and ‘non With some types of relay interlockings, there is a the operator to undertake two different actions\n. . , pts ; ; (e.g. clicking on a symbol and entering a track\nvital’ logic at split between the ‘vital’ logic in the interlocking ;\ng - , , section name), which generate separate messages\nitself, and ‘non-vital’ logic at the operator ,\nthe operator , , from the interface to the interlocking. This process\n. interface. Examples of non-vital logic are , -\ninterface” t lati provides protection against human error by the\nranslating push button sequences into a route ,\nen ; operator and spurious messages generated as a\nrequest, or the logic to extinguish a white route ;\n; , result of a fault in the interface.\nlamp when the corresponding red track circuit\nlamp is lit. These are considered non vital because The hardware and software architecture for a\nthe impact of a failure of the remote control computer workstation is generally based on\nsystem that generates an incorrect control to commercial off the shelf (COTS) computing\nthe interlocking is the same as a human error in components, engineered into a system that will\nOperating this control, and should be protected achieve the necessary SIL and availability targets.\nby the interlocking logic. Similarly, an incorrect Except for the smallest installations, this will\nindication can only result in a hazard if it misleads imply duplication of all the critical components\nthe operator to undertake an unsafe action. The and data links to avoid single points of failure.\nnon vital logic was implemented in smaller and The architecture varies between suppliers, but\ncheaper ‘post office’ relays or in an electronic in recent years there has been a trend towards\n‘panel processor’. Modern microprocessor based a ‘client/server’ approach that decouples the\n14",
      "source_file": "14_Operator interfaces.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 5,
      "text": "IRSE News | Issue 269 | September 2020\ninterfaces to the interlockings and the area-wide Alarms and overrun management\nfunctions such as automatic route setting and Whatever the technology, the interface will\ntrain describer (see below) from the operator provide a number of alerts and alarms. Some\ninterfaces. This allows the areas controlled by the of these relate to equipment failures, and\nworkstations to be dynamically reconfigured, for others to events that the operator needs to\ninstance to reduce the number of workstations be aware of. A typical example will be a train\ninet need © m staffed at To alow dynamic describer alarm when a track section becomes\nEXTENSION OF Ms CONCEP unexpectedly occupied.\nreconfiguration between control centres — for P 7 P\ninstance to provide a backup disaster recovery A specific alarm for signal passed at danger (SPAD)\nfacility to maintain train operations when the was introduced in the UK as a result of the public\n\n7 primary control centre building has to be inquiry recommendations following the Ladbroke\nThe operator evacuated as a result of a terrorist attack ora Grove accident in 1999. When a track section\nalso needs to natural disaster. occupation sequence occurs at a red signal which\n。 ; D a distincti\nof each train The track occupation indications on a panel signal is highlighted on the workstation screens.\nor workstation show where there are trains in On some recent installations with computer\nthe controlled area, but the operator (or ARS) workstations this facility has been further\nalso needs to know the identity of each train so enhanced with an automated response to the\nmat i ot Pe routes correct. Each train we SPAD event to stop other trains in the area. The\nCometimes Cd a 人eadca ie) anc dthese wre processor in the interface system sends requests\ndisplayed to th tor b t k to the interlocking to replace other signals on the\nsplayed to me operator by a system KNOWN as approach to the SPAD area. This is Known as a\na ‘train describer’. Train describers were one of ‘predefined operational protection’ (POP) control\nthe earliest applications of computer technolo wa, eg ; ‘\nin signalling and with a control panel the train Providing this capability in the sil 2 Interface\ndescriber is a dedicated processor interfaced system can allow simplification of logic in the SIL\ned P , 4 interlocking.\nto small alphanumeric displays set into the\nindications panel, or a separate computer screen. Automatic Route Setting\nOn acomputer workstation the train describer is Modern control centres with computer\nmpy 2 sonar On ee the yee with workstations often include an automatic route\n| © fon on ther splayed a © “ther ease e setting (ARS) facility. This reduces the operator\nOcatlons On Me mall) screens. 11 einer Case a workload linked to routine train movements,\nuser interface to the train describer is required to allowing them to focus on problem areas and\nallow an CRere 0 ° enter Ksometimes referee to tasks that require voice communications with staff\nas ‘interposing’), delete an amen train numbers and the public.\nor enter other codes such as line blocked.\n, , , , ARS is usually a separate processor within the\nAs conventional lineside signalling does not operator interface system that monitors the\nprovide a data path for a train to report its identity movement of trains as reported by the train\nthe contro cone the es De oven describer, and uses an electronic version of the\nthe train number to 0e ily or the ting , ot an timetable for the day to identify which routes\nPer or hea y trom the ditthe © should be set to allow each train to run through\nat t ie ean © ‘t th vans the controll be ab the controlled area on its planned path and\ntrac ”> ie train throug © COmromed area DY timings. Where possible the objective is to set\n“Modern control Toorng the sequence orroute oes ene routes sufficiently far anead of the train so the\n. track section occupation. The train describer logic ;\ncentres with is based on the concept that trains move between driver always sees green signals, although there\ncomputer ‘berths’ — when a train is in the berth associated ore exceptions to ins, 9. were Vendy tostart\nworkstations with a signal, it means this is the next signal it will message from platform staff\noften include an encounter in its journey. Additional berths are\n。 provided at locations where trains may reverse, or | An important principle is that ARS should not\nautomatic route where permissive working allows more than one ‘challenge’ the interlocking by requesting a route\nsetting facility” train in a section. that is not available to be set. This requires the ARS\nWhen a train passes from one control area to to be programmed with a copy of the interlocking\n; ; route availability logic and to monitor the\nanother, the train number is transmitted as a data ,\nmessage between the train describers for the two signalling states such as track occupancy, route\n; locking and reminders.\nareas. Similar data messages reporting every train 3\nstep are also sent from each train describer to a When trains are running late, it is very likely that\nnational train running information system, which conflicts will arise where two trains require to\nprovides the data source for real time customer run over the same section of track at the same\nand staff information displays, automated public time. This can arise when routes converge or\naddress announcements, and recording systems cross, and at crossing points on single lines (see\nfor performance monitoring. the article by John Francis in the June 2020\nIRSE News for some examples). ARS requires an\n15",
      "source_file": "14_Operator interfaces.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 6,
      "text": "IRSE News | Issue 269 | September 2020\nalgorithm to decide which train to give priority in ETCS level 2 introduces a communication link\nthese circumstances — this might be to keep the between the train and a radio block centre (RBC),\ntrains in timetable order, ‘first come first served’ and this may require an operator interface,\nor a comparison of the predicted train delays for to provide information on the ETCS mode of\nthe alternative options. At the design stage fora operation of each train, and to allow updating of\n“Traditi ll new installation, workshops with operators who temporary speed restrictions. In early applications\nra | lonally are experienced with the train service in the area these functions have not been integrated into the\nthe timetable are a valuable source of information to tailor the primary operator interface system (which is only\nused by ARS was algorithms for each potential area of conflict. linked to the interlocking), and a separate stand\n. , alone terminal from the ETCS supplier provides an\nupdated on a re ope ratr retains une capanuyie sooo operator interface to the RBC. As ETCS becomes\ndaily basis from the o erator can switch off ARS for an individual more widespread, more integrated solutions are\nthe national 7 OP , , - . likely to evolve.\n\" ; train, or for an ‘ARS sub-area’, typically a single\ntrain planning junction or running line between stations. ARS Metros\nsystems” sub-areas will also be automatically switched On modern metros with CBTC signalling,\noff if an operator cancels a route that has been , ,\n, the system architecture generally includes a\nset by ARS, a SPAD is detected, or a signal group tk ‘aut tic trai we,\nlacement control is operated component known as ‘automatic train supervision\nrep , (ATS), and this incorporates the operator interface,\nTraffic management including automatic route setting and traffic\nTraditionally the timetable used by ARS was management functions. ATS interfaces with ;\n. , , , automatic train operation (ATO) so that decisions\nupdated on a daily basis from the national train . , ,\n; ; made in the control centre can directly influence\nplanning systems. Since ARS can only set routes ; ;\n, ,, movement of trains without involvement of\nfor trains according to the timetable, additional a human driver\ntrains and those required to deviate from the\ntimetable have to be routed manually by the For most metros the key parameter being\noperator. This can be avoided if ARS can be managed is not the adherence to the timetable,\nprovided with a dynamic timetable, updated but the regularity of trains, and the operator\nthroughout the day with changes to the plan. This _ interface allows this to be monitored and\nis the concept behind ‘traffic management’ which managed. If two trains are running close together,\naims to move away from operators making train ATS can delay the departure of the second train\nrouting decisions in real time, to a process where from a station to even out the gaps in the service,\nissues are identified well in advance, and solutions _ or instruct the ATO to run at reduced speeds\nare identified and incorporated into the dynamic between stations to save energy.\ntimetable so that all trains can be routed by ARS. .\n. Integration of systems\nTraffic management systems are another layer of This article has described the operator interface\nfunctionality that sit above the primary operator ; ; ; ;\n, , 。 , , for the core signalling functions, but in a modern\ninterfaces described in this article. The interface\n, , , control centre the person at a control panel or\nwith the signalling is via timetable updates to ARS, , , .\n- , , computer workstation will also have to interact\nso there is minimal safety impact (i.e. SIL 0). They\niso b db t ho h trateai with a number of other systems. Examples of\nmay also DE USE? DY OPETators W 10 ave s fa €9IC this can include voice communications with train\nresponsibility for a whole route, a ‘controller’ or , , ,\n, , , drivers and track workers, closed circuit television\ndespatcher rather than a ‘signaller’. The user ae ; ;\n, , , , (CCTV) monitoring of level crossings and stations,\ninterface is usually in the form of a train graph or es ; ;\n; ; monitoring systems for vehicle or infrastructure\na platform occupation chart, which shows the , ,\n, faults, passenger and staff information systems,\nplanned, actual and predicted movement of each ,\n, ae ar supervisory control and data acquisition (SCADA)\n“For most train and highlights trains that are deviating from systems for electric traction power supply. and\nthe plan and the consequential conflicts with y ; OP PP’.\nmetros the key . . , even corporate information technology (IT)\n; other trains and with planned line blockages. Edit applications such as emails and timesheets\nparameter being facilities allow trains to be rescheduled, rerouted\nma naged is not or cancelled, and additional trains to be inserted Traditionally there has been little integration of\nth dh t into the timetable. There may also be a ‘what if’ the operator interfaces for these systems - a\ne a erence to facility to allow an operator to try out alternative typical computer workstation will have a separate\nthe timetable but — options for rescheduling, evaluate the impact on terminal on the desk for voice communications,\nthe regularity of train delays and other key performance indicators ”an office type personal computer for the\ntrains” for the train service, and then deploy the chosen corporate IT network, and dedicated screens\noption into the dynamic timetable. for CCTV monitoring. The technology exists\n. . to integrate all of these into a single interface,\nTrain protection and ERTMS/ETCS but there are practical, commercial and safety\nTrain protection systems overlaid onto assurance obstacles to integrating systems from\nconventional lineside signalling using track different suppliers when there are no standard\nmounted equipment to communicate with the interface specifications, and differing system\ntrain (e.g. TPWS in the UK) have little impact on architectures, SIL requirements and system\nthe operator interface, other than perhaps an lifecycles. An integrated solution is most likely to\nindication to warn of equipment failure. be seen on turnkey project to build a new metro\nor high speed line.\n16",
      "source_file": "14_Operator interfaces.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 7,
      "text": "IRSE News | Issue 269 | September 2020\nTraffic management in action\nae ee Be _ 7 _ oo _ 7 _ 7 _ - _ 1\ne ee ety - t pe Beane tte we 2 rotate ree theget OP segs . 2 | wrens Be : . B=\nPADTOTMN Se 加 ~ cu < . . 0 on ochAer. teers rere. 4\nHTewAJN 人 a SA ae A\\ bf Mee f\\ eo\nOT rsh i) V AX 5 \\ \\> ;\nrata R a Ly? js fl aa (| me 口=\nwy ,/ ONT AAA\nDAN VL DEEPEN |\nMO\\hEAD : 7 oo \\S [x SA 人A\\ “ wt SRG ees *\nwits Feats Lee 四 一 一一\n2可 加 ui ;\nThe figures above are examples of a traffic management and each platform is represented by a horizontal row\nuser interface — these are from the Luminate system with rectangles representing each train and the time it\nsupplied by Resonate for Network Rails Western route. occupies the platform. In this case the trains are colour\nThe train graph (above) represents each train as a line on coded to highlight whether they are running on time or\nthe graph, the X axis is time and Y axis is distance along late. The panel to the right on each screen gives statistics\nthe route (Paddington to Reading). The violet vertical relevant to key performance indicators for the train service\nbar is the current time with actual train movements performance and identifies trains that may incur penalties\nto the left and predicted movement to the right. The for late running.\nplatform docker (below) shows platform occupancy Screenshots from Resonate Group Limited.\nat a passenger station (Slough). The X axis is again time,\n17",
      "source_file": "14_Operator interfaces.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 8,
      "text": "IRSE News | Issue 269 | September 2020\nHuman factors\nIt goes without saying that an effective operator interface to About the author ...\nthe signalling system must be designed with the operator in lan Mitchell has 45 years’ experience in the rail industry, in\nmind, and human factors specialists have played an increasingly British Rail Research and its post-privatisation successor\nimportant role in design of modern control centres. This starts companies — AEA Technology Rail, DeltaRail and Resonate.\nwith workload analysis to determine how large an area of He retired as professional head of signalling in 2011, but still\nrailway can be effectively managed by an individual operator, does some consultancy for his previous employers as well\nas this will determine the number of workstations and hence as acting as one of editors of IRSE News and as a member\nthe size of the control room. The constraining factor will of the International Technical Committee. He presented a\nbe determined by the level of automation in the system; for Presidential Paper on the topic “Signalling Control Centres\ninstance where ARS is provided, the workload during busy Today and Tomorrow\" in 2003, and is due to deliver another\nperiods of train operations may be less than at night when the in 2021 jointly with Nora Balfe, who is a human factors\noperator has to manage line blockages for work on the track. specialist with Irish Rail.\nAt a more detailed level, the size of text and symbols on\nthe screens, the number of screens and their location on \" - a\nthe desk, the height of the desk and even the type of chair Back to basics’ and the IRSE Exam\nall need consideration to ensure the operator remains alert We hope that our “Back to basics” articles are particularly\nand comfortable. interesting to those of you who are new to the industry\n. and are working to build up your knowledge. For those\nConclusion considering taking the IRSE exam, these articles should be\nAs with other areas of signalling technology, the evolution particularly relevant for your studies.\nfrom levers to computer mouse has been dramatic, but the A | h tthink about h id\nfundamental principles of controls and indications remain. ih an vection f, Ww he 2015 Me dul 5 of the. wou based or\nWhat has changed the most is the level of automation; modern Is ques fon rom ine cule 2 OF ine exam, based on\nar ; , what you've learnt from the article?\nsystems now require little human intervention when the railway\nis running to plan, but an experienced operator and a well Describe, with the aid of a drawing, the layout of either a\ndesigned human interface are still crucial in dealing with failures mimic panel or a signaller’s VDU display control system.\nand unexpected scenarios. You should include details of how each of the following\n, , , , , are dealt with:\nOne of the lectures later in this year’s Presidential Programme\nwill specifically explore the issue of automation in control i) Route Setting and cancellation [4 marks].\ncentres — what are the strengths and weakness of existing ii) Manual movement of points [3 marks].\nsystems, what further tasks could be automated, and how iii) Train detection status during normal and failure\ndo we ensure the human and computer work together conditions [4 marks].\nt effectively?\nmost emeciVely iv) Protection of different types of engineering\nwork [3 marks].\nv) How a major failure of the display would be\nmanaged [4 marks].\nvi) Signals Passed at Danger [2 marks].\nVancouver's Canada Line was equipped from opening with an vii) Train identification [3 marks].\nintegrated control centre, bringing a range of signalling, station and we . .\ncommunication functions together at one workstation. viii) Adjacent signal box alarms [2 marks].\nPhoto Siemens Mobility.\nDa —— y t P 1 _ mea x q i g _ .\n四 \\ ; . e 、 ‘ . aut\n_- - : a - , 4 , . ie 后 : , 4 |\nBo -一 | ae oe : -\npe 2 ROI ! -\n本 ” 过 i | : 4 a } f j\ngs, Bt eo 一 本 ,\n4 e a i\naen \"10s\n\n18",
      "source_file": "14_Operator interfaces.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    }
  ]
}