{
  "doc_id": "ab3a67c1-c140-4c2d-ad60-942e962396e1",
  "pages": [
    {
      "page_number": 1,
      "text": "IEEE SA =\";\nASSOCIATION _\nIEEE Standard for Communications- Y)\nBased Train Control (CBTC) Performance ‘a\nand Functional Requirements Gy\nIEEE Vehicular Technology Society in\na\nDeveloped by the\nRail Transportation Standards Committee\nIEEE Std 1474.1TM-2025\n(Revision of IEEE Std 1474.1-2004)\nIEEE",
      "source_file": "IEEE Std 1474.1-2025 IEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 2,
      "text": "IEEE Std 1474.1TM-2025\n(Revision of IEEE Std 1474.1-2004)\nIEEE Standard for Communications-\nBased Train Control (CBTC) Performance\nand Functional Requirements\nDeveloped by the\nRail Transportation Standards Committee\nof the\nIEEE Vehicular Technology Society\nApproved 27 March 2025\nIEEE SA Standards Board",
      "source_file": "IEEE Std 1474.1-2025 IEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": false,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 3,
      "text": "Abstract: Performance and functional requirements for a communications-based train control\n(CBTC) system are established in this standard. A CBTC system is a continuous, automatic train\ncontrol system utilizing high-resolution train location determination, independent of track circuits;\ncontinuous, high-capacity, bidirectional train-to-wayside data communications; and train-borne and\nwayside processors capable of implementing automatic train protection (ATP) functions, as well\nas optional automatic train operation (ATO) and automatic train supervision (ATS) functions. In\naddition to CBTC functional requirements, this standard also defines headway criteria, system\nsafety criteria, and system availability criteria fora CBTC system. This standard is applicable to the\nfull range of transit applications including automated people movers. This standard establishes a\nset of performance and functional requirements necessary for enhancing performance, availability,\noperations, and train protection using a CBTC System.\n\nKeywords: automation, CBTC, communications, IEEE 1474.1, signaling, train control\n\nThe Institute of Electrical and Electronics Engineers, Inc.\n\n3 Park Avenue, New York, NY 10016-5997, USA\n\nCopyright © 2025 by The Institute of Electrical and Electronics Engineers, Inc. All rights reserved.\n\nPublished 13 June 2025. Printed in the United States of America.\n\nIEEE is a registered trademark in the U.S. Patent & Trademark Office, owned by The Institute of Electrical and Electronics Engineers,\nIncorporated.\n\nPDF: ISBN 979-8-8557-1565-1 STD27822\n\nPrint: ISBN 979-8-8557-1566-8 STDPD27822\n\nIEEE prohibits discrimination, harassment, and bullying.\n\nFor more information, visit https://www.ieee.org/about/corporate/governance/p9-26. html.\n\nNo part of this publication may be reproduced in any form, in an electronic retrieval system or otherwise, without the prior written permission\nof the publisher.",
      "source_file": "IEEE Std 1474.1-2025 IEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 4,
      "text": "Important Notices and Disclaimers Concerning IEEE Standards Documents\nIEEE Standards documents are made available for use subject to important notices and legal disclaimers. These\nnotices and disclaimers, or a reference to this page (https://s tandards .ieee. org/ ipr/ disclaimers. html), appear in\nall IEEE standards and may be found under the heading “Important Notices and Disclaimers Concerning IEEE\nStandards Documents.”\nNotice and Disclaimer of Liability Concerning the Use of IEEE Standards\nDocuments\nIEEE Standards documents are developed within IEEE Societies and subcommittees of IEEE Standards\nAssociation (IEEE SA) Board of Governors. IEEE develops its standards through an accredited consensus\ndevelopment process, which brings together volunteers representing varied viewpoints and interests to\nachieve the final product. IEEE standards are documents developed by volunteers with scientific, academic,\nand industry-based expertise in technical working groups. Volunteers involved in technical working groups\nare not necessarily members of IEEE or IEEE SA and participate without compensation from IEEE. While\nIEEE administers the process and establishes rules to promote fairness in the consensus development process,\nIEEE does not independently evaluate, test, or verify the accuracy of any of the information or the soundness\nof any judgments contained in its standards.\nIEEE makes no warranties or representations concerning its standards, and expressly disclaims all warranties,\nexpress or implied, concerning all standards, including but not limited to the warranties of merchantability,\nfitness for a particular purpose and non-infringement IEEE Standards documents do not guarantee safety,\nsecurity, health, or environmental protection, or compliance with law, or guarantee against interference with\nor from other devices or networks. In addition, IEEE does not warrant or represent that the use of the material\ncontained in its standards is free from patent infringement. IEEE Standards documents are supplied “AS IS”\nand “WITH ALL FAULTS.”\nUse of an IEEE standard is wholly voluntary. The existence of an IEEE standard does not imply that there\nare no other ways to produce, test, measure, purchase, market, or provide other goods and services related to\nthe scope of the IEEE standard. Furthermore, the viewpoint expressed at the time a standard is approved and\nissued is subject to change brought about through developments in the state of the art and comments received\nfrom users of the standard.\nIn publishing and making its standards available, IEEE is not suggesting or rendering professional or other\nservices for, or on behalf of, any person or entity, nor is IEEE undertaking to perform any duty owed by any\nother person or entity to another. Any person utilizing any IEEE Standards document should rely upon their\nown independent judgment in the exercise of reasonable care in any given circumstances or, as appropriate,\nseek the advice of a competent professional in determining the appropriateness of a given IEEE standard.\nIN NO EVENT SHALL IEEE BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,\nEXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO: THE\nNEED TO PROCURE SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;\nOR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,\nWHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR\nOTHERWISE) ARISING IN ANY WAY OUT OF THE PUBLICATION, USE OF, OR RELIANCE\nUPON ANY STANDARD, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE AND\nREGARDLESS OF WHETHER SUCH DAMAGE WAS FORESEEABLE.\n3\nCopyright © 2025 IEEE. All rights reserved.",
      "source_file": "IEEE Std 1474.1-2025 IEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": false,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 5,
      "text": "Translations\nThe IEEE consensus balloting process involves the review of documents in English only. In the event that\nan IEEE standard is translated, only the English language version published by IEEE is the approved IEEE\nstandard.\nUse by artificial intelligence systems\nIn no event shall material in any IEEE Standards documents be used for the purpose of creating, training,\nenhancing, developing, maintaining, or contributing to any artificial intelligence systems without the express,\nwritten consent of IEEE SA in advance. “Artificial intelligence” refers to any software, application, or other\nsystem that uses artificial intelligence, machine learning, or similar technologies, to analyze, train, process, or\ngenerate content. Requests for consent can be submitted using the Contact Us form.\nOfficial statements\nA statement, written or oral, that is not processed in accordance with the IEEE SA Standards Board Operations\nManual is not, and shall not be considered or inferred to be, the official position of IEEE or any of its\ncommittees and shall not be considered to be, or be relied upon as, a formal position of IEEE or IEEE SA. At\nlectures, symposia, seminars, or educational courses, an individual presenting information on IEEE standards\nshall make it clear that the presenter’s views should be considered the personal views of that individual rather\nthan the formal position of IEEE, IEEE SA, the Standards Committee, or the Working Group. Statements\nmade by volunteers may not represent the formal position of their employer(s) or affiliation(s). News releases\nabout IEEE standards issued by entities other than IEEE SA should be considered the view of the entity issuing\nthe release rather than the formal position of IEEE or IEEE SA.\nComments on standards\nComments for revision of IEEE Standards documents are welcome from any interested party, regardless of\nmembership affiliation with IEEE or IEEE SA. However, IEEE does not provide interpretations, consulting\ninformation, or advice pertaining to IEEE Standards documents.\nSuggestions for changes in documents should be in the form of a proposed change of text, together with\nappropriate supporting comments. Since IEEE standards represent a consensus of concerned interests, it is\nimportant that any responses to comments and questions also receive the concurrence of a balance of interests.\nFor this reason, IEEE and the members of its Societies and subcommittees of the IEEE SA Board of Governors\nare not able to provide an instant response to comments or questions, except in those cases where the matter\nhas previously been addressed. For the same reason, IEEE does not respond to interpretation requests. Any\nperson who would like to participate in evaluating comments or revisions to an IEEE standard is welcome to\njoin the relevant IEEE SA working group. You can indicate interest in a working group using the Interests tab\nin the Manage Profile and Interests area of the IEEE SA myProject system.1 An IEEE Account is needed to\naccess the application.\nComments on standards should be submitted using the Contact Us form.2\nLaws and regulations\nUsers of IEEE Standards documents should consult all applicable laws and regulations. Compliance with\nthe provisions of any IEEE Standards document does not constitute compliance to any applicable regulatory\n1 Available at: https:// development. standards .ieee. org/ myproject- web/ public/v iew .html #landing.\n2 Available at: https:// standards .ieee .org/ about/c ontact/.\n4\nCopyright © 2025 IEEE. All rights reserved.",
      "source_file": "IEEE Std 1474.1-2025 IEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": false,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 6,
      "text": "requirements. Implementers of the standard are responsible for observing or referring to the applicable\nregulatory requirements. IEEE does not, by the publication of its standards, intend to urge action that is not in\ncompliance with applicable laws, and these documents may not be construed as doing so.\nData privacy\nUsers of IEEE Standards documents should evaluate the standards for considerations of data privacy and\ndata ownership in the context of assessing and using the standards in compliance with applicable laws and\nregulations.\nCopyrights\nIEEE draft and approved standards are copyrighted by IEEE under US and international copyright laws. They\nare made available by IEEE and are adopted for a wide variety of both public and private uses. These include\nboth use by reference, in laws and regulations, and use in private self-regulation, standardization, and the\npromotion of engineering practices and methods. By making these documents available for use and adoption\nby public authorities and private users, neither IEEE nor its licensors waive any rights in copyright to the\ndocuments.\nPhotocopies\nSubject to payment of the appropriate licensing fees, IEEE will grant users a limited, non-exclusive license to\nphotocopy portions of any individual standard for company or organizational internal use or individual, non-\ncommercial use only. To arrange for payment of licensing fees, please contact Copyright Clearance Center,\nCustomer Service, 222 Rosewood Drive, Danvers, MA 01923 USA; +1 978 750 8400; https://w ww .copyright\n.com/ . Permission to photocopy portions of any individual standard for educational classroom use can also be\nobtained through the Copyright Clearance Center.\nUpdating of IEEE Standards documents\nUsers of IEEE Standards documents should be aware that these documents may be superseded at any time\nby the issuance of new editions or may be amended from time to time through the issuance of amendments,\ncorrigenda, or errata. An official IEEE document at any point in time consists of the current edition of the\ndocument together with any amendments, corrigenda, or errata then in effect.\nEvery IEEE standard is subjected to review at least every 10 years. When a document is more than 10 years old\nand has not undergone a revision process, it is reasonable to conclude that its contents, although still of some\nvalue, do not wholly reflect the present state of the art. Users are cautioned to check to determine that they have\nthe latest edition of any IEEE standard.\nIn order to determine whether a given document is the current edition and whether it has been amended through\nthe issuance of amendments, corrigenda, or errata, visit IEEE Xplore or contact IEEE.3 For more information\nabout the IEEE SA or IEEE’s standards development process, visit the IEEE SA Website.\nErrata\nErrata, if any, for all IEEE standards can be accessed on the IEEE SA Website.4 Search for standard number and\nyear of approval to access the web page of the published standard. Errata links are located under the Additional\nResources Details section. Errata are also available in IEEE Xplore. Users are encouraged to periodically\ncheck for errata.\n3 Available at: https:// ieeexplore. ieee .org/ browse/ standards/ collection/i eee.\n4 Available at: https:// standards .ieee .org/ standard/i ndex .html.\n5\nCopyright © 2025 IEEE. All rights reserved.",
      "source_file": "IEEE Std 1474.1-2025 IEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": false,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 7,
      "text": "Patents\nIEEE standards are developed in compliance with the IEEE SA Patent Policy.5\nAttention is called to the possibility that implementation of this standard may require use of subject matter\ncovered by patent rights. By publication of this standard, no position is taken by the IEEE with respect to the\nexistence or validity of any patent rights in connection therewith. If a patent holder or patent applicant has\nfiled a statement of assurance via an Accepted Letter of Assurance, then the statement is listed on the IEEE\nSA Website at https://s tandards .ieee. org/ about/s asb/ patcom/p atents .html. Letters of Assurance may indicate\nwhether the Submitter is willing or unwilling to grant licenses under patent rights without compensation\nor under reasonable rates, with reasonable terms and conditions that are demonstrably free of any unfair\ndiscrimination to applicants desiring to obtain such licenses.\nEssential Patent Claims may exist for which a Letter of Assurance has not been received. The IEEE is not\nresponsible for identifying Essential Patent Claims for which a license may be required, for conducting inquiries\ninto the legal validity or scope of Patents Claims, or determining whether any licensing terms or conditions\nprovided in connection with submission of a Letter of Assurance, if any, or in any licensing agreements are\nreasonable or non-discriminatory. Users of this standard are expressly advised that determination of the\nvalidity of any patent rights, and the risk of infringement of such rights, is entirely their own responsibility.\nFurther information may be obtained from the IEEE Standards Association.\nIMPORTANT NOTICE\nTechnologies, application of technologies, and recommended procedures in various industries evolve over\ntime. The IEEE standards development process allows participants to review developments in industries,\ntechnologies, and practices, and to determine what, if any, updates should be made to the IEEE standard.\nDuring this evolution, the technologies and recommendations in IEEE standards may be implemented in ways\nnot foreseen during the standard’s development. IEEE standards development activities consider research\nand information presented to the standards development group in developing any safety recommendations.\nOther information about safety practices, changes in technology or technology implementation, or impact\nby peripheral systems also may be pertinent to safety considerations during implementation of the standard.\nImplementers and users of IEEE Standards documents are responsible for determining and complying with all\nappropriate safety, security, environmental, health, data privacy, and interference protection practices and all\napplicable laws and regulations.\n5 Available at: https:// standards .ieee .org/ about/s asb/ patcom/m aterials. html.\n6\nCopyright © 2025 IEEE. All rights reserved.",
      "source_file": "IEEE Std 1474.1-2025 IEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": false,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 8,
      "text": "Participants\nAt the time this IEEE standard was completed, the Communications-Based Train Control Working Group had\nthe following membership:\nYousef Kimiagar, Chair\nDave Keevill, Vice Chair\nRajee Alexander Neil Glennie Ajay Nayyar\nKurt Andersen Ivan Grigorchenkov Kourosh Noori\nRidhzuan Awang John Hofbauer Lisaidyn Perez\nPhilippe Ayrault Kenneth Karg Lou Sanders\nYarah Ismail Ali Srinivas Kumar Will Serrano\nBasyoni Katreddi Ali Siadati\nNicholas Columbare Benjamin Koers Narayana Sundaram\nMuamer Dedovic Robert Major Dan Testa\nKenneth Diemunsch David Male Carl Thompson\nDavid Dimmer Wilson Milian Michael Thornburg\nStephane Dubois Venugopal Nair David Thurston\nAlireza Edraki Mehmet Turan\nAntonio Sdylemez\nGaite De Las Heras Lamont Ward\nThe following members of the individual Standards Association balloting group voted on this standard.\nBalloters may have voted for approval, disapproval, or abstention.\nRajee Alexander Andrew Jones Stephan Sand\nDavid Dimmer Kenneth Karg Carl Schwellnus\nMarc Emmelmann Piotr Karocki Jhony Sembiring\nAntonio Srinivas Kumar Carl Thompson\nGaite De Las Heras Katreddi Michael Thornburg\nMarco Hernandez Yousef Kimiagar David Thurston\nWerner Hoelzl Wilson Milian John Vergis\nOliver Holland Kourosh Noori Weiping Wu\nDev Paul\nWhen the IEEE SA Standards Board approved this standard on 27 March 2025, it had the following\nmembership:\nLei Wang, Chair\nJon Walter Rosdahl, Vice Chair\nDavid J. Law, Past Chair\nAlpesh Shah, Secretary\nEdward Au Guido R. Hiertz Daleep C. Mohla\nTed Burse Ronald W. Hotchkiss Annette D. Reilly\nXiaofeng (Alfred) Chen Tyler L. Jaynes Robby Robson\nDoug Edwards Thomas Koshy Daniel Sabin\nNehad El-Sherif Howard Li F. Keith Waters\nJ. Travis Griffith Xiaohui Liu Sha Wei\nDeborah R. Hagar Kevin W. Lu Luyang (Eric) Zhang\nHiroshi Mano\n7\nCopyright © 2025 IEEE. All rights reserved.",
      "source_file": "IEEE Std 1474.1-2025 IEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 9,
      "text": "Introduction\nThis introduction is not part of IEEE Std 1474.1-2025, IEEE Standard for Communications-Based Train Control\n(CBTC) Performance and Functional Requirements.\nThis introduction provides some background on the rationale used to develop this standard. This information\nis meant to aid in the understanding, usage, and applicability of this standard.\nConventional signaling/train control systems rely almost exclusively on track circuits to detect the presence of\ntrains. Information on the status of the track ahead is provided to train operators either through wayside signals\nor train-borne cab signals. Ensuring compliance with the signals is achieved through operating procedures,\nwayside automatic train stops, or train-borne supervisory equipment linked to the train’s braking system.\nThese conventional systems are effective in providing train protection, but are not particularly efficient\nin maximizing the utilization of the rail transit infrastructure, as a result of a few fundamental limitations,\nspecifically, the following:\n\na) The location of trains can only be determined to the resolution of the track circuits; if any part of a\ntrack circuit is occupied by a train, the whole track circuit shall be assumed to be occupied by the\ntrain. Track circuits can be made shorter, but each additional track circuit requires additional wayside\nhardware, so there is an economical and practical limit to the number of track circuits that can be\nprovided.\n\nb) The information that can be provided to a train is limited to a small number of wayside signal aspects\nor a small number of speed codes in a cab signal system.\n\nc) For a wayside signal system with automatic train stops but without continuous cab signaling,\nenforcement is intermittent.\n\nCommunications-based train control (CBTC) systems overcome these fundamental limitations of conventional\ntrack circuit-based systems, and therefore, permit more effective utilization of the transit infrastructure. This\nis accomplished, for example, by allowing trains to operate safely at much closer headways, by permitting\ngreater flexibility and greater precision in train control, and by providing continuous safe train separation\nassurance and overspeed protection. Additional benefits of CBTC technology include the economical\nsupport of automatic train operations (both on the mainline and in maintenance yards), improved reliability,\nand reductions in maintenance costs through a reduction in wayside equipment and real-time diagnostic\ninformation. The basic characteristics of a CBTC system include the following:\n\n— Determination of train location, to a high degree of precision, independent of track circuits.\n\n— A geographically continuous train-to-wayside and wayside-to-train data communications network\nto permit the transfer of significantly more control and status information than is possible with\nconventional systems.\n\n— Wayside and train-borne vital processors to process the train status and control data and provide\ncontinuous automatic train protection (ATP). Automatic train operation (ATO) and automatic train\nsupervision (ATS) functions can also be provided, as required by the particular application.\n\nThere are currently no independent standards defining the performance and functional requirements to be\nsatisfied by CBTC systems. This standard enhances performance, availability, operations, and train protection,\nand facilitates design, development, deployment and commissioning of new CBTC applications.\nThis standard provides standards for Communications Based Train Control functionality. It provides a\nconsistent approach for design and development of these transit control systems. This revision allows for\ndriverless train operation, including automatic people movers.\nAs technology changes and evolves the architecture and functionality, and subsequently the standards, of\nCommunications-Based Train Control require modification. This revision provides the vehicle to modify\nCBTC standards to comply with changing needs in function and safety.\n8\nCopyright © 2025 IEEE. All rights reserved.",
      "source_file": "IEEE Std 1474.1-2025 IEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 10,
      "text": "Contents\n1. Overview ...................................................................................................................................................11\n1.1 Scope ..................................................................................................................................................11\n1.2 Purpose ...............................................................................................................................................11\n1.3 Range of Applications ........................................................................................................................11\n1.4 Existing Applications .........................................................................................................................11\n1.5 Word usage .........................................................................................................................................12\n2. Normative references ................................................................................................................................12\n3. Definitions, acronyms, and abbreviations .................................................................................................13\n3.1 Definitions ..........................................................................................................................................13\n3.2 Acronyms and abbreviations ..............................................................................................................16\n4. General requirements ................................................................................................................................17\n4.1 Characteristics of CBTC systems .......................................................................................................17\n4.2 Categorization of CBTC systems .......................................................................................................17\n4.3 Train Configurations ...........................................................................................................................17\n4.4 Train operating modes ........................................................................................................................17\n4.5 Entering/exiting CBTC territory .........................................................................................................20\n4.6 Train operating speeds ........................................................................................................................20\n5. Performance requirements ........................................................................................................................21\n5.1 CBTC factors contributing to achievable headways ...........................................................................21\n5.2 CBTC factors contributing to achievable trip times ............................................................................21\n5.3 System safety requirements ................................................................................................................22\n5.4 System assurance requirements ..........................................................................................................25\n5.5 Environmental requirements ..............................................................................................................27\n6. Functional requirements ............................................................................................................................27\n6.1 ATP functions .....................................................................................................................................27\n6.2 ATO functions .....................................................................................................................................35\n6.3 ATS functions .....................................................................................................................................37\n6.4 Interoperability interface requirements ..............................................................................................41\nAnnex A (informative) Bibliography ..............................................................................................................42\nAnnex B (informative) Example functional block diagram for a typical CBTC system .................................43\nAnnex C (informative) Typical CBTC parameters .........................................................................................44\nAnnex D (informative) Typical safe braking model .......................................................................................45\nAnnex E (normative) System Safety and Security Program requirements .....................................................48\nAnnex F (informative) Typical approaches to specifying CBTC system availability .....................................58\n9\nCopyright © 2025 IEEE. All rights reserved.",
      "source_file": "IEEE Std 1474.1-2025 IEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements.pdf",
      "garbled": true,
      "garbled_reason": "low_informative_ratio",
      "ocr_used": false,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 11,
      "text": "List of Figures\nFigure B.1—Example functional block diagram for a typical CBTC system .................................................43\nFigure D.1—Typical safe braking model .......................................................................................................47\nList of Tables\nTable C.1—Typical CBTC parameters ...........................................................................................................44\nTable E.1—Risk assessment ...........................................................................................................................56\n10\nCopyright © 2025 IEEE. All rights reserved.",
      "source_file": "IEEE Std 1474.1-2025 IEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": false,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 12,
      "text": "IEEE Standard for Communications-\nBased Train Control (CBTC) Performance\nand Functional Requirements\n1. Overview\nThis standard establishes performance and functional requirements for a communications-based train control\n(CBTC) system. It is divided into six clauses. Clause 1 describes the scope and purpose of this standard.\nClause 2 lists references that are useful in applying this standard. Clause 3 provides definitions that are\neither not found in other standards or have been modified for use with this standard. Clause 4 defines the\ngeneral operating requirements for CBTC systems, including train operating modes to be supported. Clause 5\ndefines the performance requirements for CBTC systems, including headway criteria, system safety criteria,\nand system availability criteria. Clause 6 defines the functional requirements for CBTC systems, including\nautomatic train protection (ATP) functions, automatic train operation (ATO) functions, and automatic train\nsupervision (ATS) functions.\n1.1 Scope\nThis standard establishes a set of performance and functional requirements necessary for enhancing\nperformance, availability, operations, and train protection using a CBTC system.\n1.2 Purpose\nThere are currently no independent standards defining the performance and functional requirements to be\nsatisfied by CBTC systems. This standard enhances performance, availability, operations, and train protection,\nand facilitates new CBTC applications.\n1.3 Range of Applications\nThe CBTC performance and functional requirements defined in this standard are intended to be applicable\nto the full range of transit applications, including commuter rail, heavy rail, light rail, and monorail transit\nsystems, and shall be applicable to other transit applications, such as automated people movers (APMs) if\nCBTC is used for automated train control (ATC).\n1.4 Existing Applications\nExisting CBTC installations and projects in progress prior to the publication of this standard need not comply\nwith the new or revised requirements of this standard, IEEE Std 1474.1–20xx, except where specifically\nrequired by the authority having jurisdiction.\n11\nCopyright © 2025 IEEE. All rights reserved.",
      "source_file": "IEEE Std 1474.1-2025 IEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": false,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 13,
      "text": "IEEE Std 1474.1TM-2025\nIEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements\n1.5 Word usage\nThe word shall indicates mandatory requirements strictly to be followed in order to conform to the standard\nand from which no deviation is permitted (shall equals is required to).6,7\nThe word should indicates that among several possibilities one is recommended as particularly suitable,\nwithout mentioning or excluding others; or that a certain course of action is preferred but not necessarily\nrequired (should equals is recommended that).\nThe word may is used to indicate a course of action permissible within the limits of the standard (may equals\nis permitted to).\nThe word can is used for statements of possibility and capability, whether material, physical, or causal (can\nequals is able to).\n2. Normative references\nThe following referenced documents are indispensable for the application of this document (i.e., they must\nbe understood and used, so each referenced document is cited in text and its relationship to this document is\nexplained). For dated references, only the edition cited applies. For undated references, the latest edition of the\nreferenced document (including any amendments or corrigenda) applies.\nIEEE Std 1474.2TM-2025, IEEE Standard for User Interface Requirements in Communications-Based Train\nControl (CBTC) Systems.,8,9\nIEEE Std 1475TM-2012, IEEE Standard for the Functioning of and Interfaces Among Propulsion, Friction\nBrake and Train-borne Master Control on Rail Rapid Transit Vehicles.\nIEEE Std 1477TM-1998, IEEE Standard for Passenger Information System for Rail Transit Vehicles.\nIEEE Std 1478TM-2013, IEEE Standard for Environmental Conditions for Transit Rail Car Electronic\nEquipment.\nIEEE Std 1483TM-2000, IEEE Standard for Verification of Vital Functions in Processor-Based Systems Used\nin Rail Transit Control.\nIEEE Std 1570TM-2002, IEEE Standard for the Interface Between the Rail Subsystem and the Highway Sub-\nsystem at a Highway Rail Intersection.\n6 The use of the word must is deprecated and cannot be used when stating mandatory requirements; must is used only to describe\nunavoidable situations.\n7 The use of will is deprecated and cannot be used when stating mandatory requirements; will is only used in statements of fact.\n8 The IEEE standards or products referred to in this clause are trademarks of The Institute of Electrical and Electronics Engineers, Inc.\n9 IEEE publications are available from The Institute of Electrical and Electronics Engineers, Inc., http://s tandards .ieee. org/ .\n12\nCopyright © 2025 IEEE. All rights reserved.",
      "source_file": "IEEE Std 1474.1-2025 IEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": false,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 14,
      "text": "IEEE Std 1474.1TM-2025\nIEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements\n3. Definitions, acronyms, and abbreviations\n3.1 Definitions\nFor the purposes of this document, the following terms and definitions apply. The IEEE Standards Dictionary\nOnline should be consulted for terms not defined in this clause.10\nauthority having jurisdiction (AHJ): An entity that has the power to make decisions relating to the direct or\ndelegated responsibilities assumed in conjunction with the application of a standard or recommended practice.\nautomated people movers (APMs): A guided transit mode with fully automated operations, featuring\nvehicles that operate on guideways with exclusive right-of-way.\nautomatic train control (ATC): The system for automatically controlling train movement, enforcing\ntrain safety, and directing train operations. ATC includes automatic train protection (ATP) and may include\nautomatic train operation (ATO) and/or automatic train supervision (ATS).\nautomatic train operation (ATO): The subsystem within the automatic train control (ATC) system that\nperforms any or all of the functions of speed regulation, programmed stopping, door control, performance\nlevel regulation, or other functions otherwise assigned to the train operator.\nautomatic train protection (ATP): The subsystem within the automatic train control (ATC) system that\nmaintains fail-safe protection against collisions, excessive speed, and other hazardous conditions through a\ncombination of train detection, train separation, and interlocking.\nautomatic train supervision (ATS): The subsystem within the automatic train control (ATC) system that\nmonitors trains, adjusts the performance of individual trains to maintain schedules, and provides data to adjust\nservice to minimize inconveniences otherwise caused by irregularities.\nNOTE—The ATS subsystem also typically includes manual and automatic routing functions.11\nbasic operating unit: (A) A single vehicle designed for independent operation. (B) A permanent or semi-\npermanent combination, designed for independent operation, consisting of two or more vehicles of one or\nmore types.\nbrake, (maximum) service: A non-emergency brake application that obtains the (maximum) brake rate that is\nconsistent with the design of the brake system, retrievable under the control of master control.\nbrake, emergency: Fail-safe, open-loop braking to a complete stop, with an assured maximum stopping\ndistance considering all relevant factors. Once the brake application is initiated, it is typically irretrievable\n(i.e., it cannot be released until the train has stopped and a predefined time has passed).\ncar: See:v ehicle.\ncivil speed limit: The maximum speed authorized for each section of track, as determined primarily by the\nalignment, profile, and structure.\ncommunications-based train control (CBTC): A continuous ATC system utilizing high-resolution train\nlocation determination, independent of track circuits; continuous, high capacity, bidirectional train-to-\nwayside low-latency data communications; and train-borne and wayside processors capable of implementing\nvital functions.\n10IEEE Standards Dictionary Online is available at: http://d ictionary .ieee. org. An IEEE account is required for access to the dictionary,\nand one can be created at no charge on the dictionary sign-in page.\n11 Notes in text, tables and figures are given for information only and do not contain requirements needed to implement the standard.\n13\nCopyright © 2025 IEEE. All rights reserved.",
      "source_file": "IEEE Std 1474.1-2025 IEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": false,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 15,
      "text": "IEEE Std 1474.1TM-2025\nIEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements\ncommunications-based train control (CBTC) territory: the geographical area(s) of a rail network equipped\nfor CBTC operation.\ncommunications-based train control (CBTC) user: Any authority-authorized personnel who receive\ninformation from, provide information to, or perform repairs or maintenance on, a CBTC system.\ncommunications-based train control (CBTC) user interface: That portion of the human machine interface\nin which the CBTC user interacts with the CBTC system to observe and/or perform functions implemented by\nthe CBTC system. Includes, but is not limited to, displays, audible indicators, tactile entries, cursor positioning\ndevice implementations, and voice input devices.\ncommunications-based train control (CBTC) user profiles: A definition of the vision, hearing, language\nand physical characteristics of the CBTC user.\ncommuter rail: A passenger railroad service that operates within metropolitan areas on trackage that usually\nis part of the general railroad system. The operations, primarily for commuters, are generally run as part of a\nregional system that is publicly owned or by a railroad company as part of its overall service.\nconsist: The makcup or composition (number and specific identity) of a basic operating unit or combination of\nbasic operating units of a train.\ncontrol action: A request by a communications-based train control (CBTC) user for the CBTC system to\nperform an operation. A control action may require a single user input, or a sequence of user inputs, and a\nuser requested control action may be subject to verification checks prior to the CBTC system performing the\nrequested operation.\ncoupling: the function of combining two consists into a new communications-based train control (CBTC)\nfunctional consist.\ndisplay screen: The surface of a display device on which the visual representation of data is presented.\ndriving mode: characterization of the manner in which human train operators interact with the train control\nsystem for operating a train ranging from manual operation without reliance on the train control system to\nfully automatic operation without reliance on human train operators.\ndwell time: The time a transit unit (vehicle or train) spends at a station or stop, measured as the interval\nbetween its stopping and starting.\nfail-safe: A design philosophy applied to safety-critical systems such that the result of hardware failure or the\neffect of software error shall either prohibit the system from assuming or maintaining an unsafe state or shall\ncause the system to assume a state known to be safe.\nfunction key: Assignable special purpose keys (e.g., on a computer keyboard, keypad or touchscreen) which\nthe communications-based train control (CBTC) user employs to interact with the CBTC system.\nheadway: The time interval between the passing of the front ends of successive vehicles or trains moving\nalong the same lane or track in the same direction.\nheavy rail transit: A mode of rail rapid transit generally characterized by fully grade-separated construction,\noperating on exclusive rights-of-way and station platforms at the floor level of the vehicles.\nhuman machine interface: an interface employing audible, visual and/or tactile devices, provide users with\naccess to the CBTC system to receive information and/or to enter commands.\n14\nCopyright © 2025 IEEE. All rights reserved.",
      "source_file": "IEEE Std 1474.1-2025 IEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 16,
      "text": "IEEE Std 1474.1TM-2025\nIEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements\ninterlocking: An arrangement of switch, lock, and signal devices that is located where rail tracks cross, join,\nseparate, and so on. The devices are interconnected in such a way that their movements succeed each other in a\npredefined order, thereby preventing opposing or conflicting train movements.\nlight rail transit: A mode of rail transit characterized by its ability to operate on exclusive rights-of- way,\nstreet running, center reservation running, and grade crossings, and to board and discharge passengers at track\nor vehicle floor level.\nlocation reference: a unique and unambiguous identifier of a geospatial location within a reference location\nsystem.\nmandatory: The referenced item is required to claim compliance with this standard.\nmaster control: The train-borne device or system directly providing the control signals (propulsion, coast,\nand brake) to the train.\nmonorail: a railroad in which the track consists of a single rail, typically elevated, with the trains suspended\nfrom it or balancing on it.\nmovement authority: The permission for a train to enter and travel through a specific section of track, in a\ngiven travel direction. Movement authorities are assigned, supervised, and enforced by a CBTC system to\nmaintain safe train separation and to provide protection of the train as it travels along the track.\nmovement authority limit: The boundaries within which the movement authority is permitted.\noptional: The referenced item is not required to claim compliance with this standard. Implementation of an\noptional item shall be as defined in this standard.\npage: A visual representation of data, graphics or text, that is presented on a display screen.\nredundancy: The existence in a system of more than one means of accomplishing a given function.\nreliability: The probability that a system will perform its intended functions without failure, within design\nparameters, under specific operating conditions, and for a specific period of time.\nsafe braking model: An analytical representation of a train’s performance while decelerating to a complete\nstop, allowing for a combination of worst-case influencing factors and failure scenarios. A CBTC-cquipped\ntrain shall stop in a distance equal to or less than that guaranteed by the safe braking model.\nsafety critical: (A) A term applied to a system or function, the correct performance of which is critical to\nsafety of personnel and/or equipment. (B) A term applied to a system or function, the incorrect performance of\nwhich may result in a hazard.\nNOTE—-Vital functions are a subset of safety-critical functions.\nsafety-related: Carries responsibility for safety.\nself-revealing failure: Failures whose effects on system operation are immediately and clearly apparent.\nservice, revenue: (A) Transit service excluding deadheading or layovers. (B) Any service scheduled for\npassenger trips.\nsystem safety: The application of engineering and management principles, criteria, and techniques to optimize\nall aspects of safety within the constraints of operational effectiveness, time, and cost, throughout all phases of\nthe system life cycle.\n15\nCopyright © 2025 IEEE. All rights reserved.",
      "source_file": "IEEE Std 1474.1-2025 IEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 17,
      "text": "IEEE Std 1474.1TM-2025\nIEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements\nsystem safety program: The combined tasks and activities of system safety management and system safety\nengineering that enhance operational effectiveness by satisfying the system safety requirements in a timely,\ncost-effective manner throughout the system life cycle.\ntrain: A consist of one or more basic operating units.\ntraffic locking: Electric locking which prevents the manipulation of levers or other devices for changing the\ndirection of traffic into a section of track on which a route 1s lined, occupied, or locked.\nun-coupling: the function of splitting a consist into two new and separate CBTC functional consists.\nunit: See:basic operating unit.\nvehicle: A land conveyance assembly for carrying or transporting people and objects capable of traversing a\nguideway, having structural integrity and general mechanical completeness, but not necessarily designed for\nindependent operation.\nvital function: A function in a safety-critical system that is required to be implemented in a fail-safe manner.\nwindow: I[n graphical user interfaces, a defined portion of the display screen that is separated by a frame from\nthe rest of the screen and which may be opened, closed, resized and moved by the user.\n3.2 Acronyms and abbreviations\nAPM automated people mover\nATC automatic train control\nATO automatic train operation\nATP automatic train protection\nATS automatic train supervision\nCBTC communications-based train control\nGEBR guaranteed emergency brake rate\nMTBF mean time between failure\nMTBFF mean time between functional failure\nMTBHE mean time between hazardous event\nMTTR mean time to repair\nMTTRS mean time to restore service\nO&SHA operating and support hazard analysis\nPHA preliminary hazard analysis\nSHA system hazard analysis\nSSHA subsystem hazard analysis\nSSPP System Safety Program Plan\n16\nCopyright © 2025 IEEE. All rights reserved.",
      "source_file": "IEEE Std 1474.1-2025 IEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 18,
      "text": "IEEE Std 1474.1TM-2025\nIEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements\n\n4. General requirements\n4.1 Characteristics of CBTC systems\nThe primary characteristics of a CBTC system include the following:\n\na) High-resolution train location determination, independent of track circuits\n\nb) Continuous, high capacity, bidirectional train-to-wayside low-latency data communications\n\nc) Train-borne and wayside processors performing vital functions\n4.2 Categorization of CBTC systems\nThis standard recognizes that different configurations of CBTC systems are possible, depending on the\nspecific application. For example, a CBTC system may provide the following:\n\na) Automatic train protection (ATP) functions only, with no automatic train operation (ATO) or automatic\n\ntrain supervision (ATS) functions\nb) ATP functions, as well as certain ATO and/or ATS functions, as required to satisfy the operational\nneeds of the specific application\n\nA typical functional block diagram for a CBTC system is given in Annex B.\n4.3 Train Configurations\nA CBTC system shall be capable of supporting a variety of train configurations, including the following:\n\na) Fixed-length unidirectional trains comprised of one or more basic operating units\n\nb) “Fixed-length bidirectional trains comprised of one or more basic operating units\n\nc) Variable-length unidirectional trains\n\nd) Variable-length bidirectional trains\nA CBTC system shall be capable of supporting a mixed fleet of trains, where specific trains, and/or classes of\ntrains, have different performance characteristics.\n4.4 Train operating modes\nCBTC-equipped trains may be operated by either a single person or a multi-person crew. ACBTC system may\nalso be required to support operation of trains without crews.\nFor operation of trains with crews, the train operator will typically be stationed in the lead car of the train and\nwill be responsible for moving the train from station to station. With a multi-person crew, the conductor(s) will\nnormally operate from conductor position(s) within the train to operate the train’s doors. ACBTC system shall\nsupport single-person train operation by combining the conductor and train operator display information on\nthe train operator’s display. For multi-person crews, conductor display information shall also be provided on\nseparate conductor displays.\nFor the purposes of this standard, operation of trains without crews includes both unattended and driverless\ntrain operations. With unattended train operations, there would normally be no crew member onboard the\ntrain. With driverless train operations, there may be a crew member onboard the train, but normally not in the\ndriving cab. This crew member, if present, would normally have no responsibility for operation of the train\nexcept for failure recovery.\n\n17\nCopyright © 2025 IEEE. All rights reserved.",
      "source_file": "IEEE Std 1474.1-2025 IEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 19,
      "text": "IEEE Std 1474.1TM-2025\nIEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements\n\nCBTC-equipped trains (including CBTC-equipped maintenance vehicles) shall be capable of operating in\nvarious modes, depending on whether the train is operating in CBTC territory or non-CBTC territory, and\ndepending on the operational status of the train-borne and/or wayside CBTC equipment.\nMixed-mode operation shall also be considered a normal operating mode, to the extent specified by the\nauthority having jurisdiction. Mixed-mode operation is defined as the simultaneous operation within CBTC\nterritory of CBTC-equipped trains and trains that are not equipped with functional train-borne CBTC\nequipment (including maintenance vehicles). Mixed-mode operation may be used in one or more of the\nfollowing ways:\n\na) Aregularly scheduled mode of operation within CBTC territory\n\nb) An infrequent, unscheduled mode of operation within CBTC territory\n\nc) During the transition period only, as anew CBTC system is cut-in\n\nd) Asaresult of train-borne CBTC equipment failures\n4.4.1 Normal train operating modes in CBTC territory\n4.4.1.1 CBTC-equipped trains\nCBTC-equipped trains operating in CBTC territory shall operate, within ATP limits, under the protection of\nthe CBTC system. The train shall be capable of being controlled manually by a train operator or automatically\nby the CBTC system (supervised by the train operator, if present), as specified by the authority having\njurisdiction. When operating automatically, some functions (such as door operation and train departure\ninitiation) may continue to be the responsibility of the train operator and/or conductor(s), if present.\n4.4.1.2 Non-CBTC-equipped trains\nTrains not equipped with train-borne CBTC equipment and/or trains with inoperative train-borne CBTC\nequipment that are operating in CBTC territory shall operate under the protection of the CBTC system using\nsecondary train detection, or a supplementary systems and/or operating procedures, as specified by the\nauthority having jurisdiction.\n4.4.2 Failure mode train operations in CBTC territory\nFor light rail, heavy rail, monorail and commuter rail applications operating with crews, it is an operational\nrequirement to continue to move trains safely in the event of CBTC equipment and/or data communication\nfailures, possibly at reduced operating speeds and/or increased operating headways when compared to normal\ntrain operations. Consequently, a CBTC system shall be designed to support degraded modes of operation\nin the event of failure and to continue to provide ATP with minimum reliance on adherence to operating\nprocedures as specified by authority having jurisdiction.\nFor fully automated applications operating without crews, the extent to which the CBTC system shall be\ndesigned to support degraded modes of operation in the event of failure shall be as defined by the authority\nhaving jurisdiction, and may include an ability to remotely reset train-borne equipment and the ability to\nsupport automatic push/pull train recovery, as well as the ability to support manual train operations and\nalternative routing strategies.\nFor all applications, a fallback plan, based on failure analysis and operating procedures, shall identify train\noperating modes that will take advantage of the degraded modes of operation and recovery capabilities of the\nCBTC system. The goal of the plan shall be to eliminate hazards to passengers and staff in accordance with\n5.3, while continuing to provide passenger service.\n\n18\nCopyright © 2025 IEEE. All rights reserved.",
      "source_file": "IEEE Std 1474.1-2025 IEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 20,
      "text": "IEEE Std 1474.1TM-2025\nIEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements\n\nSpecifically, failure mode train operations in CBTC territory shall address those CBTC system failures\naffecting the following:\n\na) All trains operating within a particular area of control\n\nb) Aparticular train operating within any area of control\n4.4.2.1 CBTC system failures affecting all trains operating within a particular area of control\nIn the event of a CBTC system failure that affects all CBTC-equipped trains operating within a particular area\nof control within CBTC territory (e.g., wayside CBTC equipment or wayside-to-train data communications\nfailure), trains shall have the capability to provide continued safe operations under the control of an operator,\nand the following:\n\na) With the protection of a supplementary system (if specified by the authority having jurisdiction); or\n\nb) With the train speed limited by the propulsion system; or\n\nc) Through strict adherence to operating procedures (as defined by authority having jurisdiction); or\n\nd) Acombination of any or all of items a), b), and c).\nWhen operating in this failure mode, ATP functions that reside within individual train-borne CBTC equipment\nshall continue to function to the extent safety can be assured.\n4.4.2.2 CBTC system failures affecting a particular train operating within any area of control\nIn the event of a CBTC system failure affecting a particular CBTC-equipped train operating within any area\nof control within CBTC territory (e.g., train-borne CBTC equipment failure), that train shall be capable of\ncontinued safe operations under the control of an operator, and the following:\n\na) With the protection of a supplementary system (if specified by the authority having jurisdiction); or\n\nb) With the train speed limited by the propulsion system; or\n\nc) Through strict adherence to operating procedures; or\n\nd) Acombination of any or all of items a), b), and c).\nWhen operating in this failure mode, ATP functions that reside within wayside CBTC equipment and within\nother train-borne CBTC equipment shall continue to function to the extent safety can be assured.\n4.4.3 Normal train operating modes in non-CBTC territory\nCBTC equipment installed on trains operating in non-CBTC territory shall include the necessary capabilities\nto support transitions into CBTC territory. In addition, if specified by the authority having jurisdiction, train\nborne CBTC equipment may also perform other ATP functions while operating in non-CBTC territory, such as\nlimiting train speed and/or providing zero speed detection.\nIf specified by the authority having jurisdiction, train-borne CBTC equipment operating in non-CBTC territory\nmay also interface with wayside equipment that is not fully compatible with the train-borne CBTC equipment.\nIn no case, however, shall the train-borne CBTC equipment provide an indication of standard CBTC operation\nwhen operating in non-CBTC territory, unless the applicable authority or authorities having jurisdiction\nover the train-borne and wayside equipment have ensured that standard CBTC operation is supported by the\nintegrated train-borne and wayside systems.\n\n19\nCopyright © 2025 IEEE. All rights reserved.",
      "source_file": "IEEE Std 1474.1-2025 IEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 21,
      "text": "IEEE Std 1474.1TM-2025\nIEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements\n\n4.4.4 Failure mode train operations in non-CBTC territory\nExcept where specified to perform certain ATP functions while operating in non-CBTC territory, failure of the\ntrain-borne CBTC equipment shall have minimal impact on train operation. The failure shall be indicated to\nthe train operator, if present.\n4.5 Entering/exiting CBTC territory\n4.5.1 Entering into CBTC territory\nA CBTC system shall have precise knowledge of the limits of CBTC territory and shall include the capability\nto perform verification checks of the train-borne CBTC equipment prior to entering CBTC territory. The\nchecks shall be performed sufficiently in advance of entry into CBTC territory to verify the proper operation\nof the train-borne CBTC equipment (including any wayside CBTC equipment dependencies).\nIf the verification check is passed, an indication to this effect shall be provided. Under normal circumstances\nand subject to ATP constraints, it shall not be necessary for a train to come to a stop when entering CBTC\nterritory unless required for other operational reasons.\nIn the event that the verification check fails, an indication of the CBTC system failure shall be provided, and\nthe train shall be capable of continued safe operations under the control of an operator, and\n\na) With the protection of a supplementary system (if specified by the authority having jurisdiction); or\n\nb) With the train speed limited by the propulsion system; or\n\nc) Through strict adherence to operating procedures (as defined by authority having jurisdiction); or\n\nd) Acombination of any or all of items a), b), and c).\nThe results of the verification checks shall be displayed on the ATS user interface. For trains operating with\ncrews, the results of the verification checks shall also be indicated to the train operator.\n4.5.2 Exiting from CBTC territory\nFor trains operating with crews, prior to exiting CBTC territory, a CBTC system may provide a visual\nindication to the train operator of time and/or distance until the train will be exiting the CBTC territory. When\nknown by the CBTC system, the train operator may also receive an indication of the type of train control\nsystem into which the train will be traversing.\nNOTE—Indications to the train operator may not be required if the transition between CBTC territory and non-CBTC\nterritory is operationally transparent to the train operator. Under normal circumstances and subject to ATP constraints, it\nis not necessary for a train to come to a stop when exiting CBTC territory unless required for other operational reasons.\n4.6 Train operating speeds\nA CBTC system shall be capable of meeting the performance and functional requirements of this standard,\nover the full range of possible train operating speeds specified by the authority having jurisdiction.\n\n20\nCopyright © 2025 IEEE. All rights reserved.",
      "source_file": "IEEE Std 1474.1-2025 IEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 22,
      "text": "IEEE Std 1474.1TM-2025\n\nIEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements\n5. Performance requirements\n5.1 CBTC factors contributing to achievable headways\nThe required design and operating headways (le., the minimum and scheduled headways) for both normal\nand reverse directions shall be specified by the authority having jurisdiction. Headway may be specified as\nuninterfered and/or interfered.\nIn all cases, the design headway shall be constrained by the safe train separation requirements and the safe\nbraking model of 6.1.2.1.\nIn the case of an uninterfered headway, a train speed profile shall not be affected by a preceding train. All\ntrains shall, therefore, perform at the maximum allowed speed, depending on the civil speed limits and the\nacceleration and braking capabilities of the trains themselves. Operation at uninterfered headways facilitates a\nminimum end-to-end trip time for a given set of station dwell times.\nHeadways may be reduced (at the expense of increased trip times) with an interfered headway where a train\nspeed profile is affected by a preceding train such that a following train decelerates on the approach to a station\nand enters the station area at a reduced speed. Interfered headway may also be specified to support multiple\nberthings at a station platform.\nThe design headway for a particular line and a particular set of vehicles involves many factors that are out-\nside the control of the CBTC system (e.g., track alignment, gradients, civil speed limits, train acceleration and\nbraking rates, station dwell times, terminal track configurations, driver reaction times). These factors shall be\nspecified by the authority having jurisdiction. These standard addresses only those CBTC factors contributing\nto achievable headways, of which the most significant are the following:\n\na) Location (both accuracy of measured end-of-train locations and resolution of movement authority\nlimits for a given train), including the frequency at which location reports and movement authorities\nare updated.\n\nb) Speed, including both accuracy of speed measurement and resolution of speed limits established for a\ngiven train at a given location.\n\nc) Communications delays, including nominal and worst-case transmission times of command/status\nmessages between wayside and train, and vice versa. (Command/status messages include, for\nexample, messages related to movement authority updates and/or location report updates.)\n\nd) CBTC equipment reaction times, including maximum error accumulation, for both wayside and train-\nborne equipment, and for various operating modes, as applicable. (CBTC equipment reaction times\ninclude, for example, the time required to establish new movement authority limits following location\nreport updates, the time to establish new movement authority limits through an interlocking, and the\ntime to determine a new ATP profile following movement authority update.)\n\ne) CBTC system performance limitations (e.g., the maximum number of trains that can be processed by\nthe CBTC system, within a given area of control).\n\nf) CBTC automatic speed regulation algorithm.\n\nTypical values for the CBTC parameters in items a) through e) are given in Annex C.\n5.2 CBTC factors contributing to achievable trip times\nTrip time requirements shall be specified by the authority having jurisdiction, consistent with train performance\nand track alignment characteristics.\n21\nCopyright © 2025 IEEE. All rights reserved.",
      "source_file": "IEEE Std 1474.1-2025 IEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 23,
      "text": "IEEE Std 1474.1TM-2025\nIEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements\nThe minimum end-to-end trip times for a defined sct of station dwell times results from uninterfered headway\nspeed profiles. The CBTC factors contributing to achievable headways, as identified in 5.1, are also factors\ncontributing to the minimum achievable trip times.\n5.3 System safety requirements\n5.3.1 CBTC System Safety Program requirements\nA System Safety Program shall be instituted during the CBTC system planning/design phase and shall\ncontinue throughout the system life cycle. The CBTC System Safety Program shall emphasize the prevention\nof accidents by identifying and resolving hazards in a systematic manner. A CBTC System Safety Program\nPlan (SSPP) shall be developed for each CBTC application. The CBTC SSPP, as a minimum, shall be prepared\nin accordance with the requirements of E.1 of Annex E.\nImplementation of the CBTC SSPP shall specifically recognize configuration management issues, given the\nimportance of software and hardware configuration control in maintaining system safety.\n5.3.2 CBTC hazard identification and risk assessment process\nHazard analyses shall be employed during the design of a CBTC system to assist in the identification and\nevaluation of potential hazards to assess their likelihood and severity and to document their resolution. As a\nminimum, a preliminary hazard analysis (PHA) shall be conducted for each new CBTC system project. Other\ndetailed analyses, including system/subsystem hazard analyses, failure modes, effects and criticality analyses,\nfault tree analyses, and operational and support hazard analyses, shall also be conducted if man- dated by\nthe CBTC SSPP. These analyses shall be conducted in accordance with E.2, E.3, E.4, and E.5 of Annex E or\nequivalent requirements, as approved by the authority having jurisdiction.\nAll hazards identified through the CBTC System Safety Program shall be assessed in terms of the severity or\nconsequence of the hazard and the probability of occurrence. This shall be accomplished in general accordance\nwith the criteria outlined in E.6 of Annex E or the equivalent, as approved by the authority having jurisdiction.\nRisk assessment estimates shall be used as the basis in the decision-making process to determine whether\nindividual system or subsystem hazards shall be eliminated, mitigated, or accepted. This process shall include\nfull documentation of the hazard resolution activities.\nHazards shall be resolved through a design process that emphasizes the elimination of the hazard. The\neffectiveness of the hazard resolution strategies and countermeasures shall be monitored to determine that no\nnew hazards are introduced. In addition, whenever substantive changes are made to the system, analyses shall\nbe conducted to identify and resolve any new hazards.\nAs a minimum, a CBTC system shall address the following critical/catastrophic system hazards through the\nimplementation of the ATP functions defined in 6.1:\na) Train-to-train collisions (rear-end, sideswipe, head-on); hazard to be addressed through train\nseparation assurance (see 6.1.2), rollback protection (see 6.1.4), parted train protection (see 6.1.6),\nroute interlocking protection (see 6.1.11), and travel direction reversal interlocks (see 6.1.12)\nb) _ Train-to-structure collisions; hazard to be addressed through end-of-track protection (see 6.1.5) and\nrestricted route protection (see 6.1.16)\nc) Train derailments; hazard to be addressed through overspeed protection (see 6.1.3), route interlocking\nprotection (see 6.1.11), and (where specified by the authority having jurisdiction) broken rail detection\n(see 6.1.14)\n22\nCopyright © 2025 IEEE. All rights reserved.",
      "source_file": "IEEE Std 1474.1-2025 IEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 24,
      "text": "IEEE Std 1474.1TM-2025\nIEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements\n\nd) Collisions between trains and highway vehicles (where highway crossing at grade exists within the\nlimits of CBTC territory); hazard to be addressed through grade-crossing warning devices that may\ninclude interfaces to the CBTC system (see 6.1.15)\n\ne) Hazards to work crews and work trains; hazards to be addressed through CBTC work zone protection\nfunctions (see 6.1.13)\n\nf) | Hazards to passengers associated with train movement with train doors open; hazards to be addressed\nthrough interface between the CBTC system and the train door system (where required by the authority\nhaving jurisdiction) to provide door opening control protection interlocks (see 6.1.8), zero speed\ndetection (see 6.1.7), platform interlocks (see 6.1.9) and where applicable, hazards to passengers\nassociated with train movement with platform edge doors open.\n\ng) Hazards associated with collisions with objects on the track; hazards to be addressed through interfaces\nbetween the CBTC system and restricted route protections (where specified by the authority having\njurisdiction) (see 6.1.16)\n\n5.3.3 CBTC vital functions\nTo eliminate or control to a level acceptable to the authority having jurisdiction those hazards judged to be\nunacceptable or undesirable through the risk assessment process of 5.3.2, a CBTC system shall include, as a\nminimum, the vital functions identified in 6.1.\nAll vital functions of a CBTC system shall be designed and implemented in accordance with fail-safe\nprinciples. Documentation of the means used, and proof that fail-safe principles have been met and the mean\ntime between hazardous event (MTBHE) requirements of 5.3.4 have been satisfied, shall be required for every\nCBTC system.\nVerification that the processor-based portions of a CBTC system meet these minimum system safety\nrequirements shall be completed in accordance with IEEE Std 1483-2000.\"\n5.3.4 Quantitative CBTC safety performance requirements\nFor any CBTC system application, the CBTC wayside and train-borne equipment located within any\ncontiguous portion of a one-way route that can be traversed by a train traveling at the specified maximum\nauthorized speed for one hour or less shall have a total calculated aggregate MTBHE (total of all critical and\ncatastrophic hazards) of at least 10° operating hours. This includes the maximum number of other trains that\ncan be located in this contiguous portion of a one-way route under the specified peak operating headway.\nSystem safety documentation shall support these calculations and substantiate the methodology used to arrive\nat the result. For the purposes of MTBHE calculations, a hazardous event shall include, as a minimum, the\noccurrence of any of the specific hazards identified in 5.3.2.\nNOTE—If the end-to-end trip time for a given route is greater than 1 h, the MTBHE requirement for that route would be\nadjusted proportionately. As an illustrative example, if the specified end-to-end trip time (per 5.2) for a given one-way\nroute is 2 h, and if the route includes 4 sets of wayside CBTC equipment, and if a maximum of 10 trains can be operating\non the route at a given time (when operating at the specified peak headway, per 5.1), then the MTBHE of the combined\n4 sets of wayside CBTC equipment and 10 sets of train-borne CBTC equipment on that route would be at least 0.5 x 10°\noperating hours.\n2 Information on references can be found in Clause 2.\n23\nCopyright © 2025 IEEE. All rights reserved.",
      "source_file": "IEEE Std 1474.1-2025 IEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 25,
      "text": "IEEE Std 1474.1TM-2025\n\nIEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements\n5.3.5 Basic safety design principles\n5.3.5.1 Normal transit system operations with no CBTC hardware failures\nA CBTC system shall respond safely and correctly perform all ATP functions within the normal range of\ninputs and other operating and environmental conditions.\nAll conditions necessary for the existence of any permissive state or action shall be verified to be present\nbefore the permissive state or action is initiated by a CBTC system. The requisite conditions shall be verified\nto be continuously present for the permissive state or action to be maintained.\nSystem safety shall not depend on the correctness of actions taken or procedures used by operating personnel.\nProcedures shall not be considered a substitute for safety functions that are to be vested in specific CBTC\ncomponents or equipment, or secondary train detection systems.\n5.3.5.2 Abnormal transit system operations with no CBTC hardware failures\nACBTC system shall respond safely under conditions of abnormal system loading, abnormal/improper inputs,\nand other abnormal external influences such as electrical, mechanical, and environmental factors.\nACBTC system shall respond safely to abnormal conditions as required by the authority having jurisdiction.\n5.3.5.3 Response to CBTC hardware failures\nACBTC system shall respond safely under conditions of credible hardware failure.\nNOTE—The AREMA Communications and Signals Manual, Part 17.3.3 [B1]'*, provides examples of credible hardware\nfailures.\nFailure to perform a logical operation or absence of a logical input, output, or decision shall not cause an\nunsafe condition, i.e., system safety shall not depend upon the occurrence of an action or logical decision.\nHazard analyses shall consider all credible CBTC hardware failure modes. Justification shall be provided\nfor conceivable failure modes that are not considered credible. Each credible CBTC failure mode shall be\nclassified as a combination of either self-revealing or non-self-revealing, and the effect shall be considered as\nfollows:\n\na) Nocredible single point CBTC hardware failure, whether self-revealing or non-self-revealing, shall\ncause an unsafe condition.\n\nb) Nocredible CBTC hardware failure in combination with one or more non-self-revealing failure shall\ncause an unsafe condition. In the instance of a non-self-revealing failure, a subsequent failure shall not\nbe considered independent.\n\nc) The probability of a critical or catastrophic hazard arising as a result of combinations of simultaneous\nindependent self-revealing failures shall be considered in the calculated CBTC MTBHE.\n\n5.3.5.4 Recovery from CBTC hardware failures\nA combination of functional elements of the CBTC system itself, supplementary systems (if specified by the\nauthority having jurisdiction), and/or operating procedures shall provide for the safety of train movement\nunder failure conditions, including failure recovery.\n'3 The numbers in brackets correspond to those of the bibliography in Annex A.\n24\nCopyright © 2025 IEEE. All rights reserved.",
      "source_file": "IEEE Std 1474.1-2025 IEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 26,
      "text": "IEEE Std 1474.1TM-2025\n\nIEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements\n5.4 System assurance requirements\n5.4.1 General\nThe ability of a CBTC system to accomplish the functional requirements of this standard, under normal\nconditions and under conditions of equipment failure, is of paramount importance to the authority having\nJurisdiction. This sub clause establishes qualitative reliability, availability, and maintainability criteria for\nCBTC systems and equipment in order to meet or exceed the on-time performance and fleet availability\nobjectives of the authority having jurisdiction, and thereby minimize delays experienced by passengers. In\naddressing CBTC equipment failures, a distinction shall be made between the following failure types:\n\na) Type 1: Those failures, or combination of failures, that impact on-time performance of the transit\nsystem.\n\nb) Type 2: Those failures, or combination of failures, that do not impact on-time performance of the\ntransit system, but do result in some other loss of specified CBTC functionality.\n\nc) Type 3: Those failures that do not impact on-time performance of the transit system or result in a loss\nof any specified CBTC functionality (e.g., because of equipment redundancy).\n\nThe CBTC system availability requirement (see 5.4.2) shall include consideration of all Type 1 failures, as\nwell as the mean time to restore service (MTTRS) for Type 1 failures.\n\nThe CBTC system mean time between functional failure (MTBFF) requirement (see 5.4.3) shall include\nconsideration of all Type 1 and Type 2 failures.\n\nThe CBTC system mean time between failure (MTBF) requirement (see 5.4.3) shall include consideration of\nall Type 1, Type 2, and Type 3 failures.\n\nWhile system availability, system MTBFF, and system MTBF predictions traditionally consider only hard-\nware failures, measurements of achieved system availability, system MTBFF, and system MTBF shall also\nconsider software errors (i.e., software fails to perform intended function) as well as hardware failures.\n\nThe following general recommended practices apply:\n\n— Components and materials should be selected and appropriate standards of quality control and test\nprocedures should be employed to obtain the lowest practical hardware failure rates for individual\nitems of CBTC equipment (i.e., maximize the hardware portion of the system MTBF).\n\n— Unless non-redundant equipment is sufficiently reliable to satisfy the overall system availability\nrequirements, appropriate levels of equipment redundancy should be employed such that the failure\nof a single component, processor, or device does not render the CBTC system unavailable or an\noperationally-critical function nonoperative (le., maximize the system MTBFF).\n\n一 ACBTC system should incorporate degraded modes of operation to minimize the operational impacts\nof equipment failures and to permit train movements to continue safely (i.e., maximize system\navailability).\n\n— CBTC system downtime or unavailability of an operationally-critical function should be minimized\nthrough the use of local and remote diagnostic capabilities and appropriate operating and maintenance\nprocedures [le., minimize mean time to repair (MTTR)].\n\n25\nCopyright © 2025 IEEE. All rights reserved.",
      "source_file": "IEEE Std 1474.1-2025 IEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 27,
      "text": "IEEE Std 1474.1TM-2025\nIEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements\n5.4.2 System availability requirements\nQuantitative CBTC system availability requirements shall be established by the authority having jurisdiction\nwith appropriate consideration of the impacts of CBTC system and subsystem failures on the operation of the\ntransit system. Typical methods for defining CBTC system availability are provided in Annex F.\nAs specified by the authority having jurisdiction, system availability analysis/modeling shall be used to predict\nthe system availability for a given CBTC system configuration, based on equipment reliability/ maintainability\ncalculations, equipment redundancy provisions, and other defined assumptions.\nAs specified by the authority having jurisdiction, system availability demonstration tests shall be performed to\ndetermine actual CBTC system availability over a defined period, to a given confidence level.\n5.4.3 Equipment reliability requirements\nQuantitative CBTC system and subsystem MTBF and MTBFF requirements shall be established by the\nauthority having jurisdiction, consistent with the CBTC system availability requirement of 5.4.2.\n5.4.3.1 Design life\nCBTC system shall have a design life of a minimum 30 years.\nNOTE—The ability of a CBTC system to remain in operation to the end of its design life is driven largely by long-term\navailability of spare parts and the state of good repair and maintenance plans. Specific requirements with respect to spare\npart availability are defined by the authority having jurisdiction and do not form part of this standard.\n5.4.4 Equipment maintainability requirements\nA CBTC system shall be designed to minimize required maintenance (predictive, preventive, and corrective)\nby maximizing the system MTBF and by including features that provide for ease of maintenance by\nmaintenance personnel.\nThe mean time to repair/replace a failed piece of in-service CBTC equipment (i.e., first-level repair) shall\ninclude on-site diagnostics, the replacement of failed components, and the testing of the repaired units, sub-\nsystem, or system, but shall exclude travel time to the site. A separate MTTR requirement may be defined for\nsecond-level repair (i.e., shop repair of a failed line replaceable unit).\nThe first-level MTTR shall be no greater than 30 min. The second-level MTTR, if specified, shall be no greater\nthan 2 h.\nAchievable repair times is driven by equipment diagnostic provisions and available test equipment, as well as\nthe quality of the maintenance manuals and training. A CBTC system shall, therefore, include maintenance and\ndiagnostic capabilities to detect and react to CBTC equipment failures. This shall include remote diagnostics\ncapabilities as well as local built-in test equipment and other fault displays for trouble- shooting, and the\ntimely identification of failed components and functions.\nData logging capabilities shall also be provided in wayside and train-borne CBTC equipment. The logged data\nshall be capable of being analyzed to be able to recreate the sequence of events leading to an incident. This\nallows maintenance personnel to identify the cause of any failure and/or mis-operation of CBTC equipment\nthat cannot be identified by the in-built diagnostics of the equipment. The scope and duration of logged CBTC\nevents shall be established by the authority having jurisdiction.\nA CBTC system design shall include capabilities to permit periodic verification of ATP hardware, software,\nand data, including verification of correct response to interference on the train-to-wayside data link. To the\nextent specified by the authority having jurisdiction, a CBTC system shall also include capabilities to facilitate\n26\nCopyright © 2025 IEEE. All rights reserved.",
      "source_file": "IEEE Std 1474.1-2025 IEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": false,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 28,
      "text": "IEEE Std 1474.1TM-2025\nIEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements\nmodifications (by the user) to CBTC system parameters, track databases, and applications software. The\nsupplier of the CBTC system shall identify to the authority having jurisdiction those specific changes to CBTC\nsystem parameters, track databases, and applications software that have no impact on system safety.\nWARNING\n\nChanges made to CBTC system parameters, track databases, and application software, other than those\n\nidentified by the supplier as not impacting safety, can affect safe system operation. Prior to implementing\n\nany such changes, applicable hazard analyses of 5.3.2 shall be reassessed to verify that the modified system\n\nwill still meet all requirements of this standard including, but not limited to, 5.3.3, 5.3.4, and 5.3.5. Changes\n\nshall be implemented in accordance with the CBTC SSPP of 5.3.1.\n5.5 Environmental requirements\nTrain-borne CBTC equipment shall comply with the requirements of IEEE Std 1478-2013.\nWayside CBTC equipment shall be in accordance with requirements set by authority having jurisdiction.\n6. Functional requirements\nA CBTC system shall include the capability for providing ATP, ATO, and ATS functions. ATP functions shall\nprovide fail-safe protection against collisions, excessive speed, and other hazardous conditions. ATP functions\nshall have precedence over both the ATO and ATS functions. ATO functions shall control basic operations that\nwould otherwise be performed by a train operator and shall do so within the protection limits imposed by ATP.\nATS functions shall provide system status information and the means to monitor and over- ride the automatic\ncontrol for various functions of the system.\nThe CBTC train-to-wayside communications interface shall be sufficient to support all required ATP, ATO,\nand ATS functions. The data link shall provide continuous geographic coverage within CBTC territory and\nshall support train operations in tunnels, tubes, and cuts, on elevated structures, and at grade. The data link\nshall support bidirectional data transfer and shall exhibit sufficiently low latency to support the defined\nperformance requirements. The data link shall include a protocol structure to support safe, timely, and secure\ndelivery of train control messages.\n6.1 ATP functions\nAll ATP functions shall be vital functions and shall be designed and implemented in accordance with 5.3. A\nCBTC system shall be capable of providing bidirectional ATP.\n6.1.1 Train location/train speed determination\n6.1.1.1 CBTC train location/train speed determination\nCBTC train location/train speed determination shall be a required ATP function for any CBTC system\nconfiguration.\nACBTC system shall establish the location, speed, and travel direction of each CBTC-equipped train operating\nin CBTC territory.\nCBTC train location determination shall safely and accurately establish the location of both the front and rear\nof the train. The CBTC train location determination function shall provide sufficient train location resolution\nand accuracy to support the performance and safety requirements of this standard. Train location resolution\nand accuracy parameters for typical CBTC systems are included in Annex C.\n\n27\nCopyright © 2025 IEEE. All rights reserved.",
      "source_file": "IEEE Std 1474.1-2025 IEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 29,
      "text": "IEEE Std 1474.1TM-2025\n\nIEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements\nThe CBTC train location determination function shall be self-initializing and shall automatically detect and\nestablish the location and length of each CBTC-equipped train as it enters CBTC territory and on recovery\nfrom CBTC equipment failures, without requiring manual input of train location or train length data.\nWhen awakening from sleep mode, CBTC equipment shall maintain or vitally re-establish train location.\nThe CBTC train speed determination function shall provide sufficient speed measurement resolution and\naccuracy to support the performance and safety requirements of this standard. Speed measurement resolution\nand accuracy parameters for typical CBTC systems are included in Annex C.\nA CBTC system shall compensate for the effects of measurement inaccuracies on train location and speed\ndetermination. Specifically, ifthe CBTC train location/speed determination function is dependent upon wheel\nrotation, the CBTC system shall correct for position errors induced by the slipping or sliding of wheels and\nshall correct for position errors caused by variation in wheel size due to wear, trueing, or replacement.\n6.1.1.2 Secondary train location determination\nIf specified by the authority having jurisdiction, secondary train detection technology may be used to establish\nif a section of track is occupied by one or more trains, including trains not equipped with train-borne CBTC\nequipment and/or trains with inoperative train-borne CBTC equipment. This may be provided as part of\nsupplementary systems or directly input or integrated into the CBTC system. It will not be necessary to\ndetermine the location of non-CBTC-equipped trains, or trains with inoperative train-borne CBTC equipment,\nto the same accuracy as CBTC-equipped trains.\n6.1.2 Safe train separation\nSafe train separation shall be a required ATP function for any CBTC system configuration.\nSafe train separation shall be provided between all trains operating in CBTC territory, whether or not the trains\nare CBTC equipped.\nACBTC system shall provide safe train separation between CBTC-equipped trains. Safe train separation shall\nbe based upon the principle of an instantaneous (brick wall) stop of the preceding train.\nFor mixed-mode operation (see 4.4), safe train separation shall be provided through supplementary systems\nand/or through strict adherence to opcrating procedures, as specified by the authority having jurisdiction.\nIf secondary train location determination is provided (see 6.1.1.2), then for a CBTC-equipped train following\na non-CBTC-equipped train or a train with inoperative train-borne CBTC equipment, a CBTC system shall\nlimit the movement authority of the following train to the boundary of the section of track occupied by the\nnon-CBTC-equipped or failed train. If specified by the authority having jurisdiction, the CBTC system may\nfurther limit the movement authority to the route entry point of a route occupied by the non-CBTC-equipped\ntrain or failed train.\nThe CBTC safe train separation function shall consist of the following:\n\na) Thecalculation of the ATP profile (1.c., the profile of safe speed as a function of train location), derived\nfrom fixed ATP data (e.g., permanent speed limits) and variable ATP data (e.g., temporary speed limits\nand movement authority limit)\n\nb) The supervision and enforcement of the ATP profile calculated by the CBTC system\n\nThe ATP profile shall be governed by a safe braking model (see 6.1.2.1) and shall ensure that under no\ncircumstances (including failures) will the movement authority limit be exceeded by a CBTC-equipped train.\n28\nCopyright © 2025 IEEE. All rights reserved.",
      "source_file": "IEEE Std 1474.1-2025 IEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 30,
      "text": "IEEE Std 1474.1TM-2025\nIEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements\nThe movement authority limit shall be the most restrictive of the following:\na) The rear of a CBTC-equipped train ahead (as determined by the CBTC train location function in\n6.1.1.1), with allowance for any location uncertainty\nb) The boundary of a section of track occupied by a non-CBTC-equipped train or a train with inoperative\ntrain-borne CBTC equipment (as determined by a secondary train detection system, if provided, per\n6.1.1.2)\nc) The end-of-track (see 6.1.5)\nd) The entrance to an interlocking, when the route is not verified as aligned and locked (see 6.1.11)\ne) The boundary of a section of track with an opposing authorized travel direction or conflicting routing\nestablished (see 6.1.12)\nf) The boundary of a blocked track (see 6.1.13)\ng) If specified by the authority having jurisdiction, the entrance to a highway grade crossing where\nwarning devices are not confirmed to be operating (see 6.1.15)\nh) The entrance to a route that is detected to be unsafe for train movement (see 6.1.16)\nIf specified by the authority having jurisdiction, the CBTC safe train separation function shall support\nautomatic close-up of trains and automatic coupling and uncoupling of trains in designated areas.\nIf specified by the authority having jurisdiction, facilities may be provided to bypass the CBTC safe train\nseparation function to allow a train, under the control of a train operator, to travel beyond its movement\nauthority limit (e.g., at a restricted speed).\nIf specified by the authority having jurisdiction, facilities may be provided to pull back (i.e., make more\nrestrictive) a movement authority limit previously granted to a train. If the train were approaching or braking\ntoward the original movement authority limit, the train may be in violation of the new ATP profile. Under\nsuch circumstances, a CBTC system shall initiate an immediate brake application. The brake application may\nbe an immediate emergency brake application or a supervised service brake application, as specified by the\nauthority having jurisdiction (see 6.1.3).\n6.1.2.1 Safe braking model\nA safe braking model shall be developed for each CBTC application.\nThe safe braking model shall, as a minimum, include consideration of the following:\na) Location uncertainty of lead train (including rollback tolerance)\nb) Train length\nc) Train configuration (see 4.3)\nd) Allowable overspeed permitted by the CBTC system\ne) Maximum CBTC speed measurement error\nf) CBTC system reaction times and latencies\ng) Maximum train acceleration rate possible at the time an overspeed condition is detected by the CBTC\nsystem\nh) Worst-case reaction times to disable the propulsion system and apply the emergency brakes following\ndetection of an overspeed condition by the CBTC system\ni) Guaranteed emergency brake rate (GEBR)\nj) Grade\n29\nCopyright © 2025 IEEE. All rights reserved.",
      "source_file": "IEEE Std 1474.1-2025 IEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": false,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 31,
      "text": "IEEE Std 1474.1TM-2025\nIEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements\n\nThe GEBR shall be the minimum emergency brake rate achieved by a train on level tangent track under the\nrange of environmental conditions and worst-case credible latent brake equipment failure modes, which can\nbe anticipated to exist for that train in the specific application. The GEBR shall be specified by the authority\nhaving jurisdiction and shall include consideration of maximum train load, minimum anticipated adhesion\nlevels, and maximum design tailwind.\nA typical safe braking model is provided in Annex D.\nA CBTC system shall have the capability to support multiple safe braking models to accommodate different\ntrain acceleration/braking rates for different classes and configurations of trains operating simultancously\nwithin CBTC territory and to accommodate automatic close-up and automatic coupling/uncoupling\ncapabilities, as specified by the authority having jurisdiction. A CBTC system shall incorporate appropriate\nprotection to ensure that the correct safe braking model is applied for a given train at a given location.\n6.1.3 Overspeed protection and brake assurance\nOverspeed protection shall be a required ATP function for any CBTC system configuration.\nIn establishing, supervising, and enforcing the ATP profile, as governed by the safe braking model of 6.1.2.1, a\nCBTC system shall ensure that under no circumstances, including failures, the train’s actual speed exceeds its\nsafe speed. The safe speed shall be derived by considering the most restrictive of the following:\n\na) The permanent speed limits on sections of track within the ATP profile\n\nb) Any temporary speed restrictions on sections of track within the ATP profile\n\nc) Any permanent speed restriction applicable to the particular class or configuration of train\n\nd) Any speed restrictions enforced on the train because of train-borne failure conditions\n\ne) The maximum speed that would allow the train to stop safely prior to the limit of the train’s movement\n\nauthority or to slow down sufficiently to meet appropriate permanent or temporary speed restrictions\nupon entering that section of track\nSpeed limits and restrictions shall apply when any portion of the train is within the speed limit area. Speed\nlimit/speed restriction resolution parameters for typical CBTC systems are included in Annex C.\nEnforcement of the calculated ATP profile shall be achieved by comparing the CBTC-dctermined train speed\nwith the ATP profile speed at the CBTC-determined train location. If the ATP profile speed at that location is\nexceeded, the CBTC system shall initiate an immediate brake application.\nThe brake application may be an immediate emergency brake application or a supervised service brake\napplication, as specified by the authority having jurisdiction. In the latter case, a CBTC system shall monitor\nthe achieved brake rate to determine that an acceptable brake rate is achieved within a predetermined\ntime frame; if not, it shall immediately apply the emergency brakes. The safe braking model shall include\nappropriate allowances for reaction times associated with this brake assurance function.\n6.1.4 Rollback protection\nRollback protection shall be a required ATP function for any CBTC system configuration.\nA CBTC system shall monitor actual train travel direction and shall compare measured travel direction with\nthe authorized travel direction. Train motion against the authorized travel direction for more than a specified\nrollback tolerance (distance, optional velocity) shall result in the CBTC system initiating an emergency brake\napplication. Rollback detection criteria for typical CBTC systems are included in Annex C.\n30\nCopyright © 2025 IEEE. All rights reserved.",
      "source_file": "IEEE Std 1474.1-2025 IEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 32,
      "text": "IEEE Std 1474.1TM-2025\nIEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements\n6.1.5 End-of-track protection\nEnd-of-track protection shall be a required ATP function for any CBTC system configuration that permits the\noperation of trains up to, or in close proximity to, an end-of-track terminus.\nEnd-of-track protection shall be incorporated into, or function in conjunction with, overspeed protection to\nprevent trains from over-traveling the end-of-track or, if buffers are specified, to prevent trains from exceeding\nthe design limits for impact with an end-of-track buffer. End-of-track protection design shall be based on the\nsafe braking model of 6.1.2.1.\n6.1.6 Parted train protection and coupling and uncoupling of trains\nWhere separate vehicles can be coupled together in a consist of two or more vehicles or units to form a train, a\nCBTC system shall have the capability of detecting and protecting parted trains. Parted train protection shall\nbe required regardless of whether the individual vehicles or units are considered to be permanently coupled or\nwhether they are routinely uncoupled for maintenance or operational purposes.\nA CBTC system shall also support operating requirements for coupling and uncoupling of trains, including\nautomatic update of the consist length within the CBTC system.\nIf specified by the authority having jurisdiction, a CBTC system may assume a fixed, worst-case, maximum\ntrain length for a given class of trains operating in CBTC territory, with a reliance on operating procedures to\nensure this maximum train length is not exceeded.\n6.1.7 Zero speed detection\nZero speed detection shall be a required ATP function for any CBTC system configuration and shall be in\naccordance with the requirements of 5.10 of IEEE Std 1475-2012.\nZero speed detection criteria for typical CBTC systems and applications are included in Annex C.\n6.1.8 Train door protection\n6.1.8.1 Door opening control protection interlocks\nIf trains are operated with crews, door open control protection interlocks may be a required ATP function, at the\noption of the authority having jurisdiction. For operation of trains without crews, door open control protection\ninterlocks shall be mandatory. These interlocks, if provided, shall be such that the following conditions are\nsatisfied prior to enabling the opening of the train doors (and platform doors, if fitted):\na) The train is “properly aligned” at a designated stopping point, where the designated stopping point and\nrequired tolerances shall be as specified by the authority having jurisdiction.\nb) There is a platform (or other location specified by the authority having jurisdiction) on the side of the\ntrain for which the door opening is allowed.\nc) Zero speed is detected, in accordance with 6.1.7.\nd) The train is constrained against motion.\ne) For applications where the train length exceeds usable platform length, selective door open enable\nshall prevent enabling doors not aligned with platform.\nIf specificd by the authority having jurisdiction, facilitics may be provided for a local manual bypass of the\npreceding door open control protection interlocks, for failure recovery purposes.\n31\nCopyright © 2025 IEEE. All rights reserved.",
      "source_file": "IEEE Std 1474.1-2025 IEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 33,
      "text": "IEEE Std 1474.1TM-2025\nIEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements\n\n6.1.8.2 Emergency Evacuation Door Release\nIf required by the authority having jurisdiction, a CBTC system shall support emergency evacuation in areas\nbetween stations. Door release shall only be allowed for side with a designated emergency walkway.\n6.1.8.3 Uncommanded train door opening\nAutomatic response to an uncommanded train door opening event may be a required ATP function, at the\noption of the authority having jurisdiction.\nThis function, if provided, shall continuously monitor the closed and locked status of all passenger doors on\ncach car of the train and shall provide a safe reaction if at any time it cannot be confirmed that all passenger\ndoors are closed and locked when they are being commanded closed.\nThe safe reaction to be taken by the CBTC system upon detection of an uncommanded train door opening\nevent shall be specified by the authority having jurisdiction.\n6.1.9 Platform Interlocks\n6.1.9.1 Departure Interlocks\nIf trains are operated with crews, departure interlocks may be a required ATP function, at the option of the\nauthority having jurisdiction.\nFor operation of trains without crews, departure interlocks shall be mandatory.\nThese interlocks, where required, shall prevent a stationary train from moving (e.g., by disabling the propulsion\nsystem and apply brakes) unless all train doors (and platform edge doors, if fitted) are properly closed and\nlocked, in accordance with the requirements of 5.14 of IEEE Std 1475-2012.\nIf a platform edge door to train door intrusion system is provided for a gap between train and platform edge\ndoor, in the event of intrusion detected, the CBTC system shall prevent train from departing.\nIf specified by the authority having jurisdiction, facilities may be provided for a local manual bypass of the\npreceding departure interlocks, for failure recovery purposes.\n6.1.9.2 Arrival Interlocks\nIf trains are operated with crews, arrival interlocks may be a required ATP function, at the option of the\nauthority having jurisdiction.\nFor operation of trains without crews, arrival interlocks shall be mandatory.\nThese interlocks, where required shall function as follows:\n\na) Ifplatform edge doors are not closed and locked, train movement into station shall be prevented.\n\nb) _ If.an intrusion system is provided, in the event of intrusion detected, the CBTC system shall prevent\n\ntrain from entering station.\nc) Ifspecified by the authority having jurisdiction, facilitics may be provided for a local manual bypass\nof the preceding arrival interlocks, for failure recovery purposes.\n32\nCopyright © 2025 IEEE. All rights reserved.",
      "source_file": "IEEE Std 1474.1-2025 IEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 34,
      "text": "IEEE Std 1474.1TM-2025\n\nIEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements\n6.1.10Emergency braking\nThe train’s emergency brake system shall be capable of bringing the train to a stop within the assured stopping\ndistance determined by the safe braking model of 6.1.2.1. Specific criteria for resetting the emergency brakes\nto allow normal operation to resume shall be specified by the authority having jurisdiction. If conditions (as\ndetermined by ATP) are not correct for train movement, the emergency braking shall remain applied regardless\nof any reset signals or actions, except that facilities may be provided for a local manual bypass of the ATP\nfunctions for that train to permit manual train operation for failure recovery purposes. Use of such facilities\nshall require strict adherence to operating procedures to provide for the safety of train movements. If correct\nATP conditions exist after the emergency brakes have been reset, the train shall be permitted to move or\ncontinue to move; however, if the actual train speed again exceeds the ATP profile speed or a subsequent\nmalfunction occurs, emergency braking shall be applied as before.\n6.1.11 Route interlocking\nA CBTC system shall provide route interlocking functions equivalent to conventional interlocking practice\nto prevent train collisions and derailments. These functions shall include locking of the route in advance of\nthe train entering the interlocking (time or approach locking) and once the train is in the interlocking (route\nlocking). The switches shall also be locked when the track section containing the switch is occupied by a\ntrain (detector locking). Locking functions shall also apply to moveable bridges and similar right-of-way\napparatus. Sectional release (of routes behind a train) may be provided where specified by the authority having\njurisdiction.\nNOTE—The AREMA Communications and Signals Manual, Sections 2 and 16 [B1], provides examples of recommended\npractices for use in interlocking design.\nA movement authority shall not be advanced into an interlocking until the appropriate route is set and locked.\nOnce a movement authority has been advanced through an interlocking, the affected route shall not be\nreleased, and conflicting routes cleared unless either the train has traveled through and ts verified clear of the\ninterlocking or the movement authority is pulled back short of the interlocking and is in effect.\nWhen specified by the authority having jurisdiction, interlocking functions may be provided by separate\ninterlocking equipment, which is based on train position established by a secondary train detection subsystem.\nIn this case, a CBTC system shall interface to and may modify the conventional interlocking functions based\non train position established by the CBTC train location determination function, to safely enable the enhanced\nperformance capabilities of a CBTC system to be realized.\n6.1.11.1 CBTC interfaces to a separate interlocking\nIf a separate interlocking is specified, a CBTC system shall interface to interlockings as follows:\n\na) Time or approach locking shall apply, except in the event of a route being canceled for an approaching\nCBTC train (1.e., the movement authority is pulled back short of the interlocking and is in effect). In\nthis case, if the train is greater than a safe braking distance from the entrance to the interlocking (as\ndetermined by the safe braking model of 6.1.2.1) or the train stops prior to entering the interlocking,\nthe route shall be released without running further time.\n\nb) Traffic locking may be overridden so that CBTC-equipped trains may move in opposing directions\nwithin their respective movement authorities on the same track at the same time.\n\nc) Wayside signals and their aspects may be provided as specified by the authority having jurisdiction. A\nCBTC system may override the conventional aspects to cause the signal(s) to display CBTC aspect(s)\nonly to CBTC-equipped trains.\n\n33\nCopyright © 2025 IEEE. All rights reserved.",
      "source_file": "IEEE Std 1474.1-2025 IEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 35,
      "text": "IEEE Std 1474.1TM-2025\nIEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements\n\n6.1.11.2 Responses to CBTC train location failures\nIn the event of a failure of the CBTC train location determination function, route locking shall remain in effect\nuntil the train is proven to be clear of the interlocking by the CBTC system (i.e., the train is subsequently\ndetermined to be clear of the interlocking limits), or through operating procedures, or a combination of both\napproaches.\nIn the event of a failure of the CBTC train location determination function in an interlocking where train\nlocation is also capable of being detected by means of a secondary system, CBTC system overrides of the\ninterlocking functions may be released, provided route and other locking functions are maintained by a\nseparate interlocking system so as to prevent the movement of a switch in front of and under the train until the\ntrain is proven to be clear of the interlocking.\n6.1.11.3 Response to loss of switch indication\nIn the event of a loss of switch indication once a movement authority has been issued across a switch, a CBTC\nsystem shall pull back the movement authority to a point prior to the switch.\n6.1.12 Travel direction reversal interlocks\nTravel direction reversal interlocks shall be a required ATP function for any CBTC system application\nrequiring bidirectional operations, in order to support reversal of train direction at terminal stations and to\nsupport intermediate turn backs and shuttle modes of operation, for example.\nIt shall not be possible to extend the movement authority for a train into a section of track for which an opposing\nauthorized travel direction has already been established.\nA reversal of authorized travel direction within a section of track shall not be possible unless both of the\nfollowing are true:\n\na) All trains within that section of track are at zero speed and constrained against motion in the original\n\nauthorized travel direction.\nb) The movement authorities for all trains outside of that section of track do not extend into the section\nand are constrained from being extended into the section in the original authorized travel direction.\n6.1.13 Work zone protection\nA CBTC system shall not grant movement authorities to trains to operate into out-of-service (blocked) tracks\nor through switches blocked in other than the required position and shall enforce restricted speeds on approach\nto and through defined work zones (see 6.3.6.4). A CBTC system may also include capabilities to preclude\nATO mode of operation through a work zone.\n6.1.14 Broken rail detection\nWhere specified by the authority having jurisdiction, a CBTC system may interface to an external system for\npurposes of broken rail detection. A CBTC system’s reaction to a detected broken rail shall be as specified by\nthe authority having jurisdiction.\n6.1.15 Highway grade-crossing warning\nWhere highway crossings at grade exist within the limits of CBTC territory and where specified by the authority\nhaving jurisdiction, a CBTC system may interface to grade-crossing warning devices to permit control of such\ndevices based on CBTC location reports and to coordinate movement authorities through the crossing based\n34\nCopyright © 2025 IEEE. All rights reserved.",
      "source_file": "IEEE Std 1474.1-2025 IEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 36,
      "text": "IEEE Std 1474.1TM-2025\nIEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements\non the status from such devices. Specific requirements shall adhere to local grade crossing standards and shall\nbe further defined by the authority having jurisdiction and may include any of the following:\n\na) Constant (and consistent) warning times, independent of train speed or acceleration/deceleration\n\nb) For trains making station stops prior to crossings, delayed activation of the warning devices until the\ntrain is ready to depart the station\n\nc) An external subsystem providing status of grade crossing may modify CBTC operation, such as\nmovement authority limit\n\nd) When atrain clears a crossing in multiple track areas, continued activation of the warning devices if\nthe CBTC system predicts a second train will reactivate the devices within a predefined time interval\n\ne) Advance warning for priority control of highway traffic signals or other highway signage, (e.g., as\ndescribed in IEEE Std 1570-2002)\n\n6.1.16 Restricted route protections\n\nWhere specified by the authority having jurisdiction, a CBTC system shall include capabilities to prevent a\ntrain from entering a route that is unsafe for movement of that type of train due to mechanical, civil, electrical,\nor other predefined temporary or permanent conditions of the train or route, or through interfaces to intrusion\ndetection devices, platform edge doors (where fitted), and/or other devices capable of detecting hazards that\nimpact route integrity.\n\n6.2 ATO functions\n\nFor operation of trains without crews, a CBTC system shall, as a minimum, be capable of providing all of the\nATO functions as defined in this sub clause, to automatically operate trains in accordance with prescribed\noperating criteria within the safety constraints imposed by ATP.\n\nFor operation of train with crews, the required ATO functions shall be as specified by the authority having\njurisdiction.\n\nThe CBTC wayside-to-train and train-to-wayside data communications interface shall be sufficient to support\nall required ATO functions.\n\n6.2.1 Automatic speed regulation\n\nThe starting, stopping, and speed regulation of the train as it travels along the track shall be automatically\ncontrolled by a CBTC system so that the speed, acceleration, deceleration, and jerk rates are within specified\npassenger comfort limits (as defined by the authority having jurisdiction) and the train speed is below the\noverspeed limits imposed by ATP.\n\nStation stopping accuracy shall be as specified by the authority having jurisdiction.\n\nA CBTC system may support multiple ATO speeds, acceleration, and service brake rates in accordance with\nthe train operator (if present) or ATS inputs.\n\n6.2.2 Platform berthing control\n\nA CBTC system shall be capable of implementing any of the following platform berthing control modes:\n\na) Where the platform length is approximately equal to the train length, a CBTC system shall allow a\ntrain to enter a station platform only if there is sufficient room to fully berth or if the preceding train\nhas a movement authority that shall allow it to fully leave the platform area and it has begun to move\nout of the station (i.e., within ATP constraints, train movement shall be controlled to minimize the\nlikelihood of the train coming to a stop when only partially within the station platform limits).\n\n35\nCopyright © 2025 IEEE. All rights reserved.",
      "source_file": "IEEE Std 1474.1-2025 IEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 37,
      "text": "IEEE Std 1474.1TM-2025\nIEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements\nb) Where the platform length is longer than the train length, a CBTC system shall support multiple\nstopping positions within the platform area, as defined by the authority having jurisdiction.\nc) Where the platform length supports multiple train berthings, a CBTC system shall allow a train to\nenter a platform while another train already occupies an alternative berth.\nd) Where the platform length is shorter than the train length, a CBTC system shall support platform\nberthings consistent with the door opening control protection interlocks of 6.1.8.\n6.2.3 Door control\nA CBTC system shall be capable of automatically controlling train doors (and platform edge doors, where\nfitted) during passenger boarding and discharging.\nAs defined by the authority having jurisdiction, automatic door control may be fully automatic (both open and\nclose) or may be limited to the following:\na) Automatic door opening only (with or without passenger door open requests)\nb) Automatic door closing only\nc) Neither automatic door opening nor closing\nIf automatic platform edge doors are provided, they shall be controlled as a set with the matching train doors\nsuch that the train and matching platform edge doors open and close together. It shall be possible to manually\ndisable the operation of any door set (both the train and the matching platform edge door) without affecting\nthe automatic operation of other door sets. If a train door is disabled, the corresponding platform edge door\nshall not open. If a platform edge door is disabled, the corresponding train door shall not open. The amount of\ntime the train is to remain in the station with doors open may be established by ATS (6.3.5.1) and automatically\ncontrolled by ATO.\n6.2.4 Standby mode and Sleep mode\n6.2.4.1 Standby mode\nIf required by the authority having jurisdiction, a CBTC system shall be capable to send a command to the\ntrain to turn off non-essential systems as specified by authority having jurisdiction.\nFor a train in standby mode: A CBTC system shall be capable to send a command to the train to turn on non-\nessential systems.\n6.2.4.2 Sleep mode\nIf required by the authority having jurisdiction, a CBTC system shall be capable to turn off (or partially turn\noff) the train-borne CBTC equipment and of waking up when commanded.\n6.2.5 Train Wash\nIf required by the authority having jurisdiction, a CBTC system shall support train wash functions as specified\nby authority having jurisdiction such as lower speed and accurate stopping.\n6.2.6 Reduced Performance Due to Environmental Factors\nIf required by the authority having jurisdiction, a CBTC system shall support reduced braking and acceleration\nrates to compensate for non-optimal adhesion due to environmental conditions.\n36\nCopyright © 2025 IEEE. All rights reserved.",
      "source_file": "IEEE Std 1474.1-2025 IEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 38,
      "text": "IEEE Std 1474.1TM-2025\nIEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements\n\n6.2.7 Jogging\nIf required by the authority having jurisdiction, CBTC trains shall have provisions to reverse train movement\nto re-position in order to align with the stopping point. These events shall be alarmed and logged in ATS or as\nspecified by authority having jurisdiction.\n6.2.8 Automatic Coupling and Uncoupling\nIf required by the authority having jurisdiction, provisions shall be made to command a train to automatically\ncouple with a stationary train. Coupling speed and operational conditions shall be as defined by authority\nhaving jurisdiction. Provisions shall also be made to command a train to automatically uncouple. The\nuncoupling point shall be as commanded by ATS. Uncoupling operational conditions shall be as defined by\nauthority having jurisdiction. For coupling and uncoupling, train length and integrity shall be in accordance\nwith 6.1.6.\n6.3 ATS functions\nIf specified by the authority having jurisdiction, a CBTC system may interface to, or be integrated with,\nan ATS system. Under such circumstances, and to the extent specified by the authority having jurisdiction,\nCBTC- related ATS functions shall be implemented as defined in this sub clause in order to benefit from the\ncharacteristics of a CBTC system as defined in 4.1, namely, the availability of the following:\n\na) Train location information to a high precision, independent of track circuits\n\nb) Continuous wayside-to-train and train-to-wayside data communications link\n\nc) Train-borne and wayside data processing capabilities\nThe CBTC-related ATS functions defined in this sub clause shall be fully integrated with other conventional\nATS functions and other non-ATS functions, as may be specified by the authority having jurisdiction, to\nsupport overall service management for the transit system and provide for a single consistent user interface.\nThe CBTC data communications network, inclusive of the wayside-to-train and train-to-wayside data\ncommunications interface, shall be sufficient to support those CBTC-related ATS functions specified by the\nauthority having jurisdiction.\n6.3.1 ATS user interface\nEach ATS user interface shall display all information and implement all control actions, as defined in 6.3,\nwithin acceptable latencies as specified by the authority having jurisdiction.\nMandatory display data and user information inputs shall be in accordance with IEEE Std 1474.2-2025. The\nATS user shall be able to override any automated CBTC-rclated ATS functions defined in 6.3.\nCertain ATS functions (such as stopping a train en route and the application and removal of temporary speed\nrestrictions, switch/track blocking, or work zones) can potentially introduce system hazards and the specific\nimplementation of these functions shall be considered in the hazard analyses required by 5.3.2. ATS functions\nare not required to be implemented in a fail-safe manner; however, the hazard analyses shall take into account,\nas a minimum, the probability of the following:\n\na) Safety-related commands not being executed when initiated by an ATS user,\n\nb) The CBTC system prematurely removing safety-related commands initiated by an ATS user,\n\nc) The CBTC system executing safety-related commands that were not initiated by an ATS user,\n\nd) Incorrect information being displayed by the CBTC system to the ATS user.\n\n37\nCopyright © 2025 IEEE. All rights reserved.",
      "source_file": "IEEE Std 1474.1-2025 IEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 39,
      "text": "IEEE Std 1474.1TM-2025\nIEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements\nThe hazard analyses shall give due consideration of the specific transit application and whether the trains are\noperated with or without crews.\nControl action confirmation (e.g., separate acknowledgment) shall be provided for any safety-related user\ninterfaces/inputs and functions whose inadvertent implementation could have an adverse operational impact\n(e.g., removal of work zones, removal of speed restrictions), as defined by the authority having jurisdiction.\nControl action commands may be implemented in a closed loop manner that requires a request and\nacknowledgment between ATS and CBTC system.\n6.3.2 CBTC train identification and train tracking\nEach CBTC-equipped train operating within CBTC territory shall be assigned a train identification. This train\nidentification shall indicate the type of train and other pertinent information about the train.\nAn ATS system shall have the capability to automatically track, maintain records of, and display on the ATS\nuser interface the locations, identities, train schedule, and other pertinent data for all CBTC-equipped trains\noperating in the CBTC territory. The front and rear position of trains shall be tracked based on CBTC train\nlocation reports, and the train location shall be displayed on the ATS user interface. Variations in train length\nmay be displayed either proportionally or as a standard-length icon supplemented by textual train length data.\nThe ATS systems may also have provisions to display non-CBTC or non-communicating trains.\n6.3.3 Train routing\nAn ATS system shall have the capability to permit CBTC-equipped trains operating in CBTC territory to be\nmanually and automatically routed based on CBTC train location reports and in accordance with the train\nservice data, predefined routing rules, and any ATS user-directed service strategy. Where applicable to the\nspecific track configuration, automatic routing shall facilitate the proper merging and diverging of trains\nat junctions, turn back of trains, the movement of trains from/to storage areas, and the rerouting of trains\nin response to service disruptions and/or planned outages. Train routes shall be indicated on the ATS user\ninterface and may also be indicated to the train operator and/or conductor, if present, on their displays, as\nspecified by the authority having jurisdiction.\nAn ATS system may also include a means to control and limit movement authorities of CBTC-equipped trains\noperating in CBTC territory. CBTC movement authority limits shall be capable of being displayed on the ATS\nuser interface, and any uncommanded reductions of authority limits shall be alarmed.\nFor trains operated with crews, movement authority limits may also be indicated to the train operator and/or\nconductor on their displays, as specified by the authority having jurisdiction.\n6.3.4 Automatic train regulation\n6.3.4.1 Schedule/headway regulation\nAn ATS system may have the capability to automatically monitor and regulate the performance of CBTC-\nequipped trains operating in CBTC territory, in relation to schedule and/or headway adherence.\nAn ATS system may include an automatic dispatching function (based on train identities, schedules, CBTC\ntrain location reports, scheduled and actual headways between trains, and service strategies implemented by\nauthorized ATS users).\nSchedule and headway regulation for CBTC-equipped trains shall be by means of dwell time variance\n(including train holds) and may also be by control of run times between stations (e.g., through adjustments to\ntrain acceleration and service brake rates, and speeds), as specified by the authority having jurisdiction. For\ntrains operated with crews, the desired station departure time, dwell time, and desired speed profile between\n38\nCopyright © 2025 IEEE. All rights reserved.",
      "source_file": "IEEE Std 1474.1-2025 IEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": false,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 40,
      "text": "IEEE Std 1474.1TM-2025\nIEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements\nstations may be indicated to the train operator and/or conductor on their displays, and, when operating in ATO\nmode, shall be implemented automatically by a CBTC system using the automatic speed regulation function\nof 6.2.1 and may include dwell time adjustment.\nAn ATS system may provide the capability to adjust the train service braking profiles and tractive effort for\nCBTC-equipped trains (e.g., in response to climatic (e.g., wet rail conditions). A CBTC system shall coordinate\nimplementation of requested changes in service braking profiles to avoid conditions that would result in an\nemergency brake application.\n6.3.4.2 Junction management\nAn ATS system may include automatic train regulation functions, based on CBTC train location reports, to\nfacilitate appropriate train meets (such as transfers between local and express tracks, and at the merge point\nbetween different lines) in order to optimize overall system operational performance.\n6.3.4.3 Energy optimization\nAn ATS system may have the capability to implement energy optimization algorithms for CBTC-equipped\ntrains through the real-time control and coordination of train acceleration, train coasting, and train braking.\nThe priority given to energy optimization versus schedule/headway regulation shall be as specified by the\nauthority having jurisdiction.\n6.3.5 Station stop functions\n6.3.5.1 Stop train at next station\nAn ATS system may include the means to direct a single CBTC-equipped train or a group of CBTC-equipped\ntrains to stop at the next station, even if the train is scheduled to bypass that station. For trains operated with\ncrews, a CBTC system may indicate the ATS train stop information to the train operator and conductor on their\ndisplays. In ATO mode, a CBTC-equipped train shall automatically stop at the next station.\n6.3.5.2 Hold train at station\nFor trains operated without crews, an ATS system shall include facilities to hold (and subsequently release) a\nCBTC-equipped train at a station.\nFor trains operated with crews, this function is optional and shall be as specified by the authority having\njurisdiction. If this function is provided, a CBTC system may indicate the train hold information to the train\noperator and conductor on their displays, and/or prevent a CBTC-equipped train from departing the station in\nATO mode.\n6.3.5.3 Skip station stop\nAn ATS system may include facilities to direct a CBTC-equipped train or group of CBTC-equipped trains to\npass through a station or group of stations without stopping. For trains operated with crews, a CBTC system\nmay indicate the skip station information to the train operator and conductor on their displays. In ATO mode,\nthe train shall automatically skip the designated stations at a speed not exceeding speed as defined by authority\nhaving jurisdiction. Skip station stop command may inhibit automatic door opening if train happens to stop at\nplatform (e.g., per movement authority).\n6.3.5.4 Door control inhibit\nAn ATS system may include facilities to inhibit (and subsequently permit) CBTC control of the train doors, in\naccordance with 6.2.3.\n39\nCopyright © 2025 IEEE. All rights reserved.",
      "source_file": "IEEE Std 1474.1-2025 IEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": false,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 41,
      "text": "IEEE Std 1474.1TM-2025\nIEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements\n6.3.6 Restricting train operations\nThe application and removal of the following restrictive functions can potentially introduce system hazards\nand the specific implementation of these functions shall be in accordance with 6.3.2 and considered in the\nhazard analyses required by 5.3.2. Stacked (multiple) safety related or restrictive commands shall be removed\none at a time in accordance with 6.3.2 so that no unintended permissive state is allowed.\n6.3.6.1 Stopping a train enroute\nAn ATS system shall provide a means to stop a single CBTC-equipped train or group of CBTC-equipped trains\nimmediately. A CBTC system shall initiate an immediate brake application on the designated trains and notify\nthe train operator and conductor, if present, via their displays. Removal of the ATS initiated stop command\nmay be accomplished on a train by train basis for all CBTC-equipped trains.\n6.3.6.2 Temporary speed restrictions\nAn ATS system shall include facilities to impose (and remove) temporary speed restrictions for CBTC-\nequipped trains operating on any section of track in CBTC territory (see 6.1.3).\n6.3.6.3 Switch/track blocking\nAn ATS system shall include facilities to block (and subsequently unblock) a switch, a controlled signal, a\nroute entry point, or a section of track within CBTC territory. A CBTC system shall prohibit CBTC-equipped\ntrains from receiving movement authorities over blocked switches not aligned in the required position or into\nroutes and/or sections of track that have been blocked (see 6.1.2 and 6.1.3).\n6.3.6.4 Work zones\nAn ATS system shall include facilities to establish (and subsequently remove) temporary work zones for the\nprotection of work crews and work trains.\nA CBTC system shall enforce restricted speeds on approach to and through defined work zones (see 6.1.13). A\nCBTC systems may also enforce restricted speed on adjacent track through defined work zone as determined\nby authority having jurisdiction. A CBTC system may also enforce a stop prior to entering work zone. For\ntrains operated with crews, information indicating that the restriction is due to a work zone shall be displayed\nto the train operator and conductor on their displays, and the CBTC system may preclude ATO mode of\noperation through a work zone.\nIf the authority having jurisdiction allows roadway workers during train operations, the ATS/CBTC system\nmay provide methods of visually and audibly indicating the approach of trains along the wayside to warn on-\ntrack roadway workers.\n6.3.6.5 Climatic conditions\nIf a Climatic condition is a function of the service brake calculations, removal of such restriction shall be done\nin accordance with 6.3.2.\n6.3.7 Passenger information system interfaces\nAn ATS system may interface with wayside and/or train-borne passenger information systems to trigger\nautomatic passenger information messages, such as train arrival information, based on CBTC train location\nreports. Train-borne passenger information system interfaces shall be in accordance with IEEE Std 1477- 1998.\n40\nCopyright © 2025 IEEE. All rights reserved.",
      "source_file": "IEEE Std 1474.1-2025 IEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": false,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 42,
      "text": "IEEE Std 1474.1TM-2025\nIEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements\n6.3.8 Fault reporting and logs\n6.3.8.1 CBTC fault reporting\nFailures and out-of-tolerance conditions detected by, or input to, a CBTC system that can impact the on-\ntime performance of the transit system or result in some other loss of specific CBTC functionality may be\nautomatically indicated on the ATS user interface display. Any alarms shall be categorized and prioritized into\ncritical and noncritical alarms and logged. All critical alarms, as defined by authority having jurisdiction shall\nrequire acknowledgment.\n6.3.8.2 Train fault reporting\nTrain-borne CBTC equipment may include interfaces to train-borne subsystems for the purposes of\ncommunicating train health data to the wayside for display on the ATS user interface displays, as specified by\nthe authority having jurisdiction.\n6.3.8.3 CBTC data logging\nCBTC system shall log all communication between all CBTC sub systems in all modes of operation and store\nin accordance with requirements as defined by authority having jurisdiction.\nCBTC logged data shall be available for playback analysis and incident investigation and to aid in trouble\nshooting. This data may also be available for external data analysis by 3rd party tools.\n6.4 Interoperability interface requirements\nThis performance and functional requirements standard does not include interface design standards for\ninteroperability. Where interoperability requirements are specified by the authority having jurisdiction, it shall\nbe the responsibility of that authority to define the required interoperability interface standards.\nNOTE—Examples of interoperability requirements include the following:\na) Trains equipped with CBTC equipment furnished by one supplier to be capable of operating in CBTC territory\nequipped with wayside CBTC equipment furnished by another supplier\nb) | Wayside equipment furnished by two separate suppliers to communicate with each other in the overlap area and\nwith common central ATS equipment\nc) A basic operating unit with train-borne CBTC equipment furnished by one supplier to be capable of operating\nwithin a train with another basic operating unit equipped with train-borne CBTC equipment furnished by another\nsupplier\nA future CBTC standard may establish interoperability interface requirements.\n41\nCopyright © 2025 IEEE. All rights reserved.",
      "source_file": "IEEE Std 1474.1-2025 IEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 43,
      "text": "IEEE Std 1474.1TM-2025\nIEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements\nAnnex A\n(informative)\nBibliography\nBibliographical references are resources that provide additional or helpful material but do not need to be\nunderstood or used to implement this standard. Reference to these resources is made for informational use\nonly.\n[B1] AREMA Communications & Signals Manual of Recommended Practices.14\n[B2] IEEE Std 1698TM-2009, IEEE Guide for the Calculation of Braking Distances for Rail Transit Vehicles.\n14 AREMA publications are available from the American Railway Engineering and Maintenance-of-Way Association, 8201 Corporate\nDrive, Suite 1125, Landover, MD 20785-2230 USA (www .arema. org/ ).\n42\nCopyright © 2025 IEEE. All rights reserved.",
      "source_file": "IEEE Std 1474.1-2025 IEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": false,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 44,
      "text": "IEEE Std 1474.1TM-2025\nIEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements\nAnnex B\n(informative)\nExample functional block diagram for a typical CBTC system\nFigure B.1 illustrates the functional elements within CBTC ATP, ATO, ATS categories.\nATP Functions (6.1)\nTrain Location Speed End-Of-Track Protection Platform Interlocks Work Zone Protection\netermination\n6.1.4 6.15 6.1.9 6.1.13\nParted Train Protection and\nSafe Train Separation Coupling and Uncoupling Emergency Braking Broken Rail Detection\n6.1.2 of Trains 6.1.6 6.1.10 6.1.14\nOverspeed Protection and Zero Speed Detection Route Interlocking Highway Grade-Crossing\nBrake Assurance Warning\n6.1.3 6.1.7 6.1.11 6.1.15\n. . - Traffic Direction Restricted Route\nRollback Protection Train Door Protection Reversal interlocks Protections\n6.1.4 6.18 6.1.12 6.1.16\nATO Functions (6.2) ATS Functions (6.3)\nAutomatic Speed . . .\nRegulation Train Wash ATS User Interface Station Stop Functions\n6.2.1 625 63.1 6.3.5\n, Reduced Performance Due CBTC Train Identification Restricting Train\nPlatform Berthing Control to Environmental Factors and Train Tracking Operations\n6.2.2 6.2.6 6.3.2 6.3.6\n. , , Passenger Information\nDoor Control Jogging Train Routing System Interfaces\n6.2.3 6.2.7 6.3.3 6.3.7\nStandby Mode and Automatic Coupling and Automatic Train ,\nSleep Mode Uncoupling Regulation Fault Reporting and Logs\n6.2.4 6.2.8 6.3.4 6.3.8\nFigure B.1—Example functional block diagram for a typical CBTC system\n43\nCopyright © 2025 IEEE. All rights reserved.",
      "source_file": "IEEE Std 1474.1-2025 IEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 45,
      "text": "IEEE Std 1474.1TM-2025\nIEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements\nAnnex C\n(informative)\nTypical CBTC parameters\nTable C.1 provides typical ranges for certain CBTC parameters for general guidance only. Parameter values\nfor a specific application and/or a specific CBTC system design should be established by the authority having\nJurisdiction and/or the supplier, with due consideration of all relevant factors for the specific application.\nTable C.1—Typical CBTC parameters\nMinimum number of trains that can be processed by a single wayside 10 trains\ncontroller\nResolution of measured train location (i.e., as reported to establish movement <= 6.25m (20 ft)\nauthority limits for a following train for ATP purposes)\nAccuracy of measured train location during normal (non-degraded) + 10m to +60m\noperations (i.e., maximum error in reported train location for ATP purposes) (+ 33 ft to +197 ft)\nStopping accuracy of programmed station stop (ATO) purposes 一without 30 cm一 100 cm\nplatform edge doors (+ 12 - 39 in)\nResolution of train movement authority limits + 0.25 m to +6.25 Im\n(+ 10 in to +20 ft)\nResolution of train speed measurement for ATP purposes + 0.5 km/h to +2 km/h\n(+ 0.3 mi/h to 1.25 mi/h)\nAccuracy of train speed measurement for ATP purposes + 0.8 km/h (0.5 mi/h) + 3%\nof measured speeds\nResolution of train speed commands (e.g., civil speed limits) + 0.5 km/h to +5 km/h\n(+ 0.3 mi/h to +3 mi/h)\nTrain-to-wayside message communication delays 0.5 s to 2 s (nominal)\nWayside-to-train message communication delays 0.5 s to 2 s (nominal)\nWayside CBTC equipment reaction times 0.07 s to 1 s (nominal)\nTrain-borne CBTC equipment reaction times 0.07 s to 0.75 s (nominal)\nRollback detection criteria <=1.0mto2.0m\n(< 3.3 ft to 6.6 ft)\nZero speed detection criteria <0.5 km/h for<=1s\n(< 0.3 mi/h)\nMaintenance tolerance for field objects 0.05m to 1.22 m\n(2 in to 48 in)\n44\nCopyright © 2025 IEEE. All rights reserved.",
      "source_file": "IEEE Std 1474.1-2025 IEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 46,
      "text": "IEEE Std 1474.1TM-2025\nIEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements\nAnnex D\n(informative)\nTypical safe braking model\nD.1 Introduction\nA typical safe braking model for CBTC systems is illustrated in Figure D.1.\nSee IEEE 1698-2009 for additional information. [B2]\nIt should be noted that Figure D.1 is not drawn to scale but is a simplistic representation to assist in the\nunderstanding of a typical CBTC safe braking model. It should also be noted that the safe braking model\noutlined here is defined for level tangent track and would need to be adjusted for grades. The safe braking\nparameters may be different depending on covered versus uncovered track.\nIn Figure D.1, the emergency brake curve is the worst-case, open-loop, speed/distance curve a train will\nfollow once the ATP has initiated an emergency brake application. This emergency brake curve is always less\nthan or equal to the safe speed curve, where safe speed is defined as the speed above which a critical hazard\n(derailment or collision) could occur.\nIn this model, safety factors are accounted for in the emergency brake curve, train position uncertainties, and\nother additional measurement tolerances incorporated in the CBTC system design, and there is no requirement\nto add additional safety margins.\nThe ATP overspeed detection curve is the speed-distance curve that the ATP subsystem uses to immediately\ninitiate an emergency brake application, if the ATP subsystem detects that the measured speed exceeds this\ncurve at the measured train location. When the ATP subsystem has initiated an emergency brake application,\nthe ATP subsystem is no longer in the control loop, and the train will emergency brake at or below the\nemergency brake curve. The emergency brake curve includes an initial propulsion runaway period, until\npropulsion is disabled.\nThe A7P profile curve is the speed-distance curve that is an ATP overspeed allowance below the ATP over-\nspeed detection curve. The ATP profile is the base curve used by the ATP subsystem.\nD.2 Train-borne CBTC response time (A)\nIn Figure D.1, it is assumed that the CBTC system will measure the train speed and train location (relative to\nits movement authority limit) and compare the measured speed with the ATP profile speed at that measured\nlocation, every A seconds (worst case).\nIn Figure D.1, point X represents the situation where the CBTC measured speed is just below the ATP over-\nspeed detection curve at the ATP measured location, 1.e., although the ATP measured speed is above the ATP\nprofile, it is still within the ATP overspeed allowance. As such, the CBTC system will not initiate emergency\nbraking.\nHowever, because of worst-case speed and location measurement errors (position uncertainty), it is possible\nthat the actual speed and actual location of the train could be a point Y.\nAt this point in time, although the train operator and/or ATO subsystem would normally be attempting to\nbring the train speed down to the ATP profile speed, lt is assumed that a failure occurs that results in the train\naccelerating rather than braking.\n45\nCopyright © 2025 IEEE. All rights reserved.",
      "source_file": "IEEE Std 1474.1-2025 IEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 47,
      "text": "IEEE Std 1474.1TM-2025\nIEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements\nA seconds later, this situation will be detected by the CBTC system (point Z in Figure D.1), as the CBTC\nmeasured speed will now clearly be in excess of the ATP overspeed detection curve, and the CBTC system will\nimmediately initiate an open-loop emergency brake application.\nThe speed at point Z therefore represents the maximum speed that a train can achieve above the ATP profile\ndue to CBTC system’s worst-case response times and measurement errors.\nAt this point, the remaining contributions to the safe braking model are determined by the vehicle characteristics\nonly.\nD.3 Propulsion disable response time (B)\nDuring this component of the safe braking model (labeled B in Figure D.1), the train continues to accelerate\nuntil the train propulsion system has been disabled in response to the CBTC system initiating an emergency\nbrake application.\nD.4 Coast time (C)\nDuring this component of the safe braking model (labeled C in Figure D.1), the train is assumed to be coasting\nat the maximum speed achieved as a result of the train accelerating prior to propulsion being disabled. This\ncomponent of the safe braking model ends when emergency braking begins to take effect.\nD.5 Emergency brake build-up time (D)\nDuring this component of the safe braking model (labeled D in Figure D.1), the emergency brake rate will\nbuild up from zero to at least the GEBR.\nD.6 Emergency braking at GEBR (E)\nDuring this component of the safe braking model (labeled E in Figure D.1), the train continues to decelerate at\nthe GEBR until the train comes to zero speed.\nNOTE—The components D and E may be integrated into an equivalent single brake curve.\nD.7 Position uncertainty\nThe safe braking model shall include the maximum distance due to measurement inaccuracy by the CBTC\nsystem for both the leading and following train.\n46\nCopyright © 2025 IEEE. All rights reserved.",
      "source_file": "IEEE Std 1474.1-2025 IEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 48,
      "text": "IEEE Std 1474.1TM-2025\nIEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements\nEmergency Brake\nCurve\nATP Overspeed Point Z: Emergency\nDetection Curve Braking Initiated\nPoint Y: Actual by ATP Movement Authority\nspeed/location at Limit\nstart of propulsion Cc\nrunaway : 2 D /\nSpeed Measurement Error _4 _ _\nATP Overspeed Allowance ~ ~\nU \\ it\nm \\ : Position\na Point X: \\ , Uncertainty\nSpeed/location, i ATP Profile ad \\ i\nas determined by \\\ncarborneATP 4 > \\ |\nPosition: N :\nUncertainty ; \\ |\nATrainborne ATP Reaction Time \\\nB. Time to Disable Propulsion after EB \\ |\n| Initiated \\ |\n_C. Additional Time to Apply EB \\ |\n, D,Emergency Brake Build-up Time |\n; E. Emergency Braking at GEBR N\nDISTANCE (related to Safe Braking Model times)\nFigure D.1一Typical safe braking model\n47\nCopyright © 2025 IEEE. All rights reserved.",
      "source_file": "IEEE Std 1474.1-2025 IEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 49,
      "text": "IEEE Std 1474.1TM-2025\n\nIEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements\nAnnex E\n(normative)\nSystem Safety and Security Program requirements\nSystem Safety Program Plan may be superseded based on requirement established by regulatory bodies or\nauthority having jurisdiction.\nIn addition to SSPP, the authority having jurisdiction may also implement a Systems Security Program that\nincludes a Threat and Vulnerability Assessment (TVA).\nE.1 System Safety Program Plan (SSPP)\nE.1.1 Purpose\nThe SSPP shall describe, in detail, tasks and activities of system safety management and system safety\nengineering required to identify, evaluate, and eliminate/control hazards or reduce the associated risk to a level\nacceptable to the authority having jurisdiction throughout the system life cycle.\nE.1.2 Description\nAn SSPP shall be developed to provide a basis of understanding as to how the System Safety Program will be\naccomplished to meet safety requirements. The approved plan shall, on an item-by-item basis, account for all\nrequired tasks and responsibilities. The SSPP shall include the following elements.\nE.1.2.1 Program scope and objectives\nEach SSPP shall describe, as a minimum, the five elements of an effective System Safety Program: definition of\nthe safety tasks, a planned approach for task accomplishment, qualified people to accomplish tasks, authority\nto implement tasks through all levels of management, and appropriate commitment of resources (both staffing\nand funding) to assure tasks are completed. The SSPP shall define a program to satisfy the system safety\nrequirements. This section shall cover the following:\n\na) Describe the scope of the overall program and the related System Safety Program.\n\nb) List the tasks and activities of system safety management and engineering; describe the\ninterrelationships between system safety and other functional elements of the program; list the other\nprogram requirements and tasks applicable to system safety and identify where they are specified or\ndescribed.\n\nc) Account for all contractually required safety tasks and responsibilities. A matrix shall be provided to\ncorrelate requirements to the location in the SSPP where the requirement is addressed.\n\nE.1.2.2 System safety organization\nThe SSPP shall describe the following:\n\na) The system safety organization or function within the organization of the total program using charts\nto show the organizational and functional relationships and lines of communication. It shall also show\nthe organizational relationship between other functional elements having responsibility for tasks\nwith system safety impacts and the system safety management and engineering organization. It shall\nidentify the review and approval authority of applicable tasks by system safety.\n\n48\nCopyright © 2025 IEEE. All rights reserved.",
      "source_file": "IEEE Std 1474.1-2025 IEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 50,
      "text": "IEEE Std 1474.1TM-2025\nIEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements\n\nb) The responsibility and authority of system safety personnel, other contractor organizational elements\ninvolved in the system safety effort, subcontractors, and system safety groups. It shall identify the\nmethods by which safety personnel may raise issues of concern directly to the program manager or\nthe program manager’s supervisor within the corporation, the organizational unit responsible for\nexecuting each task, and the authority in regard to resolution of all identified hazards.\n\nc) The staffing of the system safety organization for the duration of the contract to include manpower\nloading, control of resources, and a summary of the qualifications of key system safety personnel\nassigned to the effort, including those who possess coordination/approval authority for contractor\nprepared documentation.\n\nd) The procedures by which the contractor will integrate and coordinate the system safety efforts,\nincluding assignment of the system safety requirements to action organizations and subcontractors,\ncoordination of subcontractor System Safety Programs, integration of hazard analyses, program and\ndesign reviews, program status reporting, and system safety groups.\n\ne) The process through which contractor management decisions will be made, including timely\nnotification of unacceptable risks, necessary action, incidents or malfunctions, waivers to safety\nrequirements, program deviations, etc.\n\nf) Details of how resolution and action relative to system safety will be effected at the program\nmanagement level possessing resolution authority.\n\nE.1.2.3 System Safety Program milestones\nThe SSPP milestones shall include the following:\n\na) Define System Safety Program milestones. It shall relate these to major program milestones, program\nelement responsibility, and required inputs and outputs.\n\nb) Provide a program schedule of safety tasks, including start and completion dates, reports, and reviews.\n\nc) Identity subsystem, component, and software safety activities as well as integrated system level\nactivities (i.e., design analyses, tests, and demonstrations) applicable to the System Safety Program,\nbut specified in other engineering studies and development efforts to preclude duplication.\n\nd) Provide the estimated manpower loading required to complete each task.\n\nE.1.2.4 General system safety requirements and criteria\nThe SSPP shall describe the following:\n\na) General engineering requirements and design criteria for safety. It shall include safety requirements\nfor support equipment and operational safety requirements for all appropriate phases of the life cycle\nup to, and including, disposal. It shall list the safety standards and system specifications containing\nsafety requirements that shall be complied with, and include titles, dates, and where applicable,\nparagraph numbers.\n\nb) Risk assessment procedures. It shall include the hazard severity categories, hazard probability\nlevels, and the system safety precedence that shall be followed to satisfy the safety requirements\nof the program. It shall state any qualitative or quantitative measures of safety to be used for risk\nassessment, including a description of the acceptable/unacceptable risk levels, and include system\nsafety definitions that modify, deviate from, or are in addition to those in this standard.\n\nc) Closed-loop procedures for taking action to resolve identified unacceptable risk, including those\ninvolving non-developmental items.\n\n49\nCopyright © 2025 IEEE. All rights reserved.",
      "source_file": "IEEE Std 1474.1-2025 IEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 51,
      "text": "IEEE Std 1474.1TM-2025\nIEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements\nE.1.2.5 Hazard analysis\nThe SSPP shall describe the following:\n\na) The analysis techniques and formats to be used in qualitative or quantitative analysis to identify\nhazards, their causes and effects, hazard elimination, or risk reduction requirements and how those\nrequirements are met.\n\nb) The depth within the system to which each technique is used, including hazard identification\nassociated with the system, subsystem, components, software, data, hazardous materials, personnel\nground support equipment, non-developmental items, facilities and their interrelationship in logistic\nsupport, training, maintenance, operational, and disposal (including render safe and emergency\ndisposal) environments.\n\nc) The integration of subcontractor hazard analyses with overall system hazard analyses.\n\nd) Efforts to identify and control hazards associated with materials used during the system’s life cycle.\n\nE.1.2.6 System safety data\nThe SSPP safety data shall include the following:\n\na) Describe the approach for collecting and processing pertinent historical hazard data, mishap data, and\nsafety lessons-learned data.\n\nb) Identify deliverable data by title and number, and means of delivery (e.g., hard copy, electronically).\n\nc) Identify non-deliverable system safety data and describe the procedures for accessibility by the\nauthority having jurisdiction and retention of data of historical value.\n\nE.1.2.7 Safety verification\nThe SSPP shall describe the following:\n\na) The verification (test, analysis, inspection, etc.) requirements for ensuring that safety is adequately\ndemonstrated. It shall identify any certification requirements for software, safety devices, or other\nspecial safety features (e.g., render safe and emergency disposal procedures).\n\nb) Procedures for making sure safety-related verification information is transmitted to the authority\nhaving jurisdiction for review and analysis.\n\nc) Procedure for ensuring the safe conduct of all tests.\n\nE.1.2.8 Audit program\nThe SSPP shall describe the techniques and procedures to be employed to make sure the objectives and\nrequirements of the System Safety Program are being accomplished.\nE.1.2.9 Training\nThe SSPP shall describe the safety training for engineering, technician, operating, and maintenance personnel.\nE.1.2.10 Incident reporting\nThe contractor shall describe in the SSPP the mishap/incident alerting/notification, investigation, and reporting\nprocess, including notification of the authority having jurisdiction.\n50\nCopyright © 2025 IEEE. All rights reserved.",
      "source_file": "IEEE Std 1474.1-2025 IEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 52,
      "text": "IEEE Std 1474.1TM-2025\nIEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements\nE.1.2.11 System safety interfaces\nThe SSPP shall identify, in detail, the following:\n\na) The interface between system safety, systems engineering, and all other support disciplines, such\nas maintainability, quality control, reliability, software development, human factors engineering,\nmedical support (health hazard assessments), and any others\n\nb) The interface between system safety and all system integration and test disciplines\n\nE.2 Preliminary hazard analysis (PHA)\n\nE.2.1 Purpose\n\nThe PHA shall identify safety-critical areas, provide an initial assessment of hazards, and identify requisite\nhazard controls and follow-on actions.\n\nE.2.2 Description\n\nA PHA shall be performed and documented to obtain an initial risk assessment of a concept or system. Based\non the best available data, including mishap data (if assessable) from similar systems and other les- sons\nlearned, hazards associated with the proposed design or function shall be evaluated for hazard severity, hazard\nprobability, and operational constraint. Safety provisions and alternatives needed to eliminate hazards or\nreduce their associated risk to a level acceptable to the authority having jurisdiction shall be included. The\nPHA shall consider the following for identification and evaluation of hazards, as a minimum:\n\na) Hazardous components (e.g., fuels, propellants, lasers, toxic substances, hazardous construction\nmaterials, pressure systems, and other energy sources).\n\nb) Safety-related interface considerations among various elements of the system (e.g., material\ncompatibilities, electromagnetic interference, inadvertent activation, fire/explosive initiation and\npropagation, and hardware and software controls). This shall include consideration of the potential\ncontribution by software (including software developed by other contractors/sources) to subsystem/\nsystem mishaps. Safety design criteria to control safety-critical software commands and responses\n(e.g., inadvertent command, failure to command, untimely command or responses, inappropriate\nmagnitude, or other designated undesired events) shall be identified and appropriate action taken to\nincorporate them in the software (and related hardwarc) specifications.\n\nc) Environmental constraints, including the operating environments (e.g., drop, shock, vibration,\nextreme temperatures, noise, exposure to toxic substances, health hazards, fire, electrostatic discharge,\nlightning, electromagnetic environmental effects).\n\nd) Operating, test, maintenance, built-in-tests, diagnostics, and emergency procedures (e.g., human\nfactors engineering, human error analysis of operator functions, tasks, and requirements; effect of\nfactors, such as equipment layout, lighting requirements, potential exposures to toxic materials;\neffects of noise or radiation on human performance). Those test-unique hazards that will be a direct\nresult of the test and evaluation of the article or vehicle.\n\ne) Facilities, real property installed equipment, support equipment (e.g., provisions for storage, assembly,\ncheckout, proof/testing ofhazardous systems/assemblies that may involve toxic, flammable, explosive,\ncorrosive, or cryogenic materials/wastes; radiation or noise emitters; electrical power sources), and\ntraining (c.g., training and certification pertaining to safety operations and maintenance).\n\nf) Safety-related equipment, safeguards, and possible alternate approaches (e.g., interlocks; system\nredundancy; fail-safe design considerations using hardware or software controls; subsystem\nprotection; fire detection and suppression systems; personal protective equipment; heating, ventilation,\nand air-conditioning; and noise or radiation barriers).\n\n51\nCopyright © 2025 IEEE. All rights reserved.",
      "source_file": "IEEE Std 1474.1-2025 IEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 53,
      "text": "IEEE Std 1474.1TM-2025\nIEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements\n\ng) Malfunctions to the system, subsystems, or software. Each malfunction shall be specified, the causing\nand resulting sequence of events determined, the degree of hazard determined, and appropriate\nspecification and /or design changes developed.\n\nE.3 Subsystem hazard analysis (SSHA)\n\nE.3.1 Purpose\n\nThe subsystem hazard analysis (SSHA) shall verify subsystem compliance with safety requirements\ncontained in subsystem specifications and other applicable documents; identify previously unidentified\nhazards associated with the design of subsystems, including component failure modes, critical human error\ninputs, and hazards resulting from functional relationships between components and equipment comprising\neach subsystem; recommend actions necessary to eliminate identified hazards or control their associated risk\nto acceptable levels.\n\nE.3.2 Description\n\nAn SSHA shall be performed and documented to identify all components and equipment that could result in a\nhazard or whose design does not satisfy safety requirements. Areas to consider are performance, performance\ndegradation, functional failures, timing errors, design errors or defects, or inadvertent functioning. The human\nshall be considered a component within a subsystem, receiving both inputs and initiating outputs, during the\nconduct of this analysis.\n\nThe analysis shall include a determination of the following:\n\na) The modes of failure, including reasonable human errors as well as single-point and common- mode\nfailures, and the effects on safety when failures occur in subsystem components.\n\nb) Potential contribution of hardware and software (including that which is developed by other\ncontractors/sources) events, faults, and occurrences (such as improper timing) on the safety of the\nsubsystem.\n\nc) That the safety design criteria in the hardware, software, and facilities specification(s) have been\nsatisficd.\n\nd) That the method of implementation of hardware, software, and facilities design requirements and\ncorrective actions has not impaired or decreased the safety of the subsystem nor has it introduced any\nnew hazards or risks.\n\ne) Of the implementation of safety design requirements from top level specifications to detailed design\nspecifications for the subsystem. The implementation of safety design requirements developed as part\nof the PHA shall be analyzed to ensure that it satisfies the intent of the requirements.\n\nf) Of test plan and procedure recommendations to integrated safety testing into the hardware and\nsoftware test programs.\n\ng) That system level hazards attributed to the subsystem are analyzed and that adequate control of the\npotential hazard is implemented in the design.\n\nWhen software to be used in conjunction with the subsystem is being developed, the contractor performing the\nSSHA shall monitor, obtain, and use the output of each phase of the formal software development process in\nevaluating the software contribution to the SSHA.\nThe SSHA shall be updated as a result of any system design changes, including software design changes, that\naffect system safety.\n52\nCopyright © 2025 IEEE. All rights reserved.",
      "source_file": "IEEE Std 1474.1-2025 IEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 54,
      "text": "IEEE Std 1474.1TM-2025\nIEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements\nE.4 System hazard analysis (SHA)\nE.4.1 Purpose\nThe system hazard analysis (SHA) shall include the following:\na) Verify system compliance with safety requirements contained in system specifications and other\napplicable documents.\nb) Identify previously unidentified hazards associated with the subsystem interfaces and system\nfunctional faults.\nc) Assess the risk associated with the total system design, including software, and specifically of the\nsubsystem interfaces.\nd) Recommend actions necessary to climinate identified hazards and/or control their associated risk to\nacceptable levels.\nE.4.2 Description\nAn SHA shall be performed and documented to identify hazards and assess the risk of the total system design,\nincluding software, and specifically of the subsystem interfaces.\nThis analysis shall include a review of subsystem interrelationships for the following:\na) Compliance with specified safety design criteria\nb) Possible independent, dependent, and simultaneous hazardous events including systems failures;\nfailures of safety devices; common cause failures and events; and system interactions that could create\n\na hazard or result in an increase in mishap risk\n\nc) Degradation in the safety of a subsystem or the total system from normal operation of another\nsubsystem\n\nd) Design changes that affect subsystems\n\ne) Effects of reasonable human errors\n\nf) | Determination of the following:\n\n1) Potential contribution of hardware and software (including that which is developed by other\ncontractors/sources, or commercial off-the-shelf hardware or software) events, faults, and\noccurrences (such as improper timing) on safety of the system\n\n2) That the safety design criteria in the hardware, software, and facilities specification(s) have been\nsatisfied\n\n3) That the method of implementation of the hardware, software, and facilities design requirements\nand corrective actions has not impaired or degraded the safety of the system nor has it introduced\nany new hazards\n\nThe SHA may be combined with and/or performed using similar techniques to those used for the SSHA.\nWhen software to be used in conjunction with the system is being developed, the contractor performing the\nSHA shall monitor, obtain, and use the output of each phase of the formal software development process in\nevaluating the software contribution to the SHA.\nThe SHA shall be updated as a result of any system design changes including software design changes that\naffect system safety.\n53\nCopyright © 2025 IEEE. All rights reserved.",
      "source_file": "IEEE Std 1474.1-2025 IEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 55,
      "text": "IEEE Std 1474.1TM-2025\nIEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements\nE.5 Operating and support hazard analysis (O&SHA)\nE.5.1 Purpose\nThe operating and support hazard analysis (O&SHA) shall evaluate activities for hazards or risks introduced\ninto the system by operational and support procedures and evaluate adequacy of operational and support\nprocedures used to climinate, control, or abate identified hazards or risks.\nE.5.2 Description\nAn O&SHA shall be performed and documented to examine procedurally controlled activities. The O&SHA\nidentifies and evaluates hazards resulting from the following:\n— The implementation of operations or tasks performed by persons, considering the planned system\nconfiguration/state at each phase of activity\n— The facility interfaces; the planned environments (or ranges thereof)\n— The supporting tools or other equipment, including software controlled automatic test equipment,\nspecified for use; opcrational/task sequence, concurrent task effects and limitations\n— The potential for unplanned events, including hazards introduced by human errors\nThe human shall be considered an element of the total system, receiving both inputs and initiating outputs\nduring the conduct of this analysis. The O& SHA shall identify the safety requirements (or alternatives) needed\nto eliminate or control identified hazards or to reduce the associated risk to a level that is acceptable under\ncither regulatory or contractually specified criteria.\nThe analysis shall identify the following:\na) Activities that occur under hazardous conditions, their time periods, and the actions required to\nmitigate risk during these activities/time periods\nb) Changes needed in functional or design requirements for system hardware/software, facilities, tooling,\nor support/test equipment to eliminate or control hazards or reduce associated risks\nc) Requirements for safety devices and equipment, including personnel safety and life support equipment\nd) Warnings, cautions, and special emergency procedures, including those necessitated by failure of a\ncomputer software-controlled operation, to produce the expected and required safe result or indication\ne) Requirements for packaging, handling, storage, transportation, maintenance, and disposal of\nhazardous materials\nf) Requirements for safety training and personnel certification\ng) Effects ofnondevelopmental hardware and software across the interface with other system components\nor subsystems\nh) Potentially hazardous system states under operator control\nThe O&SHA shall document system safety assessment of procedures involved in system production,\ndeployment, installation, assembly, test, operation, maintenance, servicing, transportation, storage,\nmodification, and disposal.\nThe contractor shall update the O&SHA as a result of any system design or operational changes.\n54\nCopyright © 2025 IEEE. All rights reserved.",
      "source_file": "IEEE Std 1474.1-2025 IEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 56,
      "text": "IEEE Std 1474.1TM-2025\nIEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements\n\nE.6 Risk assessment\nThe hazard resolution process shall be initiated by defining the physical and functional characteristics of the\nsystem to be analyzed. These characteristics shall be presented in terms of the major elements that make up the\nsystem and its environment, including equipment, facilities, procedures, and people.\nThe hazards shall be identified. The techniques and methods used to identify the hazards shall include the\nfollowing:\n\n— Data from previous accidents or operating experience\n\n— Expert opinion and hazard scenarios\n\n— Checklists of potential hazards\n\n— Previous hazard analyses\n\n— Other analysis techniques as appropriate\nAll identified hazards shall be assessed in terms of the severity or consequence of the hazard and the probability\nof occurrence.\nRisk assessment estimates (see Table E. 1) shall be used as the basis in the decision-making process to determine\nwhether individual system or subsystem hazards shall be eliminated, mitigated, or accepted. Hazards shall be\nresolved through a design process that emphasizes the elimination of the hazard. Resolution strategies or\ncountermeasures to be employed, listed in order of preference, shall be the following:\n\na) Design to eliminate hazards\n\nb) Design to control hazards\n\nc) Use safety devices\n\nd) Use warning devices\n\ne) Implement special procedures\n\nf) Accept the hazard\n\ng) Eliminate the subsystem/equipment/requirement\nThis process shall include full documentation of the hazard resolution activities. The effectiveness of the\ncountermeasures shall be monitored to determine that no new hazards are introduced. In addition, whenever\nsubstantive changes are made to the system, analyses shall be conducted to identify and resolve any new\nhazards.\nTable E.1 provides an example of the relationship between risk, severity, and probability as it may be applied\nwhen assessing CBTC systems. The authority having jurisdiction may choose to modify this table to reflect\nexisting procedures or requirements.\n\n55\nCopyright © 2025 IEEE. All rights reserved.",
      "source_file": "IEEE Std 1474.1-2025 IEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 57,
      "text": "IEEE Std 1474.1TM-2025\nIEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements\nTable E.1—Risk assessment\nTue |\nFrequency of 1-Catastrophic 3-Marginal 4-Negligible\noccurrence\nUnacceptable (1A) Unacceptable (2A) Unacceptable (3A) Undesirable (4A)\n, Acceptable with\nB-Probable Unacceptable (1B) Unacceptable (2B) Undesirable (3B) review (4B)\n, Acceptable with Acceptable with\nUnacceptable (1C) Unacceptable (2C) review (3C) review (4C)\nAcceptable with Acceptable without\nUnacceptable (1D) Unacceptable (2D) review (3D) review (4D)\n. . Acceptable without Acceptable without\nE-Improbable Undesirable (1E) Undesirable (2E) review (3E) review (4E)\nResidual risk levels\nUnacceptable (1 A/B/C/D, 2A/B/C/D, and 3A)\nCBTC systems with residual risks rated at this level are considered unacceptable; hazards shall be mitigated\nthrough fail-safe designs.\nUndesirable (1E, 2E, 3B, and 4A)\nCBTC systems with residual risks rated at this level are considered undesirable; depending on economic and\nfunctional requirements, CBTC systems with hazards rated at this risk level may be considered acceptable\nwith explicit agreement from the authority having jurisdiction.\nAcceptable with review (3C/D and 4B/C)\nCBTC systems with residual risks rated at this level are considered acceptable with review; depending on\neconomic and functional requirements, CBTC systems with hazards rated at this risk level may be considered\nacceptable with notification to the authority having jurisdiction.\nAcceptable without review (3E and 4D/E)\nCBTC systems with residual risks rated at this level are considered acceptable without review; additional\ndesign effort or system revision is not required to reduce the severity or probability of hazards with this risk\nlevel.\nFrequency of occurrence\n| A—Frequent | = | Likely to occur frequently; MTBHE is less than 1000 operating hours.\nB—Probable Will occur several times in the life of an item; MTBHE is equal to or greater\nthan 1000 operating hours and less than 100 000 operating hours.\nC—Occasional Likely to occur sometime in the life of an item; MTBHE is equal to or greater\nthan 100 000 operating hours and less than 10 000 000 operating hours.\nD—Remote Unlikely, but possible to occur in the life of an item; MTBHE is equal to or greater\nthan 10 000 000 operating hours and less than 1 000 000 000 operating hours.\nE—Improbable So unlikely, it can be assumed occurrence may not be experienced;\nP MTBHE is equal to or greater than 1 000 000 000 operating hours.\n56\nCopyright © 2025 IEEE. All rights reserved.",
      "source_file": "IEEE Std 1474.1-2025 IEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 58,
      "text": "IEEE Std 1474.1TM-2025\nIEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements\nHazard Severity\n1—Catastrophic f= | Fatality, system loss, or severe environmental damage.\n| -2-Critical | = | Severe injury, severe occupational illness, major system or environmental damage.\n3一Marginal = Major injury, minor occupational illness, or minor system or environmental damage.\n4—Negligible Less than minor injury, occupational illness, or less than\nminor system or environmental damage.\n57\nCopyright © 2025 IEEE. All rights reserved.",
      "source_file": "IEEE Std 1474.1-2025 IEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 59,
      "text": "IEEE Std 1474.1TM-2025\n\nIEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements\nAnnex F\n(informative)\nTypical approaches to specifying CBTC system availability\nF.1 Traditional equipment-based approach\nThe traditional approach to defining system availability is the probability that the system is capable of\noperating and performing its intended function at arandom point in time, as determined by the system MTBFF\nand MTTRS, as shown in Equation (F.1):\n\nCBTC system availability =system MTBFF/(system MTBFF + system MTTRS) (F.1)\nwhere system MTTRS is the sum of the system MTTR and the mean travel times for maintenance personnel to\ntravel to the site of a failure and meantime to detect failure.\n\nWith this approach, the authority having jurisdiction would typically specify the following:\n\na) The quantitative CBTC system availability requirements\n\nb) The average travel times to be assumed for maintenance personnel to travel to the site of a failure\n\nc) The boundaries of the CBTC system covered by the availability requirement\n\nd) Thetype of CBTC failures to be included in defining the system MTBFF\nFor a given CBTC system configuration, the predicted CBTC system availability could be determined\nanalytically from estimates of subsystem MTBFFs and MTTRs.\n\nActual CBTC system availability could be determined from measurements of actual in-service system MTBFF\nand MTTRS, with appropriate adjustments for factors that are not included within the specified boundaries of\nthe CBTC system.\nF.2 Alternative delayed trip-based approach\nAn alternative approach is to define CBTC system availability in terms of the system’s contributions to the\ndesired on-time performance of the transit system, as shown in Equation (F.2):\noo xX w, Revenue trips delayed more than 上 by CBTC Type failure\nCBTC system availability = 1 -一一一一一一一一一一一一一一一一一一一 (F,.2)\nTotal scheduled revenue trips\nwhere\nRevenue trip is a scheduled movement ofa train, of defined length, from a point of origin toa\ndestination,\n\nty is a defined delay threshold,\n\nw, is a Weighting factor associated with that delay threshold\nWith this approach, CBTC system availability would take into account the delays experienced by passengers.\nAs the passenger judges transit system availability on the basis of the wait and travel time variations of the\nservice provided, CBTC system failures that result in longer delays are penalized with a greater weighting\nfactor than failures that result in shorter delays. In general, delay thresholds would be related to the operating\nheadways, as delays at shorter headways impact on-time performance more significantly.\n\n58\nCopyright © 2025 IEEE. All rights reserved.",
      "source_file": "IEEE Std 1474.1-2025 IEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 60,
      "text": "IEEE Std 1474.1TM-2025\nIEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements\n\nThe CBTC system availability requirement may also consider other failure types, to the extent that such failures\nimpact fleet availability. For example, even if a train-borne CBTC equipment failure does not immediately\nimpact the on-time performance of the transit system, it may subsequently result in missed revenue trips if the\nfailure repair time results in the train being unavailable for service.\nWith this approach, the authority having jurisdiction would typically specify the following:\n\na) The quantitative CBTC system availability requirements\n\nb) The various delay thresholds and weighting factors\n\nc) The average travel times to be assumed for maintenance personnel to travel to the site of a failure\n\nd) The boundaries of the CBTC system covered by the availability requirements\n\ne) Thetype of CBTC failures to be included in defining the system availability\nFor a given CBTC system configuration, the predicted CBTC system availability could be determined through\ncomputer modeling from estimates of subsystem MTBFFs and MTTRs, and an assumed system operating\nplan.\n\nActual CBTC system availability could be determined from measurements of actual in-service delays, with\nappropriate adjustments for factors that are not included within the specified boundaries of the CBTC system.\n59\nCopyright © 2025 IEEE. All rights reserved.",
      "source_file": "IEEE Std 1474.1-2025 IEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 61,
      "text": "STANDARDS\nASSOCIATION\nee —\nee\nConnect with us on:\n€ Facebook: facebook.com/ieeesa\nin LinkedIn: linkedin.com/groups/1791118\n日 Beyond Standards blog: beyondstandards.ieee.org\n(>) YouTube: youtube.com/ieeesa\nstandards.ieee.org\nPhone: +1 732 981 0060",
      "source_file": "IEEE Std 1474.1-2025 IEEE Standard for Communications-Based Train Control (CBTC) Performance and Functional Requirements.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    }
  ]
}