{
  "doc_id": "bd708ddf-2799-4411-8ef7-170221d50867",
  "pages": [
    {
      "page_number": 1,
      "text": ". TM Francis How - )\noo See page 36 for references to all the\nBack to basics articles published so far.\nIn this article in our “Back to basics” Saar oe ah Wf Bo. <\nseries we look at lineside railway ee Cee ,| S\nsignals. Signals are referred to Foo eel. * = Brg BN. | | E\nfrequently in other \"Back to basics\" i DR rie a, nl nn 3\narticles, but without exploring the 7 f a My Lye a: 17h ¥ = ee , a S\nsubject in detail. ON A NOE Br. ; E\nMovement authorities Dole. f ot) le thee 7 A Ae\nTrains and train drivers need to be bet 4 pn rn ee “>. < 有\nprovided with information telling them “. 5° J F at AMET rer a5) 7 t\nwhen to move, and where and when to 7 /. : =f f fo fp a 了 AN \\\nstop. The generic term for information a. 4 RH -1 . 2 aa \\\nthat permits a train to move onto a s Si euch ee - _ da i \\\nan ic! “aa! ignals such as these in Germany are an essentia er NS \\!\nin how they operate, almost all rely eee: || >| i oN > a 5 Peon 有\non one of three means by which\nmovement authority Information Is Lineside signals (also called wayside of the topic, which includes systems\ngiven to the train: ; . - , .\nsignals), which comprise arrangements such as Communications- Based Train\nVerbal instructions given to the train of visual symbols (coloured lights, Control (CBTC), the European Train\ndriver to proceed to a designated mechanical devices, signs) positioned Control System (ETCS) and Positive Train\nlocation on the line ahead. The at pre-determined locations at the Control (PTC), is well beyond the scope\ninstruction is usually issued via a train trackside for the driver to see and of this article.\nradio system by a person in the control react to in the required manner. In the . ,\n, , . . oo ; So, we are talking mostly about lineside\n(dispatching) centre or similar location, early days of railways lineside signals , , .\n. colour light signals, the information they\nSuch as a Signal box. These types of were mainly mechanically operated ,\n, convey, and how to ensure that train\nsystems are often used on low-capacity semaphores, and although many ; .\n. , , . - , drivers can see the signals and respond\nlines (sometimes referred to as ‘dark examples of such signalling can still be ,\n, , , , to them appropriately. However, we\nterritory’) where a costly signalling found around the world, all modern ;\n, are not going to explore all the types\nsystem cannot be justified. For more systems use colour light signals, which , ,\n- a . of signals used in different parts of the\ninformation about these Systems and superficially look like road traffic ,\n, . - . . world — a whole book could be written\ntheir more modern equivalents, you lights/signals. This article focuses ;\noy, , er . about that! Nor are we discussing the\nshould read Robert Baird s Back to basics | predominantly on lineside signals. , , -\n. . decision-making technology which\narticle on Low-Cost Electronic Authority , , , ;\n, Cab signalling, where the movement enables a signal to display movement\nSystems in issue 282 of IRSE News et See a: ; ,\n(November 2021) irse.info/irsenews282 authority information is displayed in the authority information to a driver. That\n; driving cab, rather than at the lineside. topic is covered in two Back to basics\nRailways also use verbal instructions to We will briefly consider cab signalling to articles about Interlocking — see issues\ndrivers when the normal lineside or cab understand how the provision of in-cab 265 and 266 of IRSE News (April and\nsignalling system has failed. information compares with lineside May 2020) irse.info/irsenews265 and\nsignals. However, a full exploration irse.info/irsenews266\n8",
      "source_file": "28_signals.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 2,
      "text": "IRSE News | Issue 304 | November 2023\nFigure 1 — Examples of lineside signals in Switzerland (left), the UK (centre) and Germany (right).\n‘ . 4% t..> <i Eu 。 \"a a\n| ws AN sie ® cols ‘ost\nA ST Ss Pe 一 SE 2 — > * Ye\n.- ig F i \" . Nie 四 : 1 % y bb atk A - . :\nta tg a att 区 i * . 和 3 |\n1 _ aire AN\n> CP , oes ———— 2 By a cee 公 my ; 4\n一 a— pee 8 all oe ap. ome 2 : Z* a ° 1 — I y\nWhy do railways need signals? To maintain safety in this very different it will display a proceed indication only\nWhen you drive a road vehicle, you are operational environment, railway tracks when the block section is set and locked\n‘driving on sight’. You are responsible are divided into ‘block’ sections, and for the train, with no other conflicting\nfor observing the road ahead and other normally only one train is allowed to be train movements. The driver can then\nnearby traffic and making decisions in each block section at any one time. A move the train through the block section\naccordingly. You choose which route block section may be quite long (several | to the signal that marks the start of the\nto take at junctions maintain a safe kilometres), or very short (a couple of next section. If everything is working to\ndistance from any vehicle you can hundred metres or less, particularly on plan (the timetable), train drivers should\nsee ahead of you, and you slow down metros). Each block section may be only infrequently encounter signals\nwhen you see the need to do so. If you plain line, or it may have points in the displaying ‘stop’, thereby minimising\ncan see that a collision may be about route; and in some cases trains may journey times and making maximum use\nto occur, you can try to take avoiding be permitted to travel through it in of the line capacity.\n1 1 ither direction. . .\naction by emergency braking and by either directio Because a train takes a considerable\nsteering the vehicle. Although traffic The driver of a train at the start of a distance to stop, a signal displaying\nlights (road signals) are provided at some | block section may not be able to see ‘stop’ may not be visible to the driver at\nroad junctions, most have no signals and | all the track that comprises the section the location where they need to start\nsafety is dependent solely on all drivers ahead. They cannot be sure whether slowing down. To ensure the driver is\ncomplying with a set of rules. points in the block section are set and given adequate advance information and\nRailways are quite unlike roads. It is locked correctly, nor know with certainty | can brake appropriately, one or more\nnot possible to steer a train; it will go the movements of other trains already ‘distant’ signals (also sometimes called\nwherever the rails and points (switches) in (or approaching) the same block ‘approach’ signals) are provided on the\ntake it. A train cannot be stopped section. Because the driver cannot know | approach to each signal that can display\nquickly; a passenger train travelling at if it is safe to proceed, a ‘block’ signal a stop indication.\n200km/h will have a typical braking Berens parr cach Block | The distance from the first of these\ndistance of over 2.5km. So, except Ana onchin train must stop at the signals to the stop signal will be the\nfor very low speed railways such as Si nal unless t dls lays an indication to longest braking distance (under normal\ntramways, driving a train is not a ‘drive ec The si a a erated from the adhesion conditions) of all the trains\non sight’ operation. P 3 , that are authorised to use the line, plus a\ncontrol centre via an interlocking, and\n>>>\nFigure 2 — Block signals displaying ‘proceed’ (11) and ‘stop’ (13), with associated\ndistant signals displaying ‘proceed’ (D11) and ‘prepare to stop’ (D13) indications.\nWith acknowledgements to Jorn Pachi.\nBlock section\nProceed Proceed Caution, prepare to Stop i\nstop at next signal Train\nD11 +O 11 KO D13上人) 13K-0\nDistant signal Block signal Distant signal Block signal\nBraking distance Braking distance\n9",
      "source_file": "28_signals.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 3,
      "text": "IRSE News | Issue 304 | November 2023\nmargin for safety. If a signal is displaying Signal engineers, railway operators Most of the world’s lineside signalled\nstop, the preceding distant signal(s) will and train drivers use the word ‘aspect’ railways use ‘speed signalling systems’,\ndisplay appropriate ‘caution’ information in association with signals, by which whereby the signals tell a driver how fast\nto warn the driver of the need to slow we mean all the information that is to proceed on the approach to diverging\ndown and be prepared to stop at a signal | presented by a signal to the driver ata junctions and, in some systems, when\nfurther ahead. If a signal is displaying particular time, such as stop, proceed, approaching a signal showing a stop\n‘proceed’ (rather than stop) then the and ‘caution, prepare to stop at a signal aspect. However, there is generally little\npreceding distant signal(s) will display further ahead’. or no information provided about which\ninformation to tell the driver that there , , route is set for the train at a junction.\n, The aspects displayed by successive\nis no need to slow down. These two , - ,\n, oo, signals that a driver encounters is called By way of an example, the Dutch speed\nscenarios are shown in Figure 2. , , , ar\nan ‘aspect sequence’. signalling system, which is based on\n\nOn routes where the traffic density is _. . . . USA practices, uses three basic aspects\nhigher, every signal may be capable of How driving information Is (red, yellow and green), supplemented\ndisplaying ‘proceed’, ‘caution, prepare to | conveyed by lineside signals where required by illuminated numeric\nstop at next signal ahead’ and ‘stop’, and | In accordance with international indicators which tell the driver of a\na block section is simply the portion of technical standard UIC 732, most speed limit ahead; for instance, ‘8’ to\ntrack between one signal and the next, railways use the colour red for signals indicate a maximum speed of 80km/h\nequal in length to the braking distance displaying a stop aspect (sometimes — see Figure 6.\n(plus a margin). This is shown in Figure 3. called a ‘danger’ aspect); green for . Some other speed systems use\nOn very busy railways, the block sections | Proceed’ (often called a ‘clear’ aspect); combinations of colour lights to indicate\nmay be made shorter than full braking and yellow for caution (sometimes speed limits, rather than displaying\ndistance to further improve capacity called an ‘approach’ aspect). See Figure 5 a number. For instance, the Italian\n(by reducing the headway). In such for an example of an aspect sequence national railway uses two lights displayed\ncases, more than one preceding signal using these colours. vertically (yellow over green) to warn the\nwill display a ‘caution’ indication on A signal may also provide additional driver of the speed limit over a Junction\nthe approach to a signal displaying information for the driver, most ahead that is set for the diverging route.\nstop, with full braking distance from importantly for diverging junctions In the example shown in Figure 7, the\nthe first of these signals to the stop where the train needs to slow down yellow/green aspect tells the driver\nsignal — see Figure 4 for an example. to traverse the points safely. There that the junction ahead is set and must\nThe aspects of the signals at caution are basically two different ways in be traversed at a speed not exceeding\n(9 and 11) are usually different from each | which this is done. 30km/h. For higher speed turnouts\nother, to avoid misleading the driver as (60km/h and 100km/h), flashing yellow\nto which signal ahead is displaying a over green lights are used.\nstop indication.\nFigure 3 — Signal sequence with all signals capable of displaying ‘proceed’, ‘prepare to stop’ and ‘stop’ indications.\nWith acknowledgements to Jorn Pachi.\n\nBlock section Block section\n\nCaution, prepare to\nProceed stop at next signal Stop Train\n9 FFO 11FO 13-0\nBraking distance Braking distance\nFigure 4 — Signal sequence with ‘prepare to stop two signals ahead’.\nWith acknowledgements to Jorn Pachi.\nBlock section Block section Block section\nCaution, prepare to Caution, prepare\nProceed stop two signals ahead to stop at next signal Stop Train\n7HO 9LO 1 KO 13HO\nBraking distance\n\nBraking distance\n\n10",
      "source_file": "28_signals.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 4,
      "text": "IRSE News | Issue 304 | November 2023\nFigure 5 — A typical sequence of successive signals corresponding to Figure 6 — An example of a Netherlands railway signal,\nFigure 3, displaying ‘proceed’, ‘caution, prepare to stop at next signal instructing the driver to reduce speed to 80km/h before\nahead’ and ‘stop’ (green, yellow and red respectively). reaching the next signal ahead.\nSignal 13\nBraking distance\n; Signal 11\nBraking distance\nSignal 9\nFigure 7 — An example of Italian speed signalling, where the diverging route is set and must be traversed at no\nmore than 30km/h. The red over green (proceed) aspect displayed by the junction signal confirms to the driver\nthat the diverging route is set and that the next signal ahead is also displaying a proceed aspect.\n| re | ee A 30km/h | @@\nAlthough speed signalling predominates, | railway, which could result in derailment, | few (notably the USA and Australia) use\nsome countries (including Britain and ‘approach release’ (also known as route signalling on some railways and\nother countries that have systems based | ‘approach control’) of junction signals speed signalling on others. Wikipedia\non British practice) use an alternative is employed. This typically involves provides a useful summary of the signal\ncalled ‘route signalling’. Information is holding the junction signal at ‘stop’ with aspects used in various Australian states.\nprovided at signals that protect diverging | the preceding signal(s) displaying the irse.info/idkn9\njunctions to tell the driver which route is | corresponding caution aspect(s) until , , , ,\n。 ,, , 。 Fixed lineside speed reminder signs may\nset for the train. The driver is expected to | the train has slowed and the driver can ,\n, 。 , . be provided with both route and speed\nknow the prevailing speed for the route clearly see the junction signal ahead, , , ,\n. 。 . . systems. This is arguably more important\nset, and when to start braking to traverse | at which point the interlocking allows ; ; ;\n. . . . , with route signalling than speed\nthe junction safely. The signals provide the signal to display the appropriate ; a\n, ; signalling, although it in no way replaces\nno information about speed limits aspect and route indication for the train\n, , , . or lessens the need for route knowledge.\nover junctions. to proceed over the junction. At some\nThe route information may take the form high-speed junctions in Britain the The IRSE s textbook European Railway\n, , naa , junction signal may initially be held at Signalling” provides information about\nof a junction indicator (a ‘bar’ of white , are ; ; . .\n, . caution’ (single yellow) with the junction | the many different systems of signal\nlights set at an angle corresponding to , , .\nindicator displayed, and the preceding aspects used by European railway\nthe route set, usually mounted above ; ; . ,\nao , signal(s) display flashing yellow aspects administrations. It illustrates well\nthe main signal, see the centre photo in ,\n; ; , , to warn of the need to slow down for Just how much they vary from one\nFigure 1); or an illuminated alphanumeric ;\n. the diverging route. country to another.\ncharacter may be displayed above or\nalongside the main signal to indicate the | Although signalling systems can be The driver's perspective\nroute set; or, less commonly, a pair of classified broadly as ‘route’ or ‘speed’ . . . ,\n。 , , , , Having considered the information\nsignals may be provided alongside each in type, some speed signalling systems . , .\n. provided by lineside signals to drive a\nother, one for the straight route and one | include some features of route ;\n, . , train safely, we will now think about how\nfor the diverging route. The one for the signalling, and to a limited extent vice-\n; . . to ensure that each signal displays the\nroute set displays the appropriate aspect | versa. For example, the Italian speed , ”| 。\n: oor information in a manner that drivers can\nto allow the train to proceed over the system referred to earlier includes both ,\n. . . . , , , assimilate and use.\njunction, while the other remains at red. speed and (limited) route information in\n; ; the signal ts on th roach t tice for signal visibility i\nTo reduce the risk of a driver e signal aspects on the approach to Good practice for signa visibi ity is\n. , - , a diverging junction. Furthermore, not based on the needs of the driver. On\ninadvertently traversing a diverging , . .\n, , , only do some countries have more than approaching a signal, a driver has\njunction too fast on a route-signalled ; ,\none type of speed or route signalling, a >>>\n11",
      "source_file": "28_signals.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 5,
      "text": "IRSE News | Issue 304 | November 2023\nThe knowledge and information required for train driving\nTrain drivers need a wide range of information to do their ¢ Driving rules for driving the train safely under normal\njob, of which signals are only one part. The information and operational conditions, in degraded modes and in\nknowledge they require includes: emergency situations; and for activities such as those\n, , , associated with arrival/departure from stations (passenger\n¢ Route and infrastructure information (commonly known ; , , ; ; ;\n, ro , trains) and loading/unloading operations (freight trains).\nas ‘route knowledge’), including the locations (and 网 |\nlayouts) of junctions, stations, lineside signals, permitted * Movement authorities. The driver must know the\nspeeds and gradients. This information is relatively meaning of the information displayed by lineside\nstatic, with occasional changes when the infrastructure signals (or the in-cab display), and how to respond to\nmanager alters track layouts and signalling. that information.\n。 Rolling stock information, including the train's maximum ”In the case of a metro, the operation of all the trains using\nspeed, braking capability and length. This information any one line is more or less identical and driving is a relatively\nis particular to each type of train, and some of it (such straightforward task, particularly if the trains are fitted with\nas length and braking capability), may be particular to automatic train protection and operation (ATP, ATO). At the\neach individual train trip — particularly in the case of other extreme, the manual driving of long and heavy freight\nfreight trains. trains, where each one may have different characteristics, is\n¢ Timetable information, telling the driver about planned much more complex.\ndeparture, passing and arrival times at specific locations.\nfirstly to read the signal (observe the Interpreting a signal requires that: When the driver has read and interpreted\ninformation displayed), then interpret the . . a Signal they then decide on what action\n; 1. The aspect displayed is one of an ;\naspect (understand what it means), and . to take, making use of their knowledge\n, , , established set of aspects applicable ,\nthen drive the train accordingly. ; ; ; of the rolling stock, the route ahead and\nto the railway, with a clearly defined ; ;\n, , , ; , , the applicable operational rules.\nReading a signal requires that: meaning for drivers.\n1. It is clearly applicable to the driver 2 The information conveyed by the Driveability of the signal requires that:\nof an approaching train, and readily aspect is unambiguous, so that the 1. The aspect forms part of a logical\ndistinguishable from any other signals driver is not placed in a position of aspect sequence encountered by the\nin the vicinity (for instance, other uncertainty as to what action to take; driver, except of course in emergency\nadjacent signals, and signals further nor be ‘conditioned’ by previous or failure conditions, for instance if\nahead on the line). driving experience to expect to take a signal reverts to red to stop a train\n2. All the illuminated lights that a particular course of action, only to because of an unexpected unsafe\n| 1 find on rare occasions that a different condition ahead\ncomprise the aspect displayed are a , :\n, , action is required even though the .\nClearly visible for a sufficient length aspect displayed is the same 2.Where the aspect requires the\nof time for the driver to observe P Pe 7 driver to reduce speed, it must be\nthe aspect, taking into account the 3. The aspect is not corrupted (all possible to meet the speed reduction\nhighest attainable or permissible relevant lights illuminated, and no requirement by means of normal\napproach speed. others), to avoid the driver either (service) braking, taking into account\n3. It is visible under all conditions not understanding the information factors such as the maximum\nand at all times of day and night, presented or interpreting it as having attainable/permissible speed on the\nincluding those where sunlight or ° heen ailing «> 9 that intended approach to the signal, rolling stock\nnearby artificial lighting might make ymne signaling system. performance and braking capability,\nreadability difficult. gradients and distance to next signal.\nFigure 8 — A lineside signal in Japan, indicating a route set to the right at a diverging junction.\nJapan predominantly uses speed signalling, but with route signalling at junctions.\n“ : . . wa a S Lo . ~ 、 . _ / 7 a . > _ 9 ad th\nam | ¥. * a | we Yen tk — fe\n} ‘ 4 < on * eed ~<a ; oe \\ ey , - i\neee ST Zee ae Ae ee\n- 7 cimore Saree 加 - 3 二 a eel\n12",
      "source_file": "28_signals.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 6,
      "text": "IRSE News | Issue 304 | November 2023\nFigure 9 - Signal structures in the USA, with signals on a cantilever structure above the main running lines.\nTo the right is a signal on a post for trains exiting the loop line.\n— er GE Te:\nSaree a. 1 ‘ ' , : stg ‘Ta Fee ret . “4 my ae: % ‘ ia bed :7\n. ce . 1 , an ' jo ‘9 ‘ Jé GY\nbe ~~ tee ”一一 . 一 ST ae . = a a Ne y we a a ae\nr . om) . - XN. Nu \\ wi . . _ - , ape wot , . Le . 2\na ae - re c. 8\n四 No tre A ee ye wae . ye\n-. is ee Fee ee : — 7\n3. The information displayed is of fairly 。 Viaducts and tunnels, where it is on the approach) and it is not possible\nimmediate relevance to the driver. inadvisable to place signals unless to place the signal in a better location,\nDisplaying information well before unavoidable because of the risks repeater signals are sometimes used,\nthe driver needs to act on it could associated with evacuating a train located a short distance before the main\nrisk them forgetting it by the time it in an emergency. signal. As their name implies, they repeat\nbecomes relevant. 。 Nearby artificial lighting (on stations, | Some or all of the information displayed\nTwo important corollaries to these buildings and roads) which could by the main signal to give the driver an\nrequirements are firstly that drivers must impair the clarity with which extended time to read and interpret\nmeet the relevant eyesight (colour vision signals can be seen. the aspect. It should be noted that if\nand visual acuity) and competence » The effects of sunlight (shining the signal is displaying ‘stop’, the driver\nrequirements; and secondly that driving either into the signal or into the is expected to stop at the main signal,\ncabs should be designed to provide the driver's eyes). not the repeater.\ndriver with an optimal view of lineside » The possible consequences of a Countdown marker boards are also\nPositioning signals and some other countries as a SPAD_ | rallways this is done routinely, on others\n加 (Signal Passed At Danger’). it is done only in special circumstances,\nIt should be clear by now that designing for instance where the signal\na lineside signalling system requires The proposed location and light beam sighting time is poor.\ncareful consideration of the train drivers’ | alignment of each signal is usually\nneeds. In particular, the locations subject to review to ensure that in Most railways have conventions about\nof signals for optimum viewing and practice a driver will be able to read the whether signals are located to the left or\ncorrect driver response are of critical signal aspect reliably and accurately, and | the right of the track, usually dependent\nimportance. The locations are initially that there are no unforeseen hazards on whether, on double track lines, trains\ndetermined by headway and signal associated with the location. are normally on the right-hand or left-\nspacing calculations, taking account This review process which may involve hand track in the direction of running.\nof the topography of the railway site visits and/or the use of simulation Main signals are usually positioned at\ninfrastructure (including track layout, systems, is known as ‘signal sighting’ or above driver's eye level, on either\ngradients and speed limits), operational (in Britain, at least), and is a joint activity posts (masts), cantilever structures or\nrequirements, the rolling stock that involving signalling designers and train gantries. The latter two are used mostly\nwill use the railway, and capacity operators. Signal maintainers may also on busy routes with several parallel lines\nrequirements. Other factors may also participate so that maintainability issues | where there may not be room to place\nneed to be considered, such as: can be considered and addressed. individual signal posts between the\n。 Line curvature and structures (such Where the time for which a signal is tracks, see Figure 9.\nas bridges, station infrastructure and | visible to a driver is unacceptably short\noverhead line equipment) that may (for example, because of tight curvature\nimpede signal visibility. a>>\n13",
      "source_file": "28_signals.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 7,
      "text": "IRSE News | Issue 304 | November 2023\nOn some railways, notably underground Figure 10 - A cutaway side view of a typical filament lamp lens system.\nmetros, there may be insufficient room\nto place signals in locations that are\nclear of the swept envelope of the train.\nIn such cases, smaller signal heads\nmight be used and/or they might be\npositioned near ground level instead\nof being elevated, where there is |\nmore room for them. |\nLastly on the subject of signal positions, Lamp (bulb)\neach signal may be assigned an 4一\nalphanumeric identity that is unique Main filament at focal point\nwithin the area of the control centre.\nTypically the identity is shown ona SO a OO\nplate attached to the signal structure,\nand on the signalling display system Coloured se\nin the control centre. If a driver and neat inner lens oe\nsignaller need to speak with each outer ~ TMa \\\nother (by radio or phone) when a train\nis stationary at a signal, the identity is\nused to verify the train's location. This is\nvital for safety, particularly if the signal\nis displaying ‘stop’ because of a failure\nand the driver has to be given verbal\ninstructions to proceed.\nSignal head design to produce a concentrated beam of an un-illuminated (black or ‘dark’)\nSignal heads have many different light with beam intensities suitable for signal. Typical arrangements include\ndesigns. The predominant form is long, medium or short-range viewing. double filament lamps, one being the\na metal structure within which are For these reasons many railways standby for the other; proving within\nseparate lamp (bulb) and lens assemblies | now use LED signals in preference the signalling system that the signal\nfor each coloured light that the signal to filament lamp types for signalling ahead is alight before a driver is given\nrequires. Each assembly has an electrical | schemes and renewals. a movement authority towards it; and\nwien switenes te lamp on oF 9 a distance is of prime importance, a ; , , y , oly\nilluminated signals. Railways’ operating\nSome railways use lamp and lens driver also needs to be able to see the\n; rules usually state that in the unlikely\nassemblies that allow multiple colours to | aspect displayed when stopped close | |\n, - ; ; event of a driver encountering an\nbe displayed through a single lens, rather | to the signal. Various techniques are _ , ,\n: oe , , un-illuminated signal, they should treat\nthan having a separate assembly for each | used to ensure this, including a specially | . ; i, ,\n, re ; ; it as displaying ‘stop’.\ncolour. The so-called ‘searchlight’ signal | designed part of the lens which shines\n(an electromechanical device) is one light down towards the driving cab; The use of LEDs in signals has made the\nexample of this. Other types use dichroic | using small repeater (or co-acting) sudden failure of a light very infrequent\nmirrors or colour LEDs. signals at cab height for close-up compared with filament lamps. Each\nviewing; and requiring drivers to stop a light typically comprises a matrix of\nThe filament (incandescent) lamps few metres before the signal, where it is multiple LEDs and therefore a single LED\ntraditionally used for signals are generally Clearly visible to them. failure only marginally degrades visibility.\nlow power devices (typically 24W or less) .\nspecifically designed for the purpose, The visibility of signals can be Maintenance considerations\nIn front of which is a lens system, see Se 人 covons woere at Signals need to be maintained, which\nFigure 10. This arrangement produces a ith 机 aie oh int he le oi may include cleaning the lenses,\nvery concentrated beam of light that IS S elmer § ig alrectly Into me signa replacing failed lamps, and periodically\nvisible as much as a kilometre away in or is shining directly behind it. Signals ; ;\n. , , checking beam alignment and\ngood conditions, with a narrow angle are usually equipped with hoods to\nlamp voltages.\nof divergence to help ensure that the reduce the problem, and lenses are\nsignal can be seen predominantly by designed so far as possible to minimise Safe access for maintenance staff is\ndrivers on the line to which it applies the reflection of sunlight, which could therefore an important consideration\nbut less so by drivers on other (parallel) otherwise produce so called ‘phantom in the design of signal structures and,\nlines. Lens systems can also be wide- aspects’ where the lamp appears to be to some extent, in their positioning as\nangled when necessary to aid viewing alight but is not. well (although the needs of the driver\nin special circumstances, such as when Signals must be highly reliable, for take Pre9eOen e 9na 5 ore usually\napproacning on a snarp Curve. both safety and train performance auIPP ,\n. ns O i fail f although some modern lightweight\nLED technology has led to a revolution ane a ht ic concidered. Ci “I single post structures have a fold-down\nin railway signals, enabling heads to ie 4 g th th 和 e ‘I SU ter y arrangement so that the signal can be\nbe much more compact, lighter and ie 日 rn ‘i ie et Ing system lowered to the ground for maintenance.\nreliable, with a less complex lens system, he ick f iv nen © tering. Cantilever and gantry structures are\nwhilst still meeting the requirement € risk Of a er encountering sometimes used in preference to\n14",
      "source_file": "28_signals.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 8,
      "text": "IRSE News | Issue 304 | November 2023\nFigure 11 — An example of a shunting signal. This one is in Great Figure 12 — Two tram and two bus signals on a single supporting\nBritain; the appearance and aspects of shunting signals vary widely structure in Germany.\non different railways.\nS52 . 。 an oe |\n一-一 , 本 gt eee - x 气, — ; a 本\neeER <-、一- TY x a: 5\n一 一 -- - ate - a 一六 由\n一 a Re We , 小 _— — > a , ] i ._----- an >\nwo Se gree A NL un _. 9\nsingle posts to facilitate access for The signals used for these purposes are Tramway signals take many different\nmaintenance purposes without requiring | generally known as shunting or position forms, and streets both intersect tram\nstaff to cross the tracks, a walkway for light signals, although when associated tracks and share the same space. It is\nmaintainers being an integral part of with a main signal (i.e., attached to the therefore important to ensure that signs,\nthe structure. same structure) they are sometimes road markings and signals for trams\nSome signals use optical fibres to called subsidiary signals. The colour are distinct and different from those\ntransmit the light to the signal head red is commonly used to denote stop, applicable to motorists and pedestrians.\nallowing the lamp unit to be placed and authority to proceed is indicated Both motorists and tram drivers need to\ncloser to ground level to make by white or yellow lights (often in pairs), be aware of signals applicable to them,\nmaintenance easier and allowing the see Figure 11. This is not universal and to some extent also understand the\nsignal head to be mounted on a simpler practice however, and railways use many | meaning of those which apply to the\nstructure. or even on the overhead different forms. The USA, for instance, other mode of transport, see Figure 12.\nvee gs ; has several types of position light signals . .\nelectrification supports if space and (and, incidentall in sianal t How train warning and\nvisibility requirements permit. and, INcIenlary, MAIN signal aspects 1\nas well), their existence being due to protection systems help\nSignals for low-speed the varied historical development of the | drivers to obey lineside signals\nmovements railroad companies. A separate “Back to Basics” article deals\nSo far, we have only discussed the main | Because shunting signals are used only with the subject of train protection\nsignals used for running movements, for low-speed movements, they are systems, and it is not the intention to\nwhere a train is travelling at speed not designed to be visible over great go into the details of such systems\nfrom A to B. Railways must also make distances, nor is there any need for here. However, it is worth mentioning\nprovision for a variety of other train aspect sequences to warn drivers to slow | the role of both warning systems and\nmovements, for which distinctly different | down when approaching a shunt signal protection systems In the context of\nsignals are generally used. These displaying stop. The signals are generally | lineside signalling.\nmovements include: ocated close to ground panna Train-borne warning systems alert\n。 Shunting into and out of sidings. Ww ee , i ion associate eg “lonacid the driver to take note of information\nSuch movements may be in signal, vedi Ke hy ‘he n © head © | presented by lineside signals, and they\nthe opposite direction to the or immediately below tne main head. may initiate braking if the driver fails\nnormal traffic flow. Tramways (streetcar systems) also to acknowledge the warning. After\n» Detaching/attaching locomotives generally operate at low speeds and acknowledgement, the train is usually\nand wagons from/to trains. braking distances are sufficiently short solely under driver control.\n. that a tram (streetcar) can be brought Train-borne protection systems monitor\nEnabling a train to enter a section to a stand when the driver sees a signal y\nof line already occupied by another disolayi th h d 人 the speed of the train and cause a brake\ntrain, for instance where a platform is “diet eying stop. ih van | application if the train is being driven\nto be shared by two trains or where | , at ve whe ao s hey provided outside safe limits. Some, such as train-\ntwo trains are to be joined together. | 2¢ intersections with roads and other | stops intervene to apply the brakes i\n¢ Moving a train over a crossover from | tram lines (including entry to single line 3 train Passes a signal at danger (stop)\none line to another so that it can 1 dth sa indi but without providing a visual or audible\ndirect d travel back sections), and they may also indicate warning before doing so. At the opposite\nreverse direction and travel back on | which route is set. end of the spectrum, continuous\nthe other line. P ‘ >>>\n15",
      "source_file": "28_signals.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 9,
      "text": "IRSE News | Issue 304 | November 2023\nFigure 13 - Typical cab display for ETCS (left) and a CBTC system (right).\n- “400 200 一 4a AAA\n- od 三 Sees Ce\n_-50 88 300 -二 一 、\nkd + -~ - 一 ee : , 0 .. 2, , Ve 2 oe Pn, ERG . -\nneon f <-¥n. : - “ oe\nFO) a a ae ue\nAutomatic Train Protection systems (ATP) | (December 2017) irse.info/irsenews239 Interpretability of the cab\nprovide comprehensive information provides an excellent broader display means that:\nabout the speed profile that the driver perspective on the challenges and 1. The information displayed must be\nshould be following, warn the driver of benefits of cab signalling. , ,\n- clear, unambiguous and consistent\nover-speeding, and intervene to slow , , , - ,\n。 . Modern cab signalling systems with any other information that\nthe train down if the train speed is not , ~ , , ,\nreduced approopriatel provide comprehensive in-cab driving may be available to the driver\nPProp > information for the driver to operate (whether in the cab or by lineside\nWarning and protection systems that the train safely and optimally without signals and signs).\nare provided in conjunction with the need for lineside signals (even if 2 The information must make sense\nlineside signals can assist the driver they are still provided for unfitted rolling to the driver without the need for\nin several ways: stock). on ines wot 9 nese mental computations or geo-spatial\n1. They can help maintain the driver's sigs rarer boards) hed i provide interpretation.\nigilance by providing in-cab visual/ to tell the driver precisely wnere to Driveability requires that:\nvigrance by Pre stop the front of the train at the end of\naudible indications or warnings ; ; ;\n, a movement authority, but apart from 1. Information must be provided to\non the approach to each signal, , , , , ,\n; ; that almost all the information the driver enable the train to be driven safely,\nrepeating some of the information , , , , ,\n. . requires is available via the cab display including, for example, current and\nprovided by the signal. , ; ae\n(see Figure 13). upcoming speed limits/profiles,\n2. They can provide an in-cab reminder The display is often called a driver- the distance to the next stopping\nof the aspect or information hij pray face (DMI m position, gradients and other relevant\ndisplayed by a signal after the machine interface (DMI), but we wi driving information\ndriver has passed it. continue to use the term ‘cab display’\na in this article. 2. Information must be provided ona\n3. They can aid the driver in observing timely basis, so that the driver does\nsignals in conditions of poor Most cab signalling systems include not need to take abnormal action\nvisibility, such as fog. ATP which, as we have already noted, (such as emergency braking) to\n4. They can intervene to slow the train monitors the driver's actions and comply with it.\ndown if the system judges that the intervenes If the train exceeds the 3. Information that requires the driver\ntrain speed is too high. maximum safe speed. Under normal to take action (either immediately or\n. . circumstances the driver is in full control later) must remain displayed for as\nCab signalling of the train. Even if the system warns lona as it is relevant play\nBefore we go further, note that trains them that the train is travelling too fast, 3\nwhich are driven using Automatic Train the driver remains in control unless they 4. The system must be designed so that\nOperation (ATO) are not part of this fail to heed the warning and slow down. the driver can control the train speed\ndiscussion, nor are we considering Driver | Like lineside signals, the cab display must without the system intervening —\nAdvisory Systems (DAS), which assist the | be readable, interpretable and driveable. provided of course that they comply\ndriver in driving optimally (better time- Readability of the cab with speed limits and do not pass\nkeeping and energy-efficient driving) but dice | ay © hat. the end of any movement authority.\nare not a substitute for lineside signals. splay Means Wat: Where a system intervention may\nSee ITC Report 44 for more information 1. It must be easily visible by the driver become necessary (for instance, due\nabout DAS. irse.info/itc44 from their normal position in the to over-speeding), it should normally\nCab signalling may be provided for cab, even under difficult lighting pe precedes by a warning So tna\n9 g may be P conditions such as bright sunlight. the driver can take the appropriate\nvarious reasons, including better . corrective action.\noperational performance, improved 2.Warnings and other important ‘alert | | |\nsafety and reduced costs. Bob Barnard's information must be particularly Most cab signalling systems are designed\narticle “What can cab signalling ever prominent and supported by clear on the ‘head up principle. In other\ndo for us?” in issue 239 of IRSE News and distinguishable audible warnings. words, the driver looks out of the cab\nwindow at the track ahead most of the\n16",
      "source_file": "28_signals.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 10,
      "text": "IRSE News | Issue 304 | November 2023\nVW iva Va G, Te I” CMY MAY BAN ORY BAVABV/VASY) Ay ;\nY\\ i] s\\] VBL I a\nBBS ee ON AAA\nrae ii rT 人\nPrt Ns To Lin ate gebee | cA See qi 人 ei (| oe. | 7\n-AR oo 1 , , we 7 ! ot a ‘ Ss _~ . . 4\n—=— eee ee A rainy day in Glasgow, but good sighting and modern signals}\nae a oe 和 一 NS wes give drivers a clear indication of their movement authority.\ntime, glancing at the display only when and the importance of meeting the The contributions of others to\nnecessary. This is particularly important driver's need for signals to be readable, the production of this article are\non railways where it is possible that interpretable and driveable. acknowledged, with thanks in particular\nan obstruction could arise on the line ; ; to Robert Baird, Richard Barrow,\n. We have considered how train ;\nahead - although of course there is rotection and warnina systems support Hugh Barton, Wim Coenraad,\nno guarantee that the driver could P _ Warning sys PP Piers Connor, David Fenner, Mark Glover,\n__ the driving task in lineside signalled .\ntake action to prevent a collision. , , lan Mitchell and Allan Neilson.\n, , territory. Finally, we have acknowledged\nThe ‘head up’ principle makes it doubly , , ,\n| that, although full cab signalling (with di\nimportant that the in-cab system, and ;\n. . , , ATP) removes many of the issues\nthe display in particular, is designed to , ne ene ;\n, , , associated with lineside Signals, the need\nfacilitate this driving style, for instance . .\n, , to make the information displayed in the\nby providing audible alerts when new , ,\ninformation is displayed that requires a cab readable, interpretable and driveable\nremains important. About the author\nresponse by the driver.\nCab displays are usually interactive, If you are new to railway signalling, we Francis has been a long time\n_ ; , recommend that you learn more about member of the IRSE. His career\nrequiring the driver to input information , , , ss\n. the lineside signals that are used on has seen him work for British\n(for example, at the start of a journey, , , 。 ,, 。 , ,\n, , , railways with which you are familiar. Rail/Railtrack, Atkins, the Railway\nor when changing the driving mode, , .\n; What aspects and aspect sequences Industry Association and finally as\nor to acknowledge warnings). Other - - -\n, , are used? How are diverging junctions chief executive of the IRSE before\ninformation, such as the speedometer, ; . . :\n, , signalled? How well do the signals his retirement.\nmay also be integrated into the display.\n. meet the needs of drivers, as Set Out ;\nErgonomic factors are therefore in this article? Francis was an IRSE Exam\nimportant in the design of the display Thorrowgood Scholar and served on\nand associated input keys. You might also investigate types of Council for many years, becoming\n。 signals that have not been mentioned president in 2012-2013.\nClosing remarks — for instance, special signals used . ,\n. , . He has previously written\nIn this article we have attempted to to authorise a train to depart from a 。 , gs\n. . ., , Back to basics\" articles on\npresent a broad picture of lineside colour | platform when it is ready to leave; or interlockings and points\nlight signals, their purposes, and their situations where fixed lineside signs are 3 P\nvariations. We have explained the most used instead of colour light signals; or\ncommonly used aspects, the differences | signals used in conjunction with some\nbetween speed and route signalling, types of level (grade) crossings.\ns s | s\nIf you found this article useful were sure you will\nenjoy other Back to basics articles, including:\nInterlockings Points Train protection\nFrancis How Francis How David Fenner\nPart 1 April 2020 irse.info/irsenews265 “Part 1 February 2022 irse.info/irsenews285 July 2020 irse.info/irsenews268\nPart 2 May 2020 irse.info/irsenews266 “Part 2 March 2022 irse.info/irsenews286\n17",
      "source_file": "28_signals.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    }
  ]
}