{
  "doc_id": "dee0e53d-b7b6-4136-812f-46460e9aa7b5",
  "pages": [
    {
      "page_number": 1,
      "text": "UIC\n\nWORK\n\nPROGRAMME\n\n2025-2025\n\nLG i\nbod: ane. ee ERIN,",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 2,
      "text": "",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": true,
      "garbled_reason": "empty",
      "ocr_used": false,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 3,
      "text": "UIC\n\nWORK\nPROGRAMME\n2O25-2025\nwie)",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 4,
      "text": "KRZYSZTOF MAMINSKI, wal |\nees ES a alee\n, (\nRail must play a leading role in the decarbonisation However, we also need to show the potential of rail\nof transport sector at global and regional scale. It’s ready to compete with other modes of transport.\nthe most and the only sustainable mass transport\n. y P There is a lot of work ahead of us to release full\nthat is currently ready to address our climate\nrailway potential. We need to improve our cost\nrelated challenges effectively. Therefore, it needs ee\neffectiveness through digitalisation and innovation,\nto be placed right at the heart of development of a: , .\n. a resolve problems with interoperability and capacity\nfuture mobility and global logistics chains. . . .\nconstraints, and most of all we need to invest in\nIn order to make it happen, the railway community modern infrastructure and rolling stock.\nneeds to intensify its efforts to further promote the\nclear advantages of rail through public discourse\nand make it more attractive and competitive in |.\nboth the eyes of present and potential users as THE NEEDS OF THE\nwell as all decision-makers. REGION’S MEMBERS [ ]\nWe want more people to travel by train, more REMAIN MY ABSOLUTE\ncompanies to move their goods by rail and more\n33\npeople to consider a career in the industry. PRIORITY.\n(4)",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 5,
      "text": "As Chairman of the UIC, | am committed to work Railway needs a realistic vision supported by\nwith our European members and other world — effective tools for its delivery. Whether it is creation\nregions to ensure that rail plays and will play an of a coherent global rail network with seamless\nimportant global role in securing transport sector goods and passenger flow through its corridors,\nsustainability and inachieving the abovementioned _ further digitalisation and standardisation, or fast\nclimate and environmental goals. and efficient modernisation through innovative\nTherefore, the supra-regional development of solutions, UIC Is the optimal cooperation platform\n\nfor sharing global ideas and developing common\nrailways has special meaning and importance to me.\n\n. . tools to make it all real.\n\nIt not only allows for tackling climate challenges\nglobally, hence contributing to a brighter future for Rest assured that the needs of the region’s\nall the world’s societies and our planet, but also, if members and development of interregional\nwell managed and adequately financed, railways cooperation remain my absolute priority and |\ncan become an important element of social policy am deeply convinced that our new UIC Work\n- an effective tool to increase citizens’ mobility, Programme 2023-2025 will play a crucial role in\neliminate various types of social exclusion, and releasing development and innovative potential of\nfacilitate access to the labour market and public the railway sector on a global scale.\nservices.",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 6,
      "text": "FRANCOIS DAVENNE, |\nUIC DIRECTOR GENERAL }\n= ry ©\n_y 也\nThe railway sector is entering a crisis and emergency period. The International Energy Agency analysis shows that traffic\n, . . must shift from road and aviation to rail this decade in order\nA crisis period, because the challenges we have had to fight t h the Paris A + obiecti 5 te st ti\n. . . O reac e Paris reement objectives. Despite stagnatin\nover the last three years with the Covid pandemic, followed by . g P 9 9\n, . , oo. ue - at around 8%, rail’s market share needs to grow by more than\nthe Ukrainian crisis, which in turn has highlighted the fragility\n40% in less than a decade.\nof energy supply chains, have shown that the assets we may\nhave thought impossible to call into question are fragile. It will Projected global GHG emissions from NDCs announced prior to COP26 would make it likely that\ntherefore be necessary in the future to think in an uncertain warming will exceed 1.5°C and also make it harder after 2030 to limit waming to below 2°C.\n: : . . Global GHG issi b. 2030 . 2050 d. 2100\nuniverse and to be ready to help our members in the resolution oF » ° .\nPokey .\nof unexpected crises. \"0 10 wis\nAn emergency period because we know that the climate ®* , 5 | | |\nissue is urgent. The IPCC report! of April 2022 tells us that we é so - 80 -\nneed to implement a clear break with the practices and habits 3 40 -\nof the transport sector if we want to achieve the objectives of 8 » 30 -\nthe Paris Agreement2. We only need to look at the gradient * » Ss 20 I\nof the curve that is compatible with the Paris Agreement 0 0 _\n1.5° objective: it requires an inflection so rapid that it is only ; ; | __\ncompatible with a strong acceleration of the modal shift “0 本\ntowards rail transport, public transport and active mobility. awe ee eee\nModelled pathways: Policy assessments for 2030: Percentile:\nHEE Treng from implemented policies Policies implemented by the end of 2020 gst\n—— Limit warming to 2°C (>67%) or return warming to HE NOCs prior to COP26, ase\n1.5°C (>50%) after a high overshoot, NDCs until 2030 unconditional elements | Median\n—— Limit warming to 2°C (>67%) —— NOCs prior to COP26, e\n—— Limit warming to 1.5°C (>50%) with no or limited overshoot including conditional elements\n1 « 1 Past GHG emissions and uncertainty for 2015 and 2019\n(dot indicates the median)\n1. www.ipcc.ch/report/ar6/wq2\n2. www.un.org/en/climatechange/paris-agreement\n6",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 7,
      "text": "The combination of these two constraints means we must From the point of view of sector advocacy, the Manifesto*\nsucceed and succeed quickly. that we adopted in July 2022 will be the basis for the future\nIn the next three years, the European Union has taken a strong UIC action plan. The document deliberately calls for a global\nCoe ee . . paradigm shift, with the collaboration of all transport modes,\ninitiative in favour of the railway mode with the creation of t t fic t the heart of t t ii\nEurope’s Rails.1.2 billion euros will be spent over the next seven 9 pur energy eniciency a © cart 0 Fanspor Po CIES.\nOver the next three years, we will need to unite our energies\nyears to rapidly advance the sector to meet the challenges it _\nfaces. Obviously, the objective of modal shift must begin to to create a global coalition where we can work with rail\n. og: operators and manufacturers, public transport operators, road\nbe pursued resolutely without waiting for the implementation transport operators and associations to desion a concrete\nof these technical breakthroughs, which for the most part he J pS ble f ‘fut 9\nwill not arrive until 2030. However, these innovations must be path to a gesiraple trugal rurure.\npart of the roadmap that we must draw together. The ability to finance this shift will also be a new priority for\nFrom the UIC’s point of view, we must therefore proceed with UIC. We are faced with a new challenge: the decarbonisation\na dual alignment of the transport sector can only be achieved through massive\n, investment in infrastructure and rolling stock to develop the\nFrom a technical point of view, the ERJU (Europe's Rail modal share of rail. This investment will of course have to\nJoint Undertaking) roadmap must serve as a reference come from public authorities, but also from the private sector.\noint for projects developed within UIC, while preservin\nP 了了 . | , , P . P g In particular, it will be necessary to progressively make people\nthe association’s ability to operate on an international level.\noa. accept the need, at both the European and global levels, that\nIt Is therefore not a question of limiting ourselves to the climate finance, carbon offsets, as well as a significant part\ndevelopments that are underway within ERJU, but of making , a g P\n. . . . , a of the carbon tax, must be reinvested in the realisation of the\nit an anchoring point to continue to focus UIC’s activity on necessary capacity to carry out a new transport paradiam\nsubjects that have a strong added value for our members. 4 i 站 . t y t P P g\nThroughout this Work Programme 2023-2025 we will use the BFOUND Fall ANG PUDIC transport.\nfollowing typology:\n> Projects that are within the scope of ERJU and for “\nwhich UIC support is necessary, such as FRMCS (Future [T WILL BE NECESSARY IN\nRailway Mobile Communication System) and DAC (Digital THE FUTU RE TO TH | NK IN\nAutomatic Coupling).\n> Projects outside the scope, but which are necessary to AN UNCERTAIN UNIVERSE\ndevelop a rail offer for a new transport paradigm, such as AND TO BE READY TO\nOSDM (Open Sales and Distribution Model) and the digital\nplatform for freight. HELP OUR MEMBERS IN\n> Regional work programmes that will allow the deployment THE RESOLUTION OF\nof structured training actions, the study of use cases ”\nadapted to local contexts and the dissemination of UNEXPECTED CRISES.\ninnovations conducted by UIC all over the world.\na 4. uic.org/IMG/pdf/uic-manifesto_rail-solutions-for-a-better-future.padf |\n3. rail-research.europa.eu/about-europes-rail/ www.youtube.com/watch?v=RIQZkKWZFF|Iw",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 8,
      "text": "-\noa a “ 了 —— > _ 5\n=” - s 10 UIC MEMBERS AROUND THE WORLD\n; SS eh 14 sTRATEGIC OBJECTIVES\n18 NEW REGIONAL STRATEGY\n21] Regional roadmap for Africa\n' 25 Regional roadmap for Asia-Pacific\nws 人 29 Regional roadmap for Europe\nmes ena ae oe: a, es 33 Regional roadmap for Latin America\nOle rarer errr are a) ce 37 Regional roadmap for Middle-East\n| 41 Regional roadmap for North America\nne oo a 46 susTAINABLE CARBON FREE TRANSPORT\npt 46 Strategic objectives of the sustainability platform\n4 后 48 Position vs ERJU\nPan ze cuter: Wt 49s Participation in the regional strategy\n52 TOWARDS DIGITAL RAILWAYS\na . Mey: oy 56 Towarbs A SHARED RAILWAY SYSTEM\na ) { 56 Strategy & main deliverables\n4 TR 58 Position vs ERJU\n~ 0° a | 58 Development of UIC documents\n. 8 1 59 Participation in the regional strategy",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 9,
      "text": "p BE os\n62 UNLOCK MULTIMODALITY FOR PASSENGERS Be, rs 加\n62 Strategy & main deliverables < , .\n64 Position vs ERJU a <\n65 Participation in the regional strategy te :\n68 INCREASING RAIL FREIGHT MODAL SHARE Pa\n68 Strategy & main deliverables . . ag OMe,\na ig ey\n7O Position vs ERJU ye as LRN —\n71 Participation in the regional strategy ae Sea on Fags, Cay SNR ES\n74 CONTRIBUTING TO THE FUTURE OF SAFETY ns a\nAND OPERATIONS Pe ; a i a\n74 The main outcomes of the Operations Sector & Safety Platform wo\n75 Participation in the regional strategy 站 en\n75 Position vs ERJU we : a :\n78 ENHANCING SECURITY ee Sa\n78 Strategy & main deliverables 4 . a\n79 Position vs ERJU ; .\n79 Participation in the regional strategy\n82 EFFICIENT AND TRANSPARENT MANAGEMENT\n82 Finance\n83 Quality ee aoa\n84 Communications ee Te\n85 Human Resources wae Wyre , .",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 10,
      "text": "学\nLA bh\nUIC MEMBERS 0\nAROUND THE Fag sf a\nWORLD ; me\na\n2 Te eo\nev\nay\nJ \\ :\n214. ‘ x\ni\nMembers\ncountries And ... “\n\\\nbillion passenger-kilometres UIC working groups\nbillion tonne-kilometres UIC partnerships\nmillion kilometres of line UIC events per year\nThe boundaries, names and designations used on\ny the map do not represent an official UIC position on\nthe legal status of any country or territory or the ')\nmillion rail personnel delimitation of its boundaries. Py\nJanuary 2023 4\n(40° a.\n\\ . ae",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 11,
      "text": "UIC MeMBeRs aROUND The wORlD\nLes frontières, noms et appellations employés sur\nla carte ne représentent pas une prise de position\nofficielle de l’UIC sur le statut juridique des pays ou\nterritoires ou sur le tracé de leurs frontières.\nThe boundaries, names and designations used on\nthe map do not represent an official UIC position on\nthe legal status of any country or territory or the UIC members\ndelimitation of its boundaries.\nJanuary 2023\n11",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": false,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 12,
      "text": "Share, Open, Connect\nPromote rail transport globally\n* Highlight and demonstrate the attractiveness of\nre 人 way onal work PROMOTE\n* Implement ambitious regional work programmes\n* Become a recognised training hub @) ] RAIL TRANSPORT\n。 Create a network of structuring framework 一一一 CLOBALLY\nagreements with international institutions at the\nEuropean and global levels\nFurther develop UIC as the technical platform to address\nmembers’ needs\nFURTHER DEVELOP UIC *。 Achieve a shared system vision\nOW AS THE TECHNICAL * Document and update UIC specifications, guidelines and\nPLATFORM TO ADDRESS repors slementation and added value of UIC product\n’ * Monitor implementation and added value o products\nMEMBERS’ NEEDS * Leverage data and sharing of experience\n* Increase significantly the level of technical activities globally\nCreate innovation through projects\n* Draw a path for the digitalisation of the sector '\n* Implement a global innovation strategy in x 7\neach region - _ CREATE INNOVATION\n* Accelerate innovation by taking into account THROUGH PROJECTS\noperational constraints 4 、\n。 Be part of public innovation programmes at\nthe European and global level\nPromote sustainable, carbon-free transport\nPROMOTE * Strengthen the role of modal shift in transport\nSUSTAI NABLE, policies\nCARBON-FREE CLI 。 Advocate a change of paradigm with public\nransport and supply chain stakeholders\nTRANSPORT 。 Make rail projects eligible to green finance products\nEfficient, transparent management for the\nbenefit of our members EFFICIENT,\n。 =e and CSPere governance , Oo TRANSPARENT\n* Regular reporting and ongoing assessmen\nof added value from activities @) lo) MANAGEMENT FOR THE\n* Ongoing skills development BENEFIT OF OUR\n* Provide the Regions with a vehicle for MEMBERS\nproject development",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 13,
      "text": "STRATEGIC\nOBJECTIVES",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 14,
      "text": "[|\nUIC is entering the second phase of development p> =\nof its strategic objectives. The 100° General pa => o- > > -_\nAssembly did not wish to change the five key - > > *. - -\na —_\nfocus areas, considering that they had given the ~ 一 一 一 一 Pa\nAssociation a positive general orientation and 好\n四\ngenerated concrete developments. Moreover, ¥ a |\neven if substantial progress has been made in 加二 1 me 7\npositioning UIC as the technical organisation of _ . gM er ow\neo BR ae RS pe\n\nreference for the railway sector, much remains to nn aot rf\nbe done, in particular to strengthen UIC’s position io} fay , wet Pe\nin Europe, while giving real scope to regional ‘ 5 ; AIS\nactivities. - * i4 4\nThe updated strategic objectives reflect this 多 Re. a\nambition.\n\nblished its “Visi § Rail ; The European Investment Bank (EIB) published\nsb Pu e its Vision of Rail 2030 - Design its “Climate Bank Roadmap 2021-2025”’ and the\na ian he on December 2021: adaptation European Commission published its ambitious\n中 climate , ange is on ne 2? eal hich hae plan “Fit for 55” Plan for a green transition®. Private\n” ared worldwide, and the gency or YY Ic aS investment funds are also growing their sustainable\nJust been recalled by the IPCC*. Al the Multilateral finance borrowing as high GHG emitting industries\nDevelopment and Investment banks, including the become higher risk investments.\nWorld Bank, are now aligning their portfolios with\nthe Paris Agreement and transitioning to become _ The only frugal, low greenhouse gas emitting mode\nclimate banks. of transport capable of supporting these strong\n\nambitions is rail.\n5. uic.org/IMG/pdf/uic-design-a-better-future-vision-of-\nrail-2030.pdf 7. “Climate Bank Roadmap 2021-2025” by EIB - Published in\n6. “Climate Change 2021 - The Physical Science Basis - November 2020\nSummary for Policy Makers” by Intergovernmental Panel on 8. “Fit for 55” European Plan for a green transition - Published by\nClimate Change (IPCC) - Published in August 2021 the European Commission in July 2021\n(44;\n\\ . a",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 15,
      "text": "STRATECIC OBJECTIVES\nCCCI\ntl ~ Fig ’ Tl im TV.) = There is a need to rethink learning strategies to\n‘ a coe | | 本 JR develop the skills of staff and to attract the talent\n. 名 四 | a we. of the future. A flexible, well-trained and motivated\ni — <i | Ib 7 workforce is key to a competitive and innovative\n和ON人人\n用 ABA we- | ae ANG: m= Tothis end, several types of training willbe proposed\n= smile IS of 1 / with the establishment of a UIC Rail Academy\nSas age f Spe Pa | distance learning platform in partnership with a\n本 ee wad ee : 于 recognised academic institution. This objective\nae 6B) se og ae ' By is to quickly offer the rail sector an express route\nee: 4, 和 to upskill staff, enabling them to confidently face\nof ip wee = the challenges ahead. In this way, UIC wishes to\n和 an i / extend the rail sector’s capacity for innovation and\nimprove the sector’s competitiveness by making\nAs a result, UIC will notably encourage, through — full use of the knowhow of its rail experts. UIC will\nits “Vision of Rail 2030” and the “More Trains” go on supporting regional training centres and\ncampaign, the allocation of funds to invest in the create synergies between them in order to meet\nimprovements of multimodality, infrastructure, the specific needs of members in the regions within\nrolling stock and services, as well as innovation 3 common framework.\nto decarbonise operations, in order to drastically\nincrease the number of trains, the number of Finally, the Talent and Expertise Development\npassengers and freight carried worldwide. Platform will see its organisation change in 2023\nin order to address the new challenges and\nFurthermore, UIC will develop railway training solutions for learning, development and training\ncourses linked to its strategic areas in order to technologies.\nsupport its members in all regions.\n,15 :\nN77",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 16,
      "text": "",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": true,
      "garbled_reason": "empty",
      "ocr_used": false,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 17,
      "text": "NEW REGIONAL\nSTRATEGY",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 18,
      "text": "[|\nSince the first 2020 - 2022 Work During its 100 years of productivity, UIC It can be summarised in the following\nProgramme, all the UIC regional produced a valuable asset of technical “V-cycle” diagram, which is quite classic\ncoordinators have tried to give more _ specifications and guidelines for the = in the manufacturing world. Thus, UIC is\nconcrete content to the activity of railway community. present:\nthe regions | more omnes work Accessing this legacy and participating »” Upstream, at the inception of the\nProgrammes. It IS a question OF GIVING in the new developments are the main concept of operations and the defi-\nUIC’s specific roles and responsibilities | context clarifying the exact role of UIC technical),\nstarted in 1922 with the idea to give is paramount for each of the regional >» Downstream, at the system verifica-\nto the sector a common technical — strategies. tion and validation stage, for mainte-\nframework. nance, and for preparing operational\nsolutions adapted to innovations.\nSPECIFICATIONS AND STANDARDISATION\nCooperation between IMs, RUs, manufacturers,\nwagon keepers, and other ECMs\nCONCEPT OF IMs, RUs, keepers\neae @gaqgeaeeee@ @ @ a a qgnwTaz 7 gay q@qgaqgese= QF @qqeq@ @@Q@Q@ @ @& @& @& @& a Gs =a» SS ap em a &@ @ &@ &\nREQUIREMENTS cy\nIMs. RUs. keepers AND FUNCTIONAL > IMs, RUs, keepers\n, , P SPECIFICATIONS > and manufacturers\n- ARCHITECTURE 人3\neae gpepee@@Pe@g@«a@ «ee» @ 4 @ @ a» CE @eqe@teaepee@gee@e& @& @ 4 «a OO ae am am am om am em ee ee em @\n有 本 ie\n%\nStandardisation 了 DETAILED M fact\norganisations 区 DESIGN anuracturers\n%\nVv 全\nPRODUCT\nDEVELOPMENT\n一人>\nTime\n(418:",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 19,
      "text": "NEW REGIONAL STRATEGY\nCCCI\nWe have started to set up an inter-regional retain the Intellectual Property Rights within DURING THE 2023 - 2025\nexchange platform to decide on priorities aspecific region. Today the only application PERIOD:\nin terms of develooment, exchange, and is within the framework of Europe’s Rail\ncommon standardisation activities. Joint Undertaking CERJU). P The membership base will\nincrease due to the more\nAs activity develops in Regions outside For the 2023 - 2025 period, as the ambitious and focused\nEurope, this platform is intended to definition of needs in the different region activities,\nbecome increasingly multilateral, as has progressed in particular through > The budgets for regional\nillustrated by the figure below, and where the numerous webinars organised, the specific actions such as\nthe ringfencing concept voted at the 99'\" definition of ambitious work programmes training, projects and\nGeneral Assembly (in December 2021) for each region has been undertaken and sharing of experience, will\ncopes with requirements coming from the — they will be implemented. increase,\nregional public financing instrument to > Consideration will be given\nto the creation of decision-\nmaker delegates ensuring\n- LEGEND .\nEuropean a permanent presence in\nprojects Ringfence the most active regions to\nShared materials lead the programme and\narticulate regional visions.\nMiddle- Asian\nEastern projects\nprojects\nCOMMON\nPROJECTS\nNorth Latin\nAmerican American\nprojects projects\nAfrican\nprojects\n(49°",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 20,
      "text": "六\n*.\n. 四 ao - —- . .\n. ‘ ~ . , ge . . . , a - rs 下 |\na 7; a fo. ~ oe ape + . . '. . 四\n_ 一 ‘ a ~, ‘ .\nMT 一一 A BS 8\nTTI Te eet ee on . 一一 ee eee eee: __\n: mee, ~ _ 了 iw ; oe mae too = 一一 人 Wie Romane.\na : Lf . 7 “~ 一~一 . - _ . me Cee am oe a\n~ oo , . a\n- — . .. . ° 一一 -一一-一 _. — Le ~ * 本 woot 一一 -一一 本 -\n_ TFS -- 一-= 了 - 由 - : 7 ot . ae 4 Lo . _ - - , 一\n四 - , . aan . : i . : ae 区 co\naa 有 本 加 _ a me ~ . . See 加 : 7 , - 和 _ - os ‘ye ;\n=~ 了 . 、 一 六 ~- _ ; cet . _ -\n. ; - a. 人 wm, - . —_— . _ cae - <<\n7 . wo es wats a wa * i - -一 . r _ ee\nLe 7 “asus ~ i «oll 一 一 一一 2 a a\nra ? ot - ‘ -*'. . .\nJ! 多 ial +f oe\nCo fhe 7\n-~ i” a - atte wr ‘Ee “\nKK 的 _- an Pr ie: 2\n- or = ay. 7 be - “re, ww Mee a Ps ix: re , 全 f -\n_ RS一一\n- “ TM~, - i ac Re” 5 ON , “四 nl ~ eos * Race seth ~ ; a Fig ee, we = fee\n~~ ? ae oma trl nf . - > _ ek BS ~ SR\n一 人 - ¢ 2 IE. Os el 人 ; ~~, + hee na ~ ee ” on fe: 726 ale 5 » ee\na - : eae oie ae oa te ad -全 ~— : '_ ioe. ine a 人 ta ape 国人\n人 oN % 2 nn pa “en, > 外 tle gears 本 加 ~~, ae > £& . ae ae Pt gs\n- . 4 et eee Sr OPE we 有 Ac mm ”> -。 ~~, ne ” © i. -F i. 5\"? 人\n- 0 ae + ££ Ss = Mey ty ME I, te) nee\n: Eto 要 了 a. . Ap ° . ow —_ anne yt > ~ = -全 Pesce > tn <P ae -并 2: a “aia",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": true,
      "garbled_reason": "empty",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 21,
      "text": "的 NEW REGIONAL STRATEGY\n。 mL REGIONAL ROADMAP\na _ . The consultations and high-level meetings organised in 2022 with members\nae : (Tunisia, Algeria, Senegal) and institutions (African Union, European Union\nAgency for Railways) show that there is potential and interest in jointly developing\nan ambitious action programme. The Region, despite the positive prospects, is\n. - still caught in a kind of vicious circle where the absence of a concrete project\n图 Ce implies a lack of efficiency and involvement of members.\na a The various actions carried out by the Presidency of the Africa Region and the\n=a UIC services have led to the establishment of a new ambition for the region.\nfi In particular, the Covid-19 crisis has enabled us to meet every two months for\ni. if? . African Rail Thursdays.\n, 0 ai = This paradoxical effect of a crisis has allowed us to realise that we have important\nPOA tasks ahead of us to develop rail in Africa, with four major axes:\nP 4 Lo >» To succeed in the digitalisation of the African railways,\n, ” > To increase the power of the training actions and the African projects,\npa og ? > Adapting UIC technical specifications to the African context through a rein-\nA sel ~~, forced partnership with the African Union.\nae Sy,",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 22,
      "text": "Today, 70% of the region’s dues go to core fees, which limits = 网 每,全 S==|==|=S=2 a Si 二 < |\nthe interest of members to become active members and TI a 转国上 =x ¥ a2 & Ae\nkeeps the funds available for projects to a minimum, i.e., no = a AE ==|== meat i] ryeles =\nmore than 9OK€. =| ao ae: mas;\nWe collectively need a shock to be able to concretely [Rass . ewe ate 78\nundertake the work programme which in order to reach 2026 =a Snr ya 本\nwould require about 300K€ per year dedicated to projects. __ 4 - > to \\ * , 7 ri ae\nThe feasibility of such an orientation depends on the clear will a i ! 5 . | LU\nof the members to get involved to the extent that is necessary. FFFE=aal 一 SN “| \"1g A 1 an\nam Gib 8. (if See\n: ! SRL OF\n& ; ' a\n> -—_-\nin ] a | 加 者 A. i's ~ , 和 . do °\n. . ae 一 , Re 一 四 a 上\n加 q eo a a ne «\nee ake ay Mae i) ye\n© Présidence Sénégal ° Te |",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 23,
      "text": "NEW REGIONAL STRATEGY\nCCCI\n—. : q It is obvious that it is not realistic to move to full payment\n加 — NS of dues by 2023. It is therefore proposed that this level be\n: ” achieved by gradually increasing the dues of existing members.\nwae\nPS\nWN —_ F Commitment being the key to success, under the leadership\n四 : — oad of our Chairman and with the personal involvement of the\ncy / ae pee J Mh wi iL Director General, a task force is charged with securing the\nee aes Big a ae . ie \\ os path to the new funding scheme and project programming\nmy : 4 4, iB 所1 | , with the objective of:\na . 2 a 和 ——— wn sf -. ® Securing the path to the new funding scheme with interna-\n‘) MEE BA tional institutions such as EIB, ISDB, World Bank, etc.,\n~~ : > Implementing the Work Programme,\n>» Ensuring the programming of projects and actions, espe-\ncially training,\n; > Ensuring a stable and committed participation of UIC\n| “ob : - ‘oOo. | -_ , .\n| hye ua 人 en iff Africa members.\n”让 A t bye {\nane ca - . = on a a\n| | . wl a ‘ 1\n23 |",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 24,
      "text": "” .。 2 、 a a_i ors rel me 7 . 7 . aan 1 1 --\nT cris \\ -| oe aol =e 8 a - - oe . od -, 一 aol\n, i J wee! ote, r* mm | . on 1 ' _ _ a\n. -1 ‘a TO, i ro! “1 4 || , , 上 ur 了一 、 1\n“at A J =, uy 1 me 中 = ee .一 a “way TI Vase - 上-一-一 \"..., ” 1 . jie |\n. ... bela \" on _- 一 - , J 。 nn es \", 7 . ten\na 。 ae 一 oa 了7、 mmTII ae 和 1 [\n. \"= _—\" Sink 7\" 一 . _ eT - Pore 1 - ire, ron 上四- 一上 “Ji | 本 。\n. . -> * Ls | - (ale ee > 1, , an b: “we, ot Te -\nL .一 ; a”. 用 、 ww! ‘. 上二 ‘J 1 I, 1 oy ora ft + , [ oe 一\n4 = 4 od Ye a : a3 -个, riya’ - 2 Le 7 tak, 加 四 * 1 一 av\n一 ss i ° 4, Me 一1 ree tL ed, on oe oe oe 1 { 一 1 47 * Vary 1 |\n| 5 ' \\ me ‘lp oir re oad erate tT 一 一 本. trie\n- 本人 oe wee. 一 ad oS -~ #L ® ‘Jet. .\n. - acy a. ral | _ J ere ae RS , 11 国国.” -1\n= a + WwW 重 一 ~ , ER 人 TM~ - : = . 一二=一-二 一一\n0 em, * Sa Ss Tas ae Oe x tet wa Pe ~ ae ; ~ &. 2a Dea a\n42) tS - = - -— > \" \" -_ 一 一\nee — MM es- me Bs 4 ee) ee ee ee \"pt et Snot aat acon\n* \"ager, 1\nea Pla medi i! ak? ise, een! we OA s'il seh die ghcs tact tothe eli taal te aid clout « lel NR abe a\n1 ”本 t 1 | 1 -- | 1 .4 ee I ee 一小- 于 i-\n\\ ; be. a oo “a. { af. .- | hy ‘ o r an A ~.! - 、 coe err A. 加 一 ~... on.\na ~ - . way ~ os eae. “ _ zy ; foe mr oy a TT, a hm .. < vs er prem 7 ’ . fae . ae _\naye ithe\n“41: Sy }\nnt: ‘\n, ba | eee Se ee eae tits ee\nf a be . a 7} vf | pert: ; J | | 网 ota , ai oY ey\n2 - 。 , 0 po te . _ ’ : 时 = ,",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": true,
      "garbled_reason": "empty",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 25,
      "text": "SA TT - 一 = \"7\naren | . “ 站\ncm 四 4 +. “= ag a . 。\n一 - ro: NEW REGIONAL STRATEGY\nae = a \\ ”= 1 .\na 4 » 1 ,\nNa\nlt. .\n.-\nyO ease. FOR ASIA-PACIFIC\n-三-\naie Se | The Asia-Pacific region - which is seeing large-scale economic development and,\ntherefore, has growing urban and long-distance goods and passenger transport\nneeds - has established its work programme priorities around:\n>» Cooperating and creating partnerships with stakeholders in the region in or-\n| der to complement UIC’s actions,\n> Knowing what the members’ and countries’ needs are by improving the qual-\nity and analysis of data collected,\n, ~ > Monitoring and establishing railway investment projects in the region,\naa , | , >» Securing the path to the new funding scheme with international institutions\na ie such as ADB, World Bank, etc.,\na > Sharing best practices, transferring technology, and training,\nis 、 an ae > Technical advice and project reviews.\n: ; : The recent work programmes were complemented by initiatives on:\n>» Openness towards new members,\n, > Creating new activities in the region,\n>» Cooperating with other regions and between members,\n> Interoperability and connectivity along corridors,\n> Railway research.\n月 4 了 , o's. i: $e The region’s new presidency from 2023 onwards will facilitate the establishment\n, of anew agenda for the next three years to start implementing the main goals of\nthe Manifesto, in line with the region’s needs.\n(25:",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 26,
      "text": "----- - 7 ~ me Os\n‘. A | Fs , ws... | 月 ga | =: ‘ We. ae 、 iN\n‘ 4 了 Vy f i> & 下 | NX 5 eee §.f- |和 — 4 a .\npe ‘Fe Na Tr r , ~ 7 | ’ 1 Bo a, go\nor 本 | |\n| 全 tA 可 a , 4\na I th = a * - .\nTopics which have not yet received detailed attention\n. will be discussed or prioritised, such as future railway\ntelecommunications, the metre gauge, security (the Global\nRailway Security Congress held in February 2023 and the\n=> creation of a pool of correspondents from members in the\nregion).\n= _ “\n-..° \\ The recurring theme of high-speed will continue to be explored\n< a “L _ _ in the run-up to the 2023 World Congress in Marrakech and in\n四 5 a fo. =o anticipation of the Congress in Bejing.\n¥: aa 本 Finally, members will be further involved in the region’s\nwe 2 u oe activities by progressively increasing the portfolio and budget.\n> mes Sa! New members’ potential must be realised, while regular links\nONG FZ * + with existing members and close links with the most active\n的 . = 2, a 二 and senior members are to be maintained.\n一 -_ 2 4 KS “hy\n‘26:\nNe",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 27,
      "text": "NEW REGIONAL STRATEGY\n一一\n- Me. ae m= soe a ay vw = a yg . wee _ co p d ne os an 7 Seg . an ve.\nBt a Me Le ae TS 有 ee , See evn ot a\na ONS Seg a. ee ee eee\n. Soe wy 4 easy SA pe — q “ap oo - OS a J > 1 二 . wey 、 x TM,\n\n- 本 a - 入 ay NG . coat Se 可 “ eel a = ye oo rn ae —_ 一一一 AS 可 Nov 、 . ; Fo of | oo PS ‘e a nets\n\n— - . ~ : 1 aa ete G -<\n\n. . 7 一 到 - — RP,\n| wg | ea | + a Toy Th AG\nUIC-KORAIL Training Program 263 | . . ll > 7 7 3\n\nRailway SRoie and Nationa oports qmcitts a — a )\n\nbs .. = Bi Ocr ov 203 mr 本 “ye ae +) hy 4 1 00 re\n\nye Rp | En\n\n了 i 1 Tat pn- 加\n\n1 | _ SR一, -二 、\n四 zi~ . 一 - 一、 , a . TM - or din\né ; . “ _ wf ~ a 、 “Ss ry\na\n_ 27.",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 28,
      "text": "7 了 . a woe .\n, * . . \" ; ‘RH ~\n‘ iS , 'y . 1 -4 . vl oe : , 的\n. ‘ . ‘. 1 bd\n. at , [ t e 人 an) , ’ '\n. 7, 也 : Ie a’?! ‘ ‘ 4 , 人\n. , 4 ‘ 4 7 I 4 b -#€ §\naa ° v4 + . . 机\nhy : _ . : , ne oe ; ; ea\n. on cho . ote d\n, , a a are 有 \" ve,\n| ‘ . . ‘ .\ntg ‘ , . % v - ,\n4 , , , 站 P< we a area ae .\n4s . , av. oer We hg aa an eee a ae : ‘ sof .\n. . . 四 2 . . ’ . a we AP 机 = a? a . . 3 . - .\n! I ' . 全 = so be - + Set pry . fe . was an, . . 。 .\n0 . = % . , 4 . 下 .\n, 4 oo . . . . . . ise! . a - ou -=\nee “ * uae 1 ee\n, . ; .. | aw é ye == me\"\n, 。 er : 27 一 BB 4 yt) “pe. \" , ced _—. a+ ~4 aS ot, * 入 AN Ae\nco wt - Sm, aC oe re\n. . - x © Ee 党: ER: ee Ma St exe TR: ao.\n: Soa et® . an Sa >. ae a a es a\n“4 ait ten ee - SORT ss haath Putty eee pes . bat\nSore . eg “. i. - ,, . _ ea i) 2 Wes fo gt : oe co a\nPBR AE. re FB RR rE saci -\n- 人 一- as . : rn. — {i> eee hoy NE - .\n.' wpe giee . .. . Sn eee 了 . .\n. , hx tm re TM ° “ - = i “|.\n, “i Ua pr | - : ate\nwe\" ‘ar 2\nvc 1 . ,\n. Sy 7 a, » . 。\nA, . f wri .\nBie. -¥N\nwe? . Ra ie 4 -虽 。 ,\nb : Ta yee -\no, : TN > ra , :\nBg 、 _\n, a er 。 ' ‘ » Lo.\n“. . m 。 — ,- “a, ) ,\n‘\\ + ~~ . 站 . - , ¢\nSay “s * - , 9% e, . »* ;\nRaw wren ey",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": true,
      "garbled_reason": "empty",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 29,
      "text": "a ‘ 区 。\n. f A “ ) NEW REGIONAL STRATEGY\nid ‘1 # 上\na REGIONAL ROADMAP\nrly. a?\nee FOR EUROPE\nBrn ase. 四\n-¢§ a aa 不区 - --: Py\nerr uk < Qo Even if geographically smaller than other regions, the European Region has\nahaa eae Poa # the greatest number of UIC members (120 at the time of writing) these being\nSe - fairly evenly spread amongst the active, associate and affiliate categories of\nae sate membership and in every area of the Region.\n四 eae as The railways in the European Region have been typically the most active in\nare _ . generating ideas for and enabling the funding for the annual programme of\nae projects. Much of these projects were spawned as a result of the publication of\n. the versions of the Regional Technical Strategy Europe (RTSE) and the Railway\n3 本 Standardisation Strategy Europe (RSSE).\n; There is an appetite amongst the European members for these regional projects\nto be expanded to other UIC regions and the Regional members welcome the\ni ae ot idea of the inter-regional exchange platform to decide on priorities in terms of\n- _ development, exchange, and common standardisation activities.\n. ae UIC has published a wide range of technical documents with the first Leaflet\nAne having been published in 1926. Since its creation in the late 1980s, the European\n= , Standardisation Organisation CEN_CENELEC have been offered the opportunity,\nvia a Technical Cooperation Agreement, to have access to these documents for\ncontrolled inclusion of relevant text which can be used in their ENs.\n/ 29°",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 30,
      "text": "The Region pays particular attention to this interface So as) == same = ey See .县 aa\nto ensure that opportunities are maximised, costs minimised AAERelelel lel) AIC SINE [Maa aaa AARWALS-PRICHOOY Au\nand that there is no unjustified duplication. al ee ay =e eae 7\n\n“ode . , 。 。 * waliassave'ves) 2:— iS AFR wie: re . ve\n\n> Building on the Region s current action plan (see image) and a wey peer i> ; 0 全 站\nin clear Support of this more generic UIC Work Programme, Vey bot . Le gee ry ,\nthe develooment of collective and collaborative thinking on —e_ on . a -\nidentifying alternative sources of traction energy will con- <a p ,\n\n1\ntinue and contribute to the overall target of net zero carbon ban iafly Wy \\\nemissions. This will be in support of the work being undertak- ara a” a = \\\nen within the Energy Sector of the Railway System Forum. . te = 也 Ny :\n\n» Advocacy towards the railways being the backbone of L me \\ yj 六- ox aoe |\nsustainable mobility has manifested itself in current work- of re. >, w ° . a” , a; |\nstreams for the development of freight and support by the 一 = a 7 a. / 下\nRegion for the work of the Rail Freight Forward Alliance. 的 “oY Ba _ a \\ ly i\n\n> Innovation is a clear golden topic. ERJU is covered else- } yy , het | . _ ¥\nwhere in this Work Programme but the European Railway * By a) ~ -\nResearch Advisory Council (ERRAC) is fully supported by 4\nthe Region in terms of resources (Chair and Secretariat) S. “ 3\nand a financial contribution for meetings, website, publi- ; m ae une ee od\ncations etc. The Region will continue to support this body. . , 4 —\n\nRegional Focus 2022-2023\n\nStandardisation Sustainability Looking forward Innovation\nMonitoring progress in projects\nEnergy: considering new solutions within EU-Rail JU\nInterface with CEN, CENELEC, (batten, hydro carbon Adapting to the \"New Normal Rail Freight Forward /\nETSI, RASCOP, ERA TWG, etc. ry, nycrogen, etc. Liaison / cooperation with other Digital Platform\n, , , Advocacy towards rail as the regions through the meetings of\nRelationships with NSAs for AMoCs backbone of future sustainable the Regional Chairs ERRAC Governance\nmobility Engage with SEESARI and other\nEuropean Special Groups\nMember-focused high-\nlevel exchanges Cooperation Communication Meetings\nHigh-level exchange E institutions & Promoting the elements related to RAE (2)\n2022: DB (16/02), PKP (06/04), —uropean instlullons the “New Normal’ and the added EMC (4\nNetwork Rail (14/10), FSI (21/10) organisations (Associations (CER, value of transportation by rail (4)\nEIM, RNE, UNIFE, UITP, etc.) . . . EMCA (4)\n2023: VAYLA & VR (19/01), LDz & GRB, EC, ERA, ERJU, etc.) Communicating the evolution of\nBaltic companies (21/09) core topics for the region EGoA (2)\n1 30:",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 31,
      "text": "NEW REGIONAL STRATEGY\nCCCI\n>» SEESARI (South-East Europe Strategic Alliance for SS Cc ~ |\nResearch and Innovation) is a UIC Special Group which . Ys %\nreports to the General Assembly, but which has very close oe JE: » _ a eT |\nties with the European Region. This will continue to evolve. ! Ai Vd ‘\n> Over the past two years a programme of High-Level 一 本 好 下 Pose: “2 th ~\nExchange Meetings (HLEM) has been established involv- 本 * 区 “a 闲 4\ning companies such as DB, SNCF, IP, PKP and Network » f 人\nRail. pe, | re\n- Wha\nFor 2023 HLEM are being arranged in Finland (Vayla, ~ M4 ‘Zs\n4 4 =\nVR...), Germany (DB), the Baltic States (LDZ...) and Spain. x 、 mw、 —: | 二 »\nThese involve a senior UIC team being in the country in- h so —_ = >\nvolved and spending a full day with colleagues from the | .\ncompanies concerned exchanging on a range of topics\nfrom innovation through to sustainability and the freight x 人 AR 一 一 ~ 7 er, Z\nand passenger business activities. “Sg ~~ TM. po Saye aa —\n>» There is a myriad of other railway-focussed associations in SS a Og Fo 一一\nEurope. UIC Team Europe has interfaces with all of them and , eee ,\nreports the high-level issues to the regional meetings. This is Bo nm ]\nimportant in order to maximise opportunity, minimise cost Ff ; oa fe Kou ay a ae oS\n4 RE Mane _ ee 一 ,\nand avoid unnecessary overlaps. . 1 = eo ae -\n>» The Presidency and the governance College will change ae re\nat the end of 2023. The regional focus will be adapted ac- i\ncording to the perspectives of the new College for 2024 和\n& 2025 taking the objectives of the UIC Work Programme ~\ninto account.\n, BIENVENY Se Oe eae\nPE SNCF orm “Se ey J\n3 uptetey hn ~ -- ug - oe . :\naia bon 1 CR 3 yo - i | , 4 ¢ 、 dc :\n31 :",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 32,
      "text": ", . en he ‘ Tie Se ,\n4 as im -- -ev ze, 一。 | . “ . U\n“e 1 . a = 1 ’ ; e 图 - 四\n. 6 ' Se ety!\n. a Ww 、 , WN we\nvs 册 机 oo .. , | _ _ _ Mg: .\n8 fe: a ee 1 tag | gt “7 __ 了 ie 7\nDe ‘ se 路 一、 一 了 g& ” , 1 - if\nye ¢ ' “ -\n. . “a 加 ' —-\n、 “We , : 和 oe . ma\" x rd\nU ue : “ . al a an\n| ] | cat awe . Ife. . gg” . ae . ‘ ae a a = v “ . a “ f 一 。\n此 4 oS oe ie ee a a an 。 了 a .\" | ie, ~\n; 一 1 A a , A 站 “ 、 ” oo . ,\ne *e. - 一 Pd ; a a , , 1 四",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": true,
      "garbled_reason": "empty",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 33,
      "text": "NEW REGIONAL STRATEGY\nIII,\nae _ REGIONAL ROADMAP\ntrees -\nof ge, ae Today the UIC members consist of two associations: the Latin American Railway\nae wwe = ra Association (ALAF) with its headquarters in Buenos Aires, and the Brazilian\nee eo oa National Association of Passenger Rail Operators C(ANPTrilhos).\nf hie we a UIC was able to gain insight into their railway’s potential for development\n-~ ai 加 a 四 through the visits by the Director-General and the LARA Region coordinator to\nRS 人 multiple Latin American countries, as well as meetings with leaders, especially\neee eS: transport ministers, to take place in the following countries: Argentina, Brazil,\n= - ee 四 Chile, Paraguay, Uruguay, Colombia and Ecuador.\n站 Sc - 7 The meetings in Argentina brought together other potential UIC members such\nCs ; a as Bolivia, Guatemala, and Peru. Certain Central American countries might also\nwe _ be interested such as El Salvador, Honduras, Nicaragua, Panama and Costa Rica.\nwig eas ea Following these efforts to promote the Association, Chilean railway operator EFE\n* Se oe and JSC, the Argentinian National Agency of Safety will respectively become an\nee ne TS = associate member and an affiliate member of UIC as of 2023. A large number of\ngee ee potential projects have been identified where UIC can assist the members of the\neas region in their implementation.\na Exes To this end, in addition to maintaining the relationship with current UIC members,\n‘ _ ees UIC has hired a person in the area to work on subjects of interest to the region,\nY 有 = and constitute the beginnings of a UIC office there.\n\\ a 、 es The region’s needs are substantial as the national networks are either hardly or\n7 \\ . \"Rg not at all connected, and there is a real lack of best practices and standards.\na , Be ae",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 34,
      "text": "- LN Dy. . 本\nGoals for the 2023 - 2025 period include: eR: 4\n> Developing a Vision 2050 for the Region to foster , 4 | ¥ , ‘i Rat\nthe growth of rail in Latin America, an) | | | |\n>» Creating a network of experts that could support an . . on ; \"\nincreasing number of railway projects in the region, . 7 4 人 i\n>» Sharing knowledge from the UIC working groups ‘ ” 了 . ab\nand from international standards, | 5 | |\n四 ' 1 !\n> Creating new group to respond to specific problems . } i | 4 4 | se ~\nin the regions (e.g., asset Management, safety, and 7 - »\nenvironmental threats) in coordination with the UIC —\nRail System Department,\n> Creating a working group dedicated to freight 、\nactivities in coordination with the UIC Freight\nDepartment. Seniario Tecnica Pi\nA \"5G - Nuevas Tecnologias\nds Aplicadas a los Sistemas\n- m ° Ferroviarios\"\nJEAN-MICHEL EVANGHELOU\n一 oy 17.05.2022, 10:30 h Buenos Aires, 16:30 Paris\n. y , ma ! ,at uta di\n\" 7 机 “3 - 。 | | , 县| | : z 一\n< _ |\n5 cain’ ~ . ; . 5 i ‘ , Se. \\ ; ¢ ao\n=r se , =~",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 35,
      "text": "NEW REGIONAL STRATEGY\nTT LCCC\n~~. -_ TT\n- = 有 . . — :\neneca | _ .. \" car 只 e 8 . acute eet 4 : : “° Cimon avoran Bah HET\nfee ' q a, 网 rey bad 7 . fi “ 了 . ‘ 7 四 vo s \" 全 ' 大 A % a ge te aaa ay ro\nLae set al 1 Mee ey Ae. alk : oo hice u LMR un pay cea 0 sob, i {> rye ao\n’ “, f . cn 2 7 my, atta Pee od. 13 ‘i ty 人 ¢ : as! . } . | sys u mn! . da 局 Lada ff ! 、 , ad\n4 . . 1 1 , 由 网 f : . : ‘ vf f 4. ‘. vor ’ :\n多 é\n\\\nBN “ ) a eae\n一 s 让1 hn Me LY ye 3 Fy AR Oe\n~ ys on meet 人@ 1 ‘a HF ’ “ ~\n‘ (A AE oo ceo} -\nary Ba: _, = [~ gs a\n: , aa aa > ,, © oe 并 :< gl\n-35 :.",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 36,
      "text": "一 . 四 二 --\n\" - = -\" rad 一 2 = ‘ie, _\noP - ee hh. ‘ - ° ie he crt rom\n, >. 。 - , 1 t 上 ea\n罗网 Sa td 2. = r- ~ , ~ Ts. _- oa, ; !\n“ 局 a - . v - - 二 二 “\nLT ae we Fo Name ee re ett. a\n_ ae. 7 ee ce soe -- .上 bs Se = a) ee amy he . oS\na4 et. . ' ar - me a #0, P 上 nie ae pare > aly al .\nrv. Bt. 7 . - 。 + “> Np -tee “Th\nt-5 “8 ge ae %, ae ue, ey 4 Se 地- . Y . om ,”- * a oo. ‘> i” fs wells : >a es we “a4, ” 二 3 一\n‘ - io : ‘sh, . Sa \\3 . : : rie. - . + ors 二- oe , VR - we\n7 了 a“ | a ato 1 ~~ os nl 1 i bo Pi . . . ¥ ee > = Le 人一,,” m a ‘or oc tn + oF : re - °* ** 3 . ' Thy\n« oe 办 ¢. “ a] oy Ts ree 险 1 -_ © 0 we = “a; att ae, ‘, Sit Ty. fe4 i en Loe , =, ae ,\n- .了一 = 机 rs 1 a = . ne ; ras Se or 4 . 5 a. '7 LX\n一和 _ aN 3 a , a oe re - . . we be ABE . hae Tle fe. 75 ee ee a 1: a\na . rw Py ae oT “4 - “ = . ay * wee ab, Pe aye - 7 ee ek SS ind DA | aT a= . | “he\n, =e x ”~ € 站 5 a ae CA ty = . “= a aes ir “ae _- an 二 4 a >. wt: AS\n的 mrs, 1 Pee, >. pee eA cs, 17) Sar ae ~~ : “Ir oe > eee ‘oe 7 “hr 1772 .AI ket a te > :\n* Ein : v4 ty 2H 2, ee . -和 Le 人 - “fee Ne We a Se we. _ Tt — ar\n有 一 or by eS ere: ! aa -了 0 B- aR, ie 人 “i aes\nBe Dt eS oa a oe rit ve . a, . ‘ seg a -站 rT. vo: Aa Fa 1 .\n\"a tne “ wae | © att ... ope at oUt yh i CM eR\n. oe See ' wy ’ . : 本 a a ren ie amy uy 在 eee ‘he\nee ° = . ba = an : . A P ‘ . 4 - is . a . 5 an : - “ 了 ; ‘ - oe ‘y a\n° - ' . aad . . oa . ye, 四 1 :, oh. rhe . of\" 四 aa ie 了 v.. : . . . _ 4\nbad a aie tho. \"ot : uefa . ae ten, ty . Le 1 四 a a. raed vi ot “AN,\n. fh te -! “ . at Hy wy rc a) Sd : aan . . _TM 1 4 - Ue cf, so. a\nvs - a : : oe : ). Sah pol, . hn a ak) ah. - . . ‘= Cel oy :| soe 1\n= ” . : 可 4--, oe | = _ ”. , ch ri a . YOTe ts % . , a: ar a Le .\n, | a en We 5. ,- ae . - Tor . i 一 . pete tT\". ‘lee , r\na 1: a, , : . . - : > on . a , aoe . . on .\not aiid ats , “4 : ; wt ‘lees 5 a me . ~, - . ; we ; * . a. aa re 本 . T> | . c\npau. 机 人 og \\t \\ _ , . . : . ee op. “a oat . . . rt . —_ a . : : a ,\npo hay 3) - “y - , “ 4 “en, , : : . , ‘ : | 。 . SS 网 1. . - '\nar 7 oN .'* * UT hres . = . carey . . . . . ~' Ls . U . -\na - \"Ty! a Sota - 外 和 , 1 oe - : a . , oe, | 1,. 上 ; ta '\n+»! . Mey . - Lo, | ’ 7 ona wo aan J 1 } ,\n. . . 于 ,, : a a ' - 上 oe ; , - | rod , .\n- . oo . + aan awh. = (a . . . a 3 , “ .\nwee ‘1 . ‘ me ee \\ .\n. , . : 一 a oa a’ 2 . ‘ os, 的 ae . :\n, . Soe, ae: dat - , 2 ee a * sO\n站 , 四 , 机 和 . 人 二 em . 全 1 te _ ; a i \\ -= . . ;\n“ bb : 一 tone . . me, 人 . . .\n1 。 aed Te, A Tn oe a! Dee, - wy “eo = ~~ 3 e. oe\n° . CAs, A, fs ee “_ = tah Te Me wee, a :\n: + t “ & 4 : 4 AY > ve ‘ ‘ a . ~~ vee nee SE, ST\n从 和 ae Jt od Ms te ity rr\neho Bate a GU wp ne aS et a ia\n. poo ae a hie ee : ce ye, BF on Ee\n: 4 . . mG a nr ee ee Cua & TW “ae “et 5 2 Se 站 “wae\n, 和 hg 7 Lt . Sooke . , oA SAE\n. - i. 四 . . a © L ;\n1° r, , \\. ‘s\not 外 ,, . .\n7 uo Le how\nin ; a - , ' -",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": true,
      "garbled_reason": "empty",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 37,
      "text": "POE Crip ae wae\na Au - ul é fe _ vo .\nPr Oe a alle Fea ar NEW REGIONAL STRATEGY\na “aw 4 SE» ee Zs a\n” tha ¢ 7 o rs os Je 要\ni: 2 . , } ' 、 村 . : .\nSr Re REGIONAL ROADMAP\npe | FOR MIDDLE-EAST\nnT, “ts sa 、 四 } a The UIC Middle-East Region comprises around 15 members, spread across almost\n“ot 有 a? Po rs\noo . , ; Ran : 人 all of the RAME countries, which are: Turkey, Iran, Saudi Arabia, Iraq, Jordan,\nPy A ar Ve . the United Arab Emirates, Afghanistan, Syria, and Israel. This is a very dynamic\nrn region for the railway sector, with new high-speed lines and trains, infrastructure,\n: ‘i : r ‘ and services being developed. All of the countries in the region have plans for\n| 7 the years to come.\ncost 由 , Two new members will join this region end 2023: Etihad Rail from United Arab\n机 orn Emirates and Oman Rail.\nay 了 , Incidentally, transporting goods between China and Europe via the southern\nan ae { . corridor, going via Iran and Turkey in particular is becoming more important.\n四 ve. goa Despite railways not being developed at the same rate across the board, given\n7 pt : os Te ae that there are geopolitical, strategic, and financial differences between countries,\n. ae 的 ga Ts UIC has seen a resurgence of activity thanks to the leadership from the Chair and\nBR Ee ; Vice-Chairs who have given a new lease of life to the region’s activities.\nane . The regional roadmap for the 2023 - 2025 period follows the considerations\n有 outlined in the Vision 2050 document produced by the Paris and Dubai-based\ncompany IEC and delivered to the November 2022 RAME Regional Assembly in\nAbu Dhabi.\nPo",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 38,
      "text": "The main initiatives to be carried out in > Creating a taskforce on safety, fo- > To aid the region’s development\nthe 2023 - 2025 period are: cusing on the Middle-East, its projects and their financing are\n>» Creating a working group on goods =» Developing a network of security to be better taken into considera-\ntransport. The main points of inter- experts, notably to address crisis tion. In May 2022, the decision was\nest to be developed in the coming management, therefore made to slightly raise the\nyears are the following: > Participating in a project to develop regional share of the regional mem-\nee bers’ fees to allow for new projects\n> Digitalising procedures, hydrogen trains,\nto be launched after they have\n> The safety of goods, > Creating a working group to assess been proposed during the regional\n> Standardising rules for exchange, the needs linked to the development meetings.\n> T fi tai of telecommunications,\nFANSPOTLING CONLAINELS. | | All these projects will produce concrete\n> Reinforcing training for subjects of\n> Creating a taskforce on extreme | results for the RAME region and will\n, interest to the region. The plan is to\ntemperatures and desert conditions, , contribute to the cohesion of the\nhave a training session every three or =\ntaking the inevitable effects of cli- . i, region’s members who will have shared\nfour months with the participation of Oo\nmate change into account which will objectives.\nexperts from all around the world,\noccur in the coming years,\n30\" REGIONAL ASSEMBLY 从\nMIDDLE-EAST\nmr we ft\nWAFER ATC Tbe bei 和 syn\n, - — 6 ‘MDLY EASY OG a §\n和 ‘ay f ¢ awe 7 a = a 小 — > a , \\TM\nPs i ; > 过 ’\n4 av - ae . > ; { \\ \" ‘\nI ‘ 、\\\n| 38 :",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 39,
      "text": "NEW REGIONAL STRATEGY\nCCCI\n-e SE tee 了 / 3\n、 一 _ .\n| | |\na. wh: -s 0 fe",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 40,
      "text": "四 - re 加 an VA es toon .\n一 we Ot we\n> a he ot oe a’ a , , ee he 1\nat 是四“ Loe ; ager\n: igs - , Pat J\nne 7 a 、 FR ss SM bs ee SEAN led ks — ae\nrhe oe a so BY re a fhe we. am ON Re gaa re Be ne\nwe HB Be SE 四 和 0\n2 ae 、 es , te ” _ ; SE oe ake ye es Cor Arie soi a { coe a\nne “ar: 。 1 iter oe . hy wm ens 和 8 These Be toy ne .\nen ay fa * 7 ' en ee mene. te , 23 Ss a an -\nig =\" x. 2 , awe | ss ~- . a “ae he SS Sr g --\n“0 oe AE My. , \\ i —_ ee Nee TO Beg ag\nee an . i * oe, eg TR TEAL. a ,\nokt ‘oY Sp? b 2 “0. \"et ie oy ce ats 加 、 Se 31 f ° . eye\nee ae 和 | — es ee\nye ‘Co 人 : a ms ere 了 AAA 一 a \\, ee . 7 . , i ~\n| al ae Barras ssp _ s 了 hee 2 St te wr ay , 人 . . =\naha ne CA Bod, . ee\neo ~ ee 4S | Sy oe ae ay v , 和 加 ae . wo. am\n“Re a 0 | hae ae = Ce ae a es nf ae a 人 、\non el Pe ae a bed eae CC ie a a {\nee ee ng Pin “tre , eA uae of . a y+ cae cf! a aa \\- 3 : 1\n, og tea: we ye 4 i > ohn ‘ : “7 -} ~ : \\\neo Serr. ST Sy /- ae oR\" Bite hi ae oe . ~ ae. ‘ \" -\n. ” hal ‘ aA i. , 4 =e ; ‘gr a ; ” tf , oy] ‘ . , ” -\n区 ad \\ 2 7a mar, any “4 7s ae ey , : ey me. “ .\nee SPU a ' Zn oP ee ES on ih =: aoe > 7 ry a id \\ Sa\ney tae J, ad En oes I ne. in tg 。 rhe of ”, < . > -\n. om’ ne , to a, A J \"aaig< RY aN 人 . ‘ ne os Lo . a ae . tf .\nae eM ee 时时 : tal ae Cs ey oO aa jee , 7 2 7\nme a ‘ Pa ae AB, rn _ ae , j Pan a yon, iy ro leds . 站 . . ‘\n. aa 7 a 4 + a, a nrg Pi SS ine we : crs - Sa “Any . eT",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": true,
      "garbled_reason": "empty",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 41,
      "text": "NEW REGIONAL STRATEGY\nIII, ee\nBry FOR NORTH AMERICA\nML awed ot tee Despite it being a very large geographic region, the North American Region\nee ee comprises very few member companies.\n人 : 3 ; . 2 These members however cover the entire region as they are representative of\n四 an the largest Class 1 freight companies (AAR); the largest Pan-American passenger\n: — *. . ; company (Amtrak), the American Federal Railroad Administration (FRA),\naan 7 Ce Canada’s Railway Association (RAC), the Canadian passenger company VIA-Rail,\nfos ue : aa rs California High-Speed Rail Autority (CHSRA) and the Regulatory Agency for Rail\nPoe Fe EL Transport (ARTF, Mexico). These form the bedrock of the region’s structure.\na Bee a “3 ' & arenes Amongst the topics which the region wishes to tackle in 2023 and beyond are:\na gk mR Lae cage Toe > Standards - understanding the working relationship between the AAR and\na ite: UTI a foe UIC publications and developing synergies,\na a i eg , “ x) > Sustainability - advocating the railways in the region as a significant part of\na ee nee the reduction of transport carbon emissions,\nye al oy Th > Stations - developing the station as the welcoming and SMART first point of\nees contact for the end-user with the network,\n“4 ner i oe _ oS > Cyber Security - working with other regions to stem the impact from possi-\nCR:\nSN = aa as: Inevitably, as the Region grows its interests, there will be additions made to this\naa TM . i pe ye route map. There is a plan for the annual Regional Assembly in March 2023 and\nI ey me . Cat , for this to be coupled to a High-Level Exchange Meeting like the ones that have\n. a z ' ; ; 2, been arranged in Europe.\nrn Sa\n‘ 1 , . \\ Nady",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 42,
      "text": "On the issue of railway stations, the key\ngoals for this period are to better define\nthe role of station managers and study\nways of improving quality with the\nambition to use the gains of the digital\nrevolution to improve the services to\nthe customer and the efficiency of the\nstations.\n。 As Stations are the gateways to the\n. urban public transport network and to\nof the long-distance rail transport, they\ncet “i also play a key role in fostering modal\noe tl | shift to rail.\ned OF °\n‘ |\n4 . _\na A\n7\nVos x\n(42:",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 43,
      "text": "NEW REGIONAL STRATEGY\nLLL\n1 o - ° ‘”\n. “ ee, ' a\not Yep UM og , a 一 -一-- .\n®e oo 1 -一 —\nbs | hemmed cos — i o. a\ntore woes OOP. 一\n和 TE a ety 了 了 |\n64,43 _. a Pt le eae 4 ; j _ i\nye oS 0\n- is valet,\n43,",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 44,
      "text": "oe ee\nTe\nar\n- 上 o oe\n~ . : vet soe oe ha 加\n' 2 “ a , : Soe ore\n\" . . Res\noo . Ty am cee . . a , a : oe oot ‘. , ag . “A.\n. : 1 Sa , Coase\nay 2 . ba . wey + <\n~ay - 1 机 mTM\nesr _ wl\nF “ PP ” an :wj es ce a SOT, ae ae . “ hele oO\n; 一> ee- tee cmp 一人立信全 -u A. oN . ” ; - 2\n, 5 了 | ’ a Fv : 可 bw idee 5. ae Cal an oe . 7 , } _ s Tv . we Ee ie - m te\n, 4, rz, + fogs Qe . ca re {se She 3 y A _ wet! - . a - -| 4\nta ee La 7 GS an BD A . 、 , 天 fare\nwe 2\n~ : - va cele 4 * . at 一 rr nT , a fs 2 a En Lane, . 本 hag ry Keres “Nb As 、 .\n3 . “= ' aan - ~~ Lelie’ . . : oo , we a be met its, wt, ans n\" a %, io . a “sy . ver ae e LO atone ce a\n<— ‘| Lue Un fp Be Oe ARES Sos Te Sob PRE Ay aT Rte 3\n- Tay i eo wy ie. 加 . eee ol I. 8 So oe Sa awn 、 3: , se Lue 加 . a gs eye:\net RSF re oe mt RE ae oe OO Beep l oy UR 3 woe UE TR -\n\"7K ye ye 6? Ga Se fay er TO. - se Soe . ot . a 2 y ote mae eM ,\n. - y ee. ee 4 an ” 二 + a ,. - a aoe a ., al , alls a. , ne en 7 de!\nao ~ oe Ee, ee 念, aoe cee 四\n= Neg rw . arn. yt ae oN “pe “ eae eo ute we 2 Bg : coe a 3 了 - as\nPn mg ae a +> Sa At o > 、 , Reams. . F a a , wo Peer =~ yn ee a oe ee me 1\nNed » ie <i . ot: ae ; - 3 r oy , ' Se aa CE 四 a :\n用 “sy we ies > . 4 、 | aio / ” S : . nm , DA ‘. 人\n4 a ~ oe . ys 加 . . = a . diy ~ we bog, See\n~ so : - ar ‘ age . RE! Hen oS BY Sake\n4a “ , ¥ , mes i tee _ to a Pee a OR\nNS Ne om se TM Bes. Wag OMS\n: ae . + = Sans, Nee\n. a . oe y “- NBN eo. ~\n” .” ‘ : ora, ane s, .. Sant ng: ror Be a ~ fy -\naM so “os . RN RPA ww ° < x ,\nq . 中 ae OS -- Ponda awe. 4 wi —\n- 1-",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": true,
      "garbled_reason": "empty",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 45,
      "text": "SUSTAINABLE\nCARBON FREE\nTRANSPORT",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 46,
      "text": "Ss\nSTRATEGIC OBJECTIVES OF THE\nSUSTAINABILITY PLATFORM\nThe UIC Sustainability Platform of UIC provides focus and UIC seeks to maintain momentum and continue to deliver\nleadership for the Environmental and Social sustainability | breakthroughs in the following areas:\nagenda in the global railway community. Those engagedinthe > Raising awareness among policymakers to design policies\nSustainability Platform work collaboratively to both promote to incentivise rail,\nand to keep railways as the greenest form of collective and > Inspiring and empowering the railway sector to become\nmass mobility. even more sustainable,\nThe platform shares a vision of a future railway that is the & Advancing innovation in the railway sector,\nbackbone of sustainable mobility. The platform is working > Attract investment into railway projects,\ntowards connectivity that contributes to healthy ; and > Collaborating with and engaging civil society representatives.\nsustainable lifestyles and economies on every continent\n- for a railway that is zero emissions, resource efficient, a This is achieved through:\ncommunity hub, accessible for all, and is both biodiverse ” Conveying the positive environmental & socio-economic\nand a good neighbour. externalities from rail investment,\nThe mission of the platform is to empower the global showcasing leading solutions and approaches,\nrailway Community to be a driving force in a transition ” Demonstrating the growing ambition and action to drive\nto a sustainable carbon free transport system through more ambition,\ncollaborative knowledge and advocacy. > Demonstrating how railways are a critical mobility com-\nponent for climate action.\nThe activities of the Sustainability Platform align to three key strategic objectives:\nADVOCATE CONVENE SOLVE\nTo build collaborative partnerships\nand be the voice of the global To provide a trusted platform To provide practical solutions\n\nrailway Community to advocate for for the railway sustainability for sustainability challenges\n\na multimodal vision of sustainable community to connect for a future railway\n\nmobility with rail as the backbone\n[| [| [|\n\n| 46 :\n\\ . ae",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 47,
      "text": "SUSTAINABLE CARBON FREE TRANSPORT\nLee $= = - -\nEach year there will be a strong presence at the With our Sustainability Reporting Tools, we\nCOP (28, 29 and 30) and key regional climate plan to continue to collect data, set measura-\nweeks. We will coordinate the global voice ble targets, monitor progress and encourage\nof rail and facilitate opportunities for leaders transparency in the sector. We will produce\nCommunicate in Our Members to share their ambitions and an Annual Sustainability report, demonstrat-\nstories of success at this global event. ing the contribution that rail is making to the\n“More Trains” campaign will evolve with new UN SDGs. We will create the new sustaina-\nregional focus, for COP28 the Middle-East bility reporting guidance (IRS30330) and\nwill take focus. Global Data disseminate its helpful content globally.\nThe Sustainability Task Force will refresh The EcoTransit and Ecopassenger tool will be\nmembership and continue to work glob- updated and maintained, and we will develop\nally with senior rail leaders to promote an API to expand this useful data to other\nLeadership Sustainable transport and advocate for the applications. The Environmental Strategy\nrole of railways in a sustainable economy. Reporting System CESRS) will be re-branded\nThe taskforce will facilitate an annual London and promoted to global membership. The data\nSchool of Economics keystone project to will be licensed for commercial organisations\nsupport the “More Trains” campaign. to support the maintenance of the database\n_ and expand the use of this important data.\nWe will host best practice workshops and\ntechnical meetings. We will develop and\nTechnology maintain websites where the best up-to-date\nWe commit to organising the first information from our activities will be availa-\n“Sustainability Action Week” in 2023 and plan ble. We will create a new Sustainability hub\nto conduct this event every two years. The aim acting as a best practice library.\nIs to create INSPINING and energising events The technical departments and platforms will\nEngagement and achieve alignment and synergy between\nthe technical specialists working in sustaina- . work together on transversal Issues such as\nbility, This will include the UIC Railway Noise Collaboration energy, gender equality, Infrastructure and\n. Interfaces with Rolling Stock, climate change\nDays which aims to promote cooperation . . .\n_ ; adaption and sustainable stations.\nbetween acousticians and track engineers to\nsolve noise problems on railways. The Rail Sustainability Index will be reviewed\nWe will continue with our long-standing annually, adding new SDGs and KPls. New\nwork in hosting platform and sector meet- modules will be considered and developed\nings for Air quality, Energy efficiency & CO, to reflect the needs and demands of mem-\nEmissions, Sustainable Land-Use, Circular Sustainable bers and partners. For example, for exter-\nRecognise Economy and Noise and Vibration. Finance nal/supply chain use and projects. We will\nWe commit to recognising the efforts of forge links between the Sustainability and\nour members by organising an International Finance Platform, developing the capabili-\nSustainable Railway Awards every two years ty In Sustainable finance and agree a work\n(2024), programme.\neC eC\n(47°\nNL",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 48,
      "text": "POSITION VS ERJU\nThe projects will be proposed\nwith reference to their\nconnection with the Europe’s\nRail Joint Undertaking every\ntime it will be possible.\n— Nevertheless, UIC\na * | } 7 is Sustainability technical work\n; | ga will continue prioritising the\n“or - — \"da a 。\n一 Pa 。 - vt a: . topics that are the greatest\n= 人 2 frie == ae _ = th 7h 7 challenges for the global\na Ne FS 点 i : membership. We will then\n2 f nT\" >= = a > showcase through our projects\n= ee an | 二 人 =, fee. , how railways are increasing\nosm: Ty 各 Big. A a ae . . .\na. = —= =e : xz their compliance with the\n= —— _ : : » ree in werk >\name 和 NSpcs\n7, =, .\n\\ SS . ft _ ! , - ye\n- i . f ww\n人\nvi | NM rertae y \\ 外 全\n一 了 -全 有 , ‘\\ 了\na= ee 亲 «4\n4 ; Ss MoreTRAINS\n3- (me | & Global Rail Vision 2030",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 49,
      "text": "SUSTAINABLE CARBON FREE TRANSPORT\nTTT Lene |\n\nPARTICIPATION IN THE\nREGIONAL STRATEGY\nRegional Meetings Regional Projects\nA programme of regional For projects with sustainability\n“Sustainability Days” will be themes across all regions, the\norganised to keep members UIC Sustainability Unit will\nupdated on all our activities, provide a link to ensure that\nto better understand the local efforts are not repeated but\nchallenges and priorities and strengthened and supported to\nto showcase local action and embed change in their regional\nprojects. context. The Unit will support\nWe will support member inter-regional connections and\n\n. . collaborative learning, opening\nengagement in regional il oot- ect d tools t\nUNFCCC climate weeks so i ne “in projec me iy sto\nthat they promote their stories a € regions and members.\nand plans to transform, build Regional partners\nresilience and decarbonise . ;\ntransport in their region and We will forge partnerships with\nset out the key levers to regional multilateral banks and\naccelerate climate action. UN bodies.\nDevelopment of knowledge a >\nand skills transfer :\nWe will develop partnerships 加 \\\\ YZ\nin order to expand our ; Be , ‘ae a\n\nni , Idi (ee erunited Nations OP = 2\ntraining and capacity building V My Sra EL etc 一\ncapability to support our \\ L Y (Climate Change EGYPT KL, \\ Se\nmembers. We will increase =. e gQ Re A\nour special training activities - : 由 本 o “ 加 3\nto support the competencies é y “2. > ae ; 了 M. 和\n。 化 . row fia ue je\nof their employees on A a a hs oF a 5 ,\nkey sustainability topics. ” 3 | e } % 1 @& “ a“. ®, , ;, =. ®\nOur training will provide 7 , 二 - | 4 & 中\nknowledge development an 4 m J\nand skill transfer for experts 1 4\nworking in UIC member — | ,\ncompanies on environmental q\napplications. ° ,\n' 49°",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 50,
      "text": "a -—\n7 a -\n= t\nr-\n2 a .\n. ’\nF\n。 。 一一 oe\nos 2 一-一一人 RE 四 *\na\n. _ ne a -一-:.E=一-- - c es a Ba ye\n一 oa ; _ 学 、\nae\n—_—. ~ ——, 7\nod 时 了 ‘ : ” 、 , ‘ “&.\n° ' ou . et\n; ¥ : . Us Sei pee el } a. ,\n一- era ee “网 ,,\n@ .0 aie >\n» =y ad - . ~ ~ _ 二 yen | .\n时\n. rad\n2",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": true,
      "garbled_reason": "empty",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 51,
      "text": "TOWARDS\nDIGITAL RAILWAYS",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 52,
      "text": "TOWARDS DIGITAL RAILWAYS\nEs\nIn alignment with its global strategy, UIC will keep on focusing Among the main digital railway programmes, projects or\non all the dimensions of railway digitalisation, with two major _ initiatives that UIC seeks to highlight and materially develop\ndirections: in each department, platform and forum, it is essential to\n>» The promotion and the dissemination of digital concepts Mention:\napplied to the railways, in the frame of international and >» FRMCS (Future Railway Mobile FRMCS\"\nregional actions, such as, but not limited to: Communication SysteM) ProgrAMMe: jrvcssussssnietenruneseen spe:\n- Participation in major international events (Consumer UIC is leading here the specification stream for the re-\nElectronics Show CES in Las Vegas, UIC High Speed placement and evolution of GSM-R by 5G technologies in\nCongress, etc.), the short term (first pilots expected in Europe by 2026),\n- Organisation of Digital Tours with representatives from but is also heavily involved in the corresponding indus-\nUIC members, trial stream for the preparation of the FRMCS ecosystem\n- Organisation of specific regional events focused on dig- (5GRail project),\nital, as for instance the African Digital Rail Congress (4\" =» OSDM (Open Sales and Distribution Model)\nedition expected in 2024); programme: UIC will increase its activities 9\n> The development of specific projects dedicated to digital around international ticketing, particular-\nrailway in which UIC can bring its specific added-value to ly regarding multimodality aspects and OSDM\nthe benefit of its members, and this regarding different extend the opening of OSDM systems tO crersirsrs SetburonMose!\ndomains: more distribution channels,\n- The technical aspects of the rail system in general, > Digital Platform for Freight: UIC is engaged at European\n- Passenger activities, level in an ambitious initiative aiming to define and put in\n- Freight activities, place a set of digital solutions to improve the commercial\n- And also some multi-domain digital initiatives. context and the operations of freight,\n.1 2 We > Digital Modelling: Through its RSM (Railway RSM\n—_ “ ~ System Model) and OntoRail (Ontology for Rally eemamone.\n. ' G ‘a an 8 i Rail) projects, UIC seeks to facilitate the\n\\ 5 BG . Fins ag | convergence of the various models existing\n\\. A - 性 、v 1 in the rail sector towards a CDM (Common NT\nom | ‘f an Data Model), RAIL\nn Wes >- bys j > Artificial Intelligence: UIC is also committed to this new\ni ' ce) a r , 上 and complex railway challenge, with a dedicated project\na ‘ | focusing on the concrete application of artificial intelli-\ngence for predictive maintenance, partnering railway ex-\nh : i ; | perts with artificial intelligence specialists to learn lessons\n三 eee ee from other sectors,\n:52 :",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 53,
      "text": "TOWARDS DIGITAL RAILWAYS\neS —\n\n> OpenRail: UIC, together with three initial 2 i poet 7 ” |\n\nmembers, aims to put in place the first *\n\nopen-source foundation dedicated to the OPENRAIL 7 ~ | eT\n\nrailway industry, bard oo TEST aa 7\n> The railway system architecture and the relevant exchange oo A i | as b .\n\nof data for more efficient operations. & | 1 N ‘ vi id 9 于\nAt European level, the majority of these programmes, projects cor , ri\nor initiatives are or may be combined with ERJU activities, X & \\ ae\nthis being already the case for FRMCS and Digital Modelling. “故国 W LE\nThis is the intention of UIC to keep on assessing additional a We -. ORES\nsynergies with the European Commission and European 有 多 . Eee\nrailways, for instance regarding the railway system architecture,\nthe develooment of the OSDM programme, the establishment =\nof the Freight Digital Platform and the use cases of Digital WORKSHOP\nAutomatic Coupling (DAC). Future railway\n\n_ _ . 7 . . telecommunication 一 全\nAll these UIC digital activities will participate in the different in Asia-Pacific region vise - -\nregional activities, according to adapted timing corresponding i er\nto regional priorities and needs expressed by members. a 09 yWic’ 、 i mt\nAs an example, it is clear that the FRMCS programme has ~ “ie _ mate\nto be considered on a worldwide dimension, to be adapted .\nto the different regions in accordance with the members’ ee pe\nstrategy and involvement. - 四\n2 November 2022\n.53 :\nN77",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 54,
      "text": "二- 二-. . . ‘ , oY a 全 . : = 本 =\n2 ry y ~ = aw:\ner. oe ne: |\nTa ~~ _ — i ee\neer. 7 ee 7 . -! , -_ + ”一-一一 -一-人 — seo 一 : yi\n- _ Ae A , ee . Te wert, ee a ee nga |\nrite -. -一-- , 5 . Poo ae a, a Nes a ad > cs\net cert i » a ” 。 ‘ , = a” 9 Mew a\n. ~ > « 三 ° > 一 -人 ee ee ' -一\n_ en j « a . = 7 en: a 。 ” ” . j . a 一 有 2 on 一\n. 一 Te ww > _— 7 ~»” , - 更 ry 7\na ae . 一 . mm tt . as 四 x a , at . .\n= . — ” * # . \" ; 一 —\n- a . 本 a ‘y if\n‘oD a “ * ~\" f.7 . -— inte ra A S\n. Lo 4 owe, ee ae a 人 a . TM a .\nwoo? a ~~ y - - we 一 3 ee “",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": true,
      "garbled_reason": "empty",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 55,
      "text": "TOWARDS A SHARED\nRAILWAY SYSTEM",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 56,
      "text": "[|\nSTRATEGY & MAIN DELIVERABLES Concerning Innovations, RSF will place emphasis on:\n>» FRMCS (specifications and industrial stream) and digital\n\nThe Railway System Forum (RSF) will support the UIC oe lati on detailed in part 2 ) 9\n“Vision of Rail 2030” and will integrate, in a systemic 9: P _\napproach, major technical breakthroughs through its eight ” Reduction of energy consumption and emissions a Task\nmulti-annual work programmes based on Capacity, Quality Force on Energy saving will be scheduled end of 2022 and\nof service and continuous improvement of railway services, early 2023,\nand Innovations. > Development of lighter trains,\nConcerning Capacity, RSF will place emphasis on: > Resilience of railway infrastructures and rolling stock to\n> Traffic control centres and crisis management climate change, including design of new infrastructure\n\ng , and rolling stock, more accurate weather forecasts and\n> Automation facilitating the increase in the number of operational mitigation measures,\n\ntrains and supporting the cost leadership strategy: , . .\n\n, . . >» Acceleration of the cycle of innovation, through opera-\n\n- Digital Automatic Coupling (DAC), . . .\n\ntional rules adapted to market uptake of innovative solu-\n- Automated Train Operations (ATO), . . oo . . .\npes tions, and dissemination of innovative solutions.\n\n- Artificial Intelligence,\n\n- Robotics, The key enablers of the eight RSF multi-annual work\n\n- Automatic inspections, programmes are the following:\n\n- 5G evolution. > The eight multi-annual Sector Work Programmes will en-\nConcerning Quality of Service and continuous improvement sure the structuring of the UIC technical documents. The\nof railway services, RSF will place emphasis on: revision of documents on a five-year cycle, when deemed\n> Operations and safety as detailed in part 7 necessary by members will be ensured together with the\n\nP > P publication of other appropriate UIC documents: specifi-\n> Predictive maintenance, for better reliability and availa- cations, reports and guidelines.\n\nbility of infrastructure and rolling stock, and better inte-\n\ngration in operations,\n> Reduction of railway noise, facilitating the acceptance of\n\nthe increasing number of trains by those in the vicinity of\n\nthe railway lines.\n\n1 56:",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 57,
      "text": "TOWARDS A SHARED RAILWAY SYSTEM\nTO EEE TTT TT ———-$— oo |\n. ~ biueruational af |\n4 和 ® Res arch: : |\not, co” Webinar Gere ieer a PA mp\nAssets for Automatic & Autonomous Operation cn & +» Te ce rag ae : @ 4g Lo.\n: Pa a ( 7 .\né s | 人 = ,* 本\n. -0 ” “a\nrn “ # 和 ’ - a -\n-~-- -一 = er一-~ t,\n. 59 | . ' >\n“ES } Pe = . , Ry > bo.\ncH TM OEsicn The ERA-UIC Coordination framework signed end of\n; 加 本 = FUTURE November 2021 describes the links between documents\n只 “ .\n) \\ drafted or published by ERA and UIC documents.\nA ry > » a It includes the ‘possibility for UIC to propose AMoCs\n了 Le se . . .\n{ea —_— 一~ [Acceptable Means of Compliance] or guidelines drafted by\n4 — UIC to ERA’ and the need to ‘coordinate and communicate\nAtila KESKIN Christian CHAVANEL 10\nVice-Crsirman of IRR, Lirector of Railway Syste, on the update of any ER document and UIC document”.\nChai f WG 2, M f DATEM, TCDD UIC : : : wae\namane enagere ; > Cooperation with relevant Universities and Research\n_ Centres will be developed.\n9. ERA-UIC Coordination Framework signed on 29 November 2021 -\nUmut Rifat TUZKAYA Andreas LIPKA Mehmet DEMIR Shigeto HIRAGURI Article 41\nVice Rector of Yud > -csd Migratior igital Consultancy Services Ocputy General Director. Icle 4.\nTecanical University Auroras oueling, Director, Metro Istarbul Development Promotion 10. ERA-UIC Coordination Framework signed on 29 November 20721 -\nDivision, 3TRI Article 41\n57 :",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 58,
      "text": "POSITION VS ERJU DEVELOPMENT OF UIC\nUIC is involved in both: DOCUMENTS\n> System Pillar, as technical As explained above, the RSF will rely on >» Publishing the annual UIC work pro-\ncoordinator and/or both the V-cycle, which distinguishes gramme regarding revision, approval\nteam leader of Railway specifications and guidelines from and publication of existing and new\nSystem Architecture, manufacturers’ standards, and the ERA-UIC publications,\nDAC, Central Modelling Coordination framework, which highlights » Supporting the efforts of ETF in order to\nSen ‘ty ond, watery the importance of AMoCs (operational quickly publish any new or updated UIC\nn ri nd railw ‘Ali ‘fi ati\noo orications allway guidelines approved by ERA). Specifications documents,\n; . and guidelines may need inputs from UIC, Defending the interests of UIC, notably\n> Innovation Pillar, as . (technical) reports. the intellectual property on any UIC\naffiliated to ERJU Founding , oe\nmembers. It implies that manufacturers’ standards publications, at national, European and\nwill be the responsibility of standardisation global level, to the benefit of our railway\nUIC will work in order to avoid ~— organisations (CEN-CENELEC, ETSI, ISO, members,\naay Cup ccon ov woreor9ep IEC), whereas UIC will focus on (technical) > Ensuring the right coordination between\nERJU: some Opt-in projects specifications and guidelines, and (technical UIC and standardisation organisations\nwill naturally be transformed reports) as inputs for specifications and (CEN_CENELEC, ETSI, IEC, ISO, OSJD),\ninto activities inside ERJU, guidelines. > Ensuring the right coordination between\nothers will complement the The Standardisation Unit will have, with the UIC and OTIF regarding UIC publications.\nactivities of ERJU. All this support of the Standardisation Platform\nwork of synchronisation will and on behalf of any UIC Departments,\nalso help the RICG (Research Forums and Platforms, the following remit\nand Innovation Coordination during the 2023-2025 period:\nGroup). Finally, some of the\nachievements will support > Promoting a new user-friendly UIC\nthe preparation of the future Library, open to any UIC members, with\nERRAC Strategic Innovation relevant and updated specifications,\nAgenda, which will be a main guidelines and reports (called publica-\ninput of the Master Plan of the tions in the rest of this paragraph),\nsuccessor of the ERJU. Pm Ensuring that every UIC department,\nIn addition, UIC is ready to Forum and Platform will systematically\nfacilitate the dissemination of review the specifications, guidelines and\nERJU outputs. reports they are responsible for where\nnecessary and at least every five years.\nThe objective is to maintain UIC publica-\ntions as state-of-the-art,\n‘58:\nNet",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 59,
      "text": "TOWARDS A SHARED RAILWAY SYSTEM\nLee $= = - -\nPARTICIPATION IN THE wey, me woos ie ee\nThe Rail System Forum (RSF) | DN AN ap Ney Snead AT\nis ready to: ce 1 ¥ a eT Ogee\na A . ~ an ee\n> Host any UIC member - 7 “oo 14. aN eS ay :\nfrom any region, ready to poe Ge , , ek, ce \\ , cn oa”\nparticipate in RSF Opt-in oe ‘aa a My [=\nprojects ue 1 SS | enw,\n> Adapt UIC specifications i Se a ae a 1 43 ‘s, AAA\nand guidelines to specific ee a - te “Ny . PGS ay\nneeds of regions, in the 一 ! - 、 SS\nframe of ad-hoc regional 0 me 2, x\nprojects or in the course of 一一 - 2 - Aaah CF 4 i,\nmulti-regional projects. wees op eens ke Cosa Be ay , io\nIn addition, RSF is ready to eee Pe mom OE eas ee Yo. . \\ AN\n; . Be : - =a =~ f Ne ‘wn. -- 、 : aN . -<\norganise any Task Force which a ae am Be —_ ll -一 y SSA sep ee ~ 从\n. ne eo ”~ aa a r - nah Sy = wees = ae\nmay provide added value to sot =v GES mo ory 一一 oe\nregions (e.g., Task Force on 0 ae emma Of a wt wee. -< iad -\ndesert conditions open to Asia, ' ; 1 A Ses 这 . = 一”~ 一\nAfrica, Middle-East, Australia\nand Europe; Task Force on\nSaving Energy, open to all the . ah:\nregions). .- 、 ga? el = Cty 23 ae\nThe Rail System Department a oe $. bail ee Sy i gt ~,\nwill participate in training a me , or ’ tif SS a ts aia: > : ty _\nefforts, in order to support See Ss a ea rm. FY - 3 | RN “ee oe SA Par\nregional activities. 4 aa - ae we | NS ES oa me\n\" ee dee ee ee 5 Es poe. 光 ioe Ge QE ..\nfom oe Lo 六 a Ey fee d aes 四 “we\nf Pony ee 上 2\nae ee off. 0 - JP os a ge ye 二\n巡 ee eae ee | s\\n 2 a\n© Présidence Sénégal\n: 59 :",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 60,
      "text": "of eh) os\n-* °* ; |\noo” _ oe vr\nre < 有\n+\n, 人 \\\n‘\n人\n. t\n= .\n‘Ne Tagen\ni aan: ae oO\noe net ge ee ee, YY",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": true,
      "garbled_reason": "empty",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 61,
      "text": "UNLOCK\nMULTIMODALITY\nFOR PASSENGERS",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 62,
      "text": "[|\nSTRATEGY & MAIN DELIVERABLES PSG: Passenger Services Group\n- The main challenge for the PSG in the 2023 - 2025 period\nIn order to develop passenger transport and increase rails |,\n. is implementing the Ticketing Roadmap which has been\nmodal share (over car and planes), customer experience must |. .\n. . i. |. jointly drafted with UIC, CER and CIT. The roadmap mainly\nbe at the forefront of considerations as this is the deciding .\nfactor on which mode of transport is taken consists of the deployment of OSDM (Open Sales and\nP Distribution Model) by the European UIC members, but also\nUIC’s passenger activities are steered by the Global Passenger _ by other stakeholders: third parties and multimodal transport\nForum, in coordination with all the department’s sectors. A operators. The certification of OSDM stakeholders and tools\ntransverse project planned for the 2023 - 2025 period will will be developed with the participation of the PATRIC audit\ncover customer experience to foster a culture orientated = group.\ntowards the customer as a key element for the future success\n> Other challenges for the PSG in coming years:\nof railways, permeating though all levels of the sector from -\ntop management to people working in the rail company. > Providing technical support to the CER passenger work-\ning groups related to regulations (TAP-TSI, MMTIS, PRR,\nOver the next three years UIC’s activities will be structured MDMS)\nas follows. , , , . .\nw >» Defining the UIC vision for architecture for a multimodal\n, i wa solution, agreeing with DG Move on the necessity of hav-\nas: in ing a high-level solution,\ni, Sa . “过元 > Facilitating interoperability for sales flows (booking, tick-\n& | fo eting, after-sales) with OSDM being the reference for\n| _ — . | railways,\n_ | 和 foo > Defining solutions architecture with IATA within the Air/\n: ie, ; ‘bas Rail IATA/UIC initiative and implementing pilot schemes\no = “#8 bal] > Integrating urban transport based on the Swedish mar-\n— ty ket SAMTRAFIKEN experiment while working with urban\n‘ : 人 7 transport stakeholders (the Smart Ticketing Alliance,\na ’ for example) to define the solution architecture for\n(< 参 —_ interoperability.\n_ iF i Accessibility and inclusion are also part of the PSG Working\n, Tons oo Groups’ (PASSAGE) activities to make railways welcoming\n° A y a and easier for a wider range of clients, in particular those with\n, - disabilities and reduced mobility.\n‘62:",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 63,
      "text": "UNLOCK MULTIMODALITY FOR PASSENGERS\nLee $= = -\nIntercity and High-Speed International cooperation\nIn Europe the group supports the EU’s consolidation of the — International cooperation will increase, in particular with IATA\nnew market following the 4\" package. UIC will pursue the and UNECE in order to better align the concepts with those\ncooperation with air (IATA) in order to facilitate joint initiatives leading international bodies. Finally, During the 2023 - 2025\namong members and boost passenger preference for rail. period, a world conference on stations (Nextstation) will be\nTwo World Congresses on High-Speed Rail will be organised organised with a UIC member hosting the event.\nfor the 2023 - 2025 period.\nSHIGH-SPEED RAIL 4 ' _\naf ‘i Right Speed For Our Pionet ¥ | ing | , .\nTM UIC HIG) , . ru A ‘ 了\nThe first will take place on 7 - 10 March 2023 in Marrakech\nunder the slogan “High-speed rail: the right speed for our\nplanet”. The second will be held in Beijing in 2024 or 2025\ndepending on the health situation.\nTwo levels of training sessions mes\non high-speed railways will also ;\ntake place in this time period.\nVIC\nHIGHSPEED\nMorocco 2023\n63 |",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 64,
      "text": "Commuter and Regional Train Rail Tourism POSITION VS ERJU\nServices Identify new business opportunities for .\n\n; hati F 7 b Ki th th Passenger issues are not\nDiscuss the best so UtIONS | or ensuring railways by working with t e tourism sector present in ERJU as such.\nadapted door-to-door services for new to better understand what is needed to put However, the previous JU\ncommuters in order to be more attractive _ rail at the centre of sustainable tourism. (Shift2Rail) worked on\nand put rail at the centre of sustainable ticketing systems in IP 4.\nmobility of the future. ae\n\n> It is still too early to know how\nthese developments can be\n, - Ce linked to the ongoing work\n2 . 机 6 a or, on OSDM and multimodal\n‘ <i ; re ticketing within UIC, but it is\nwoe ys . ae nr ee clear that their implementation\n加 i will Rm. oa will require greater\n- mr KT Rn. cooperation.\n, < 和 St TT an Moreover, even if it is still\n\n- <=\", <~ ee Ut Baga Rd tat pte difficult to know if the\na a OS ee SRE aie ce a m= technical work needed for\nee a BST tte -人 全he implementation of the\n\na | sun PRMRE St 220, European Data Space will be\n. FE wee eae sae pete we = financed within the framework\nae Ha ‘ity I [POs 2, wt ae } » of ERJU or other European\nle 3 i 一,二 -有 projects, it is certain that\n一 i. Ju &§ > wr econ renee Meee) Fie | |) ofl establishing connections with\nrr _ re a — oa the railway ecosystem will\n, ety (> 7 (er only be possible with UIC’s\naz , .\nii == AT ow involvement.\n\"a ra | a oe Indeed, OSDM is the main\n- ee . a ae link between a potential\nWie» i ig intermodal vision with rail\n| ug 起复= 和: as the backbone. On a more\nsta tb political level, the UIC will\n\n机 q 人 ner | -. = me | provide its technical support\n\\ 上二 二 ret | | | , W731 to the CER to define a data\n, atop | eal il a nes a sz i sharing strategy, because\n\n十 dt HALL + . 一了人 the definition of what should\n加 an (本上司本 ees: “ TE f remain the property of\nfb ees amant Ng G eo Fj 3g operators is the focus of\ni Ue ey eer a roe A cf discussion.\n-一.9, 一 . 了 7 As Bla ta ik 1 og ae\n_ of a aT ay ee i 全 _ _",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 65,
      "text": "UNLOCK MULTIMODALITY FOR PASSENGERS\nLEE ee - -\nPARTICIPATION IN THE\nREGIONAL STRATEGY\nAll the actions and projects The High-Speed Committee is\ndeveloped in the passenger open to members across the\ntransport sector contribute world, as almost all entities\nto the development of the which undertake high-speed\nregions, not only for Europe activities are part of the group.\nbut for all the continents. Guidelines are developed\nae within this area and are made\nFor example the activities .\n. available for the whole sector.\nof the Passenger Services . . wae\n; An alliance of universities\nGroup are mainly focused .\n. i, comprises a large number of\non ticketing in many parts of . wee . .\n. universities involved in this\nEurope and several countries subject\nin the Middle-East and Asia- ject.\nPacific. The OSDM (Open The tourism sector is by nature\nSales and Distribution Model) worldwide and the UIC TopRail\nspecification as well as the group reflects this diversity.\nother associated tools could The same goes for the\nbe extended to other regions commuter and regional group.\nas it is an open specification\n(osdm.io). | 3 | ; | eee ape ——| 4\n| I ——= 000° | es i, alee | ae\nThe working group on persons oS | —— +1 __ (a oe MALMO C Ankommande Arcivals rr]\nwith reduced mobility consists ee | sagen cm naan a |\nof members from several ER Euan” pute, spams ona ee ERE tT\ncontinents. An Australian ay a - Smetana wi wera Monnens” ET 4\ncompany has bought the — = summers al Sinsinainoe aaa ms 3\ndatabase of integrated a oreo ee ares enn !\ntimetables and uses it to “一 rr SRNR EET eT, _\nprovide information ona 一 有 _— ~\nglobal level. tea oo TH 站 ae. & 个 ie City OBB 个 abe) Beer) . ,/\nThe Station Managers’ Global ee ee 多 | ee\n. 。 > 8 [eur ee 760 O woe > — - a 0 和 - a\nGroup is open to all continents Wess OS GL. , * a ee er ee |\njust over ayear ago, and a new 7 Se eid 人三 aL - eal ba git ED ~ a = |\nactivity has started in North UY RPE rs UE ABE eee 一 BB (0.000%\nAmerica which will address i Wie | 号 二 _ | (a: fre\ntopics on best practice and oh EOS \\4 £7 en BOS : ‘ i= \\ an: i |\nclimate change issues. PR OT FS Wise ve te Diy a mee: a\n. 65 :",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 66,
      "text": "| 网 | 1 im i a ‘ame |\na ait ttn\n|\n一一一一一 一 四 a re -一 ”了二 一 ” TT UW —\n‘ “ \" f 人\n, | 1 ,\nRAIL FREIGHT “4 14 | -二 | lis ae\nQRWARD ‘ ‘ , | | | | |\nir \\ rash, Py\n! ae , - Rt wf RE ;\n| : ‘ 7 中 > | |\n, i, - ge; \\ wh -\na 下 oom ol —_— _ - ; _ fd\n{Cargo/ ge ” ]一 四",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": true,
      "garbled_reason": "empty",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 67,
      "text": "INCREASING\nRAIL FREIGHT\nMODAL SHARE",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 68,
      "text": "INCREASING RAIL FREIGHT\n\nMODAL SHARE\n\nSs\n\nSTRATEGY & MAIN DELIVERABLES\n\nThe sustainability challenge is the underlying driver of the The combined implementation of these will generate the full\n\nfreight vision no matter the region. Enabling modal shift effect desired. With this in mind, in 2022 RFF initiated the “Year\n\ntowards rail is key to achieving this ambition. of IM” which is a Joint vision between rail operators (freight\n\nThe Covid pandemic and the energy crisis have emphasised and passenger) and infrastructure managers regarding the\n. priority changes which need to take place within the rail\n\nthe importance of rail freight for Europe, as it is the only\n\nsustainable land transport mode being seven times more system,\n\nenergy efficient than road transport. The vision will be followed by a common implementation plan\n\nThis ambition is however constrained by an acute shortage around the following actions:\n\nof infrastructure capacity. The European members of the UIC |. Contribute to the definition of the target capacity man-\n\nFreight Forum, united within the Rail Freight Forward (RFF) agement process and planning,\n\nCoalition, which is managed by UIC, have therefore agreed a 2. Focus on operational concepts in case of ICMs,\n\nprogramme based on digital game changers to address this 3 Seek to align stakeholders around a common concept\n\nchallenge together with Infrastructure Managers. for the border section and cross-border-processes\n\nIn parallel they continue to work on areas with a comparatively so to ensure maximum fluidity for international cargo\n\nshorter time to implementation than the digital game transportation,\n\nchangers. These are referred to as “quick wins”. 4. Support members in their national stakeholder discussion\n\nCapacity is the most expensive recourse we have in rail freight on the implementation of Digital Capacity Management,\n\nand therefore needs to be used efficiently. 5. Drive, in partnership with RNE the elaborating a common\n\napproach towards data exchange.\n\nEfficiency gains can be achieved within the system by\n\nharmonising and coordinating processes between countries [he implementation of the aforementioned technologies will\n\nthus avoiding unnecessary stops at borders for instance generate an increasing amount of data. This data needs to be\n\nwhich are resource and capacity intensive. standardised, consumed and provided seamlessly.\n\nUnder the umbrella of RFF, five digital game changers\n\nwere identified as key enablers to deliver the bigger sector\n\nambition of reaching 30% freight market share by 2030.\n\nThese are ERTMS, ATO, DAC, Digital Platform, Digital Capacity\n\nManagement.\n\n‘68:\nNet",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 69,
      "text": "INCREASING RAIL FREIGHT MODAL SHARE\nLee $= - -\nhy , mm 7 一 In addition to these workstreams, UIC Freight iS strengthening\nLN its core areas of expertise in the following domains:\nened\nmin we ~. > Wagon utilisation,\nThy Te\n| , an. ae | li fe > Corridor development,\nBS nin ‘cK i AML Vey 2 > Train operation,\nBs i ft | st ?\n1 ; | oe U pi) — > Load safety,\nq Fy 4! SEE i wal. ae > Combined transport,\n} . 上 | >» Dangerous goods,\n= OP es |\n(2. rt) ee >» Seamless data exchange.\n7 ” a, How these groups/domains provide business value to UIC\n“ i members in their daily business formed part of the “Fit for\noe &} ” Freight dissemination campaign to celebrate UIC’s 100\ner anniversary.\nIn view of the positive feedback received for this initiative, the\nFor rail freight, the challenge is to ensure all rail operators, freight department will adjust the concept in 2023 to increase\nregardless of their IT maturity, can contribute to this process its offer of support to members and onboard newcomers.\nso to establish rail freight as a seamless stakeholder in an “end\nto end” logistic chain.\nThis is the goal of the DP-RAIL project which aims to set\nup a digital platform for the rail freight ecosystem focusing,\nin a first step, on digital solutions for core rail operational\nprocesses with a view of supporting TAF TSI compliance. 请 REI H+ |\nUIC is coordinating this process on behalf of a Consortium 就UIC Freight month\nof early investors and is seeking EU funding to support the\ninitiative. Cdp-rail.eu).\n69 :\nN77",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 70,
      "text": "One of the freight flagship areas is the work UIC was a forerunner in the shaping and POSITION VS ERJU\nperformed in the wagon domain. In 2023, implementation of the corridor concept. ©0000\nwork will specifically address: With a view to overcoming interoperability The driver language topic\nreceived funding from the then\n> The process steps for repairs of enroute barriers, the ECCO group will support called Shift2Rail. The project\ndamages (GCU repairs) against the the TEN-T revision from an operational was known as Translate4Rail\nbackground of the processes described Perspective. (translate4rail.eu) and ended\nin detail in the ECM Regulation (ECM ~The unique asset base (IRS, guidelines and in December 2021.\nmaintenance), Leaflets) and expertise of UIC in combined at the request of ERJU, several\n>» The continuous improvement of the transport will, from an operational and live demonstrations of the\nATTI process will aim to strengthen this technical perspective, continue to support prototype potential were\nsafe and simplified wagon exchange/ the high-stake discussions onthe combined performed in 2022: WCRR,\ntrain handover process further especial- _ transport directive revision and the weights _!nnotrans, TRA. Some Safety\nly through the enhancement of the qual- and dimensions of road vehicles. Authorities also expressed an\nity guidelines and management system interest in receiving additional\nand by undertaking a Risk Assessment the pocsibiity or the protetype\nby an independent body. with regard to their specific\nborder issues.\nThe topic is included in the\ncurrent work programme of\nERJU although not picked up\nas immediate priority.\nThe concept of DP-RAIL is not\naddressed by the ERJU work\n, programme. It is therefore\n’ | - boo envisaged to seek EU funding\nnan oe - | | , from other programmes. Once\n, — a. the platform is launched, it\nvege L , | could however become the\noe) econ’ ro : .\nese S&S i =~ f i -可 Pa Fane fe Se place towards which new\nwo fe oy iy: oe op ny] freight related operational\nos a ”一一 . ae gp er oa ar if . solutions developed in ERJU\n人、 = ee. ~o r i ;\na ~\n‘70:",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 71,
      "text": "INCREASING RAIL FREIGHT MODAL SHARE\n”rr\nPARTICIPATION IN THE\nREGIONAL STRATEGY\nUIC Freight contributes with other partner associations > Promote interoperability\nto the European Strategy such TRACECA, UNECE, FIATA, projects and harmonisation\nmainly through the Rail etc. capitalising on expertise.\nFreight Forward Initiatives . . . ,\n9 - . Furthermore, corridor UIC will continue to develop its\nwhich it coordinates (www. i. .\n. . management should not be global mission by deepening\nrailfreightforward.eu). As - , 。 .\n。 。 seen as a regional activity. The and extending it corridor\ndescribed in the above . 。 。 。 。 。\n。 . . . various studies and interviews activities to other regions.\nsections the key objectives lie . .\n. ; . we conducted illustrated LARA region is in focus.\nwith operational and capacity . . .\n. this. The complementarity of Creating the necessary uptake\nimprovements. . . . 。 。 。 。\ncorridors is an important point collaboration with sister\nOn a global level, but a tailored approach to organisations like FIATA will be\nthe development of each of them is also required. further extended.\nintercontinental corridors has wy\n. . 。 In 2023, it is therefore NREC WILE 2 四 vom\nopened promising perspectives , EARL 2c art ae “if loge 4\n。 envisaged to set up a network RE Sk. a Pa GY: 9 at\nto the growth of rail transport 。 , a. ae FT PA ‘@ be. ee\n. of corridors with the aim to: . f > OS eda / Sa aS Mia * nes\nover long distances as an an ie” ni Oe 4,\n. . oe Fe ss. os y- . , ~\nalternative to other modes > Identify and monitor the Sey 也 0 ee\n(mainly maritime and road) and business potential behind - min! , » mime -\nas a key partner in a robust and each route: identify success fie: Ts ig j a we, es\nsustainable logistic chain. The factors and target markets, = ai Ee aS\ncorridor concept has been a > Propose individual action Bey ne ieee\ndriver for international freight or pei RAILFREIGHT a\n; plan in line with the -~ FORWARD Se\ndevelopment and collaboration og s . 7\" oe EUROPEAN RAM FREIGHT viStOH 2050 要:\n. 。 strategy of their “natural | a |: ie Si\nin which UIC has played a . . . a4 te\n; Region with the aim to have , 二 NS gn\ncatalytic role for over a decade. . . Ly ol Ree, OS, \"bi so\nconcrete implementation ST i a ee a eth 54 ns a me\nAccording to its mission, UIC projects, rn: ane SS (Cy eS Wl re\nhas focused its contribution .\non improving harmonisation > Organise one or two cross -_ = ge.\nnp gnen ° regional conferences/ RE ee (|\nand interoperability of workshops per year a 1 | ay | ;\noperation along the corridors in , 9 ' ie | | me , en\ncollaboration with its members, |» Continue dialogue with “ |\npartner organisations and international partner { | 1 ‘A :\nbusiness stakeholders. organisations, | | oo | a\nIn addition to regular market > Engage with development 、 一 \\、\nmonitoring along the Eurasian banks, woe “gue 机 _\ncorridors, he 5 expense \" > Facilitate integration . LF eae B:-\noperationa isation o corrl ors between stakeholders, .\nhas reinforced collaboration - - _\n71 :",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 72,
      "text": "os. < .\n=~ ( 二-一 二 |\n- \" ' 4\n站 7 ee eer\nve 人 Wid 下 证, some (i ne\net ge Sls ae ee ee ect\n- -. 5 a - \"Mel 0 tn ee » eek rote, aver\nhee : | a - \\ , TM ae - ii . “eS Re 2%: =i “oe — Fee Seige\n<a 2 Pees a # & oe ae 人 Rn ES - eo eS\nka . Seeds: q See eee “iy ZOUK) ara “shi 2 ae\nSee Se 。 or. = << ieee Say PAPE ea ae se\n四\n人\n© Presidence Sénégal",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 73,
      "text": "CONTRIBUTING TO THE\nFUTURE OF SAFETY\nAND OPERATIONS",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 74,
      "text": "[|\nThe strategic objectives of the Operations Sector are: THE MAIN OUTCOMES OF THE OPERATIONS\n> Contribution to the Design and Organisation of Future SECTOR & SAFETY PLATFORM\nRailway Operations & traffic management:\ni 一 i i ted\n> Traffic Control Centres & crises management, The first fundamental - safety, with an integra\napproach\n>» CCS & increase of the railway capacity.\n> Definition of digital opportunities & use cases for the per- Digitalisation in railways will dramatically increase the amount\n. of data collected for the benefit of an even better safety\nformance of operations: Te\n— management. But at the same time digitalisation increases\n> Support to Automation (DAC, ATO, Artificial Intelligence, a false feeling of total control: the world is becoming more\nRobotics, 5G use cases, etc.), complex, increasing the uncertainties and the limits of models.\n> Railway Digital Modelling, .\nFurthermore, new societal issues need to be considered since\nP Enhancing real time operations & customer information the Covid-19 pandemic. The health and safety of customers\nduring disrupted situations: digital platforms for Interoper- and of the workforce are the top priority for keeping railways\nability of data operations and exchanges between railway running. Finally, the consequences related to climate change\nundertakings & infrastructure managers. will force us to establish a crises and risks typology and adopt\n> Digitalisation of safety methods: crisis and risk-oriented planning methodologies.\n>» new methods for safety demonstrations based on risk The new approach to safety and performance developed in\nanalyses processes, aiming at an internationalisation of UIC must be global and transversal.\ncertifications & approvals of innovative systems.\nThey will be achieved through: '\n. . . esas Rule- based MA d\n> Delivering of harmonised operational specifications in safety: 4 safety _ industrial\naddition to manufacturers’ standards, as an acceptable ism toda orth , 一 safety\nas the unerpected\nmeans of compliance, \"\n> Training: this demand from UIC members is compliant ee , © suit\nxpertise 1\nwith the necessary acceleration of the innovation cycle, :\n@ Techmeal barners ® Leasing ability\n> Organising the Return of Experience “REX” within UIC, so @ Rates and procedures ® Adaptation\nthat Operations & Safety are correctly monitored, via an : :\nintegrated safety approach, driving a library of bowties 人\n。 站 。 H behaviours behaviours Wo An albert ard Ansel\nand safety barriers classification. For Europe, that will be\nincluded within ERA JNS processes and future CSM ASLP, Approach for an Integrated Safety Approach\n> Creation of a Scientific Committee, interfaced with the key\nactivities of the Operations Sector and Safety Platform.\n1 74 :",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 75,
      "text": "CONTRIBUTING TO THE FUTURE OF SAFETY AND OPERATIONS\nTO LL $< = = -\nThe second fundamental - reliability POSITION VS ERJU PARTICIPATION IN THE\nj J REGIONAL STRATEGY\nIn the frame of this second fundamental, Ops & Safety Supporting the Europe’s Rail OO\nsector will develop specifications related to: System Pillar (cf. notably Looking forward to the\n> Right time departure of trains, modular design of railway creation of a dedicated Task\n> Desi d Simulati components”). Force Safety, for RAME and\nesign and Simulation, . ,\n加 ti Rul In the frame of ERJU System a thee lowing in 2023, asec\nPerarional SuUles, Pillar activities, UIC will on t e 9 owing programme °\n> System competencies & skills of the Operational/ coordinate the definition identified priority topics:\nManagement staff. of targets related to the > Safety Performance:\n. . performance, reliability, Settlement of an African\nThe third fundamental - sustainable availability, maintainability, Railway Safety Network\nIn the f £ this third fund tal Ops & Safet Safety Network (MERSN)\nn the rame of this t ird un amental, Ops afety to work on REX and sharing\nsector will develop specifications related to: (safety database)\n> Ops & Traffic Control centres: high-performance > Human Factors & Safety\ntools capable of managing most disturbed situa- Culture: one peer review\ntions at their level, including Stations and Hubs, between voluntary\n>» Scenarios for resilience and business continuity, stakeholders, liaising EU and\nAfrican/RAME members,\n> Data management: unified and interfaced databas- /\nes for efficient IT. > Training Modules\nDevelopment:\nThese fundamentals will lead the Operations Sector > Safety Leadership training\nand Safety Platform to work with all other sectors from for CODIR/ COMEX,\nRail System Forum, and with all other departments of > SMS/Safety Culture\nUIC. training, for Ops and First\nLine Managers.\n. i Be ne mA\n站\n| . -_ s wet , 7 sreen Leshe BR . bo ‘ a | | Ce xterm) 和 个\n村 er - am “Sots ‘fk os 4 seen pa ay SM SAFE\n; oa me 2 100 wie aan _ woe\nLoogcarspe: BE aaa 下 % 1 Aror Spence tnvue Xt: ~ Maria hedqvat Goth ivler Xf\n.75 :",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 76,
      "text": "三 aa 一\n| alas\nHAMMAM LIF g=\n_— mina @",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": true,
      "garbled_reason": "empty",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 77,
      "text": "ENHANCING\nSECURITY",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": true,
      "garbled_reason": "too_short",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 78,
      "text": "[|\nSTRATECY & MAIN\nDELIVERABLES\nThe Security of passengers and goods > Three permanent working groups New security solutions will also be\nas well as the security of staff are key (Human Factors, New Technologies regularly created based on the re-\nelements to boost the attractiveness and Strategy, Procedures and sults of the work performed within\nand efficiency of rail transport. Security Regulations), the security platform activities.\nees ride there ape daily theese 7 BNO adrnoc working groups at The main priority topics highlighted by\nrol A ne nee ere are oo k ree . the request of UIC members (SIA the members of the security platform\nSuch 8S aggression, PICKPocketing; on Sabotage/ _Intrusion/Attack for 2023 - 2025 are as follows:\ntheft or graffiti, but there are also and Crisis Management recently = threats: 5 下\nmore dramatic events such as terrorist created) Merging reats. cypersecurl!\nattacks. These threats can have a high . ty, CBRN (chemical, Biological\nimpact, create a feeling of insecurity Beyond the continuous work of the Radiological, Nuclear), insider\nand prevent customers from choosing working groups, the members are threats,\na are continuously updated according to cal or/and cyber-attack,\nIn this context the main objectives ongoing rail security issues: - border | i tra\nof the security platform are to share > The network of quick responders to ross oraer Issues regaraing train\nexperiences, develop recommendations security staff powers,\nexchange fast information between\n\nand address emerging threats to help . > Integration and implementation\n\nthe members about arising securi- . . . .\nrail security managers to build their ee of security solutions in the rail\n\n, ty questions: the objective is to be .\nsecurity policies. i, , environment,\nvery reactive in organising answers -\n\nThe UIC security platform is organised and their analysis in case of new is- ‘Training of staff,\naround: sues or threats targeting one of our >» Emerging security topics linked to\n>» An annual congress to take stock of members, current concerns.\n\nthe work carried out and to propose =» The security hub which is a private\n\nfuture priorities, secure web platform where rail se-\n> A steering committee which meets curity experts can find, access and\n\nevery quarter involving the UIC re- share solutions to railway security\n\ngions, UIC department activities issues: about 100 security solutions\n\n(passenger, freight, rail system) when are already available and will be\n\nneeded and professional and political completed with new operational\n\npartners (e.g., UITP, RAILPOL, CER), experiences from the members.\n\n1 78 :\nNe",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 79,
      "text": "ENHANCING SECURITY\nTO LLL\nPOSITION VS ERJU PARTICIPATION IN THE -_\nJ a REGIONAL STRATEGY\nRail Security is not part of eee _ mig\nthe ERJU roadmap, however The security platform is st. |\ninvolvement in EU funded worldwide: security is a -_ 4 - 7 WE ,\nsecurity research projects subject that affects all regions. 2 { ee\nis a key activity to develop The security division is ready v4 (: > bj ’\ninnovative rail security to develop regional security , | v a\nsolutions for the future. projects or workshops to / / a - q .\nSecurity related EU projects address main security threats / 4 if; e PA x” x. ”\nare developed within the and work on security strategies Ws! dy a |, A\nHorizon Europe Secure Society that can be developed at 1 “ ia , a 4\ncall or DG Home Internal regional level. ° { . a, 1 ‘ a an 4\nSecurity Fund (ISF). For the . rer . yy ie\n; The security division is -: 7 hj\nnext three years, two projects 、 一 一-一 yy ae\nalso ready to continue to , , 看 | |\nhave already been selected _. , _. + -\n. participate in training efforts, a a) 四\nby the European Commission 。 2 fi 1/\n。 in order to Support regional ; — ee ,\non the development of rail _ as an ~ oY\n. . , activities. oO 一 oh 的 w\nsecurity training programmes. ‘ 2s\n. 5 ' : > ¥ : i...\n~ D\n79 :",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 80,
      "text": "i a pe\nAR an\nPp ‘ gill x vet i | , ' . |",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": true,
      "garbled_reason": "empty",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 81,
      "text": "EFFICIENT AND\nTRANSPARENT\nMANAGEMENT",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 82,
      "text": "[|\nFINANCE\nThe UIC has set up the first steps for the improvement of its |More generally, UIC has successfully improved its visibility and\ninternal financial control. contribution to European projects from H2020 and Shif2Rail.\noe This presence is being reinforced in the current Horizon\nThe objective is to gain a clearer view of each department's isp | Ing fet 1 u - 2\n. . Europe programme and Europe's Rail, with the ambition to\nplanned budget, isolating the Headquarter component from\n_ be recognised as a technical force and a reliable technical\nthe Project Component, in order to facilitate management\n, . partner at European level.\ndecisions.\nAn organisational audit was conducted, and the first part of\nEfforts are currently being pursued to simplify the whole g i, , P .\n. the results are currently being implemented. Efficiency gains\naccounting system and to develop the accrual performance, . .\n. . , , i, . will show their full impact in the next period.\nwith the aim of obtaining major improvements during the\nyear 2023.\nThe personalised follow-up accumulated payments arrears has ~ _ _ “2\nbeen implemented with good results thanks to the commitment -\nof members from all UIC regions. “Absent” members have been _ _ _ _\n\n. tee: . 本 ar. = z0. (ff e é\npersonally approached to better understand their difficulties -本 if “a oe\nor their expectations. These actions have led to a better ak ee , j YU\nunderstanding of the UIC added value and have boosted the ome . | 4 aan | a ny\nmomentum of their involvement and for the current year 2022 i | 村- mY 4 | \" \\\nfor instance, more than 6GOOKE have been recovered. In the . tie ©. CO Bt? dy aha! os cor\nfuture, regional projects will be reinforced to strengthen the i a eg * 1, eS\ndirect participation of members at regional level. ae ch “a y m 5 NO -\nConcerning Projects, the projects database has strengthened 村 二 aa ia | . ne 和\nits position as a reference tool for members to follow up -\" Seo —\" mh wy\nthe progress of UIC projects. Developments are ongoing _ .\nto improve the possibilities of targeted reporting to the - 加\nmembers. =\nThe next step will be to address the fragmentation of human [aie foe 、\nand capital resources for projects, by consolidating the ‘ \\\npooling of experts and resources towards bigger and more ee © .\nambitious projects. eee = ; —_\n\n‘82:",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 83,
      "text": "EFFICIENT AND TRANSPARENT MANACEMENT\nLee ”有\nQUALITY\nIn early 2015, UIC started implementing a Quality Management In order to do so, the main focus will be on:\nSystem (QMS) in order to better respond to members’ p Contributing to improve and consolidate the efforts of\nneeds for service, as a professional association. A members’ all the UIC support services for a better quality of ser-\nsatisfaction enquiry is undertaken every year, as one of the vice towards the internal (staff) and external (members)\ntools used for measuring the key performance indicators of customers,\nthe UIC activity. The ENQuiry’s report is shared with both the > Simplifying and formalising internal processes, aiming to\nUIC memes and staff with the aim re foam collective reach an efficient and cost-effective functioning with effi-\naction for continuous improvement of the association’s cient, competent and well-trained staff,\noverall performance. _\n> Managing a simple but efficient documentary system as\nIn 2017, the UIC QMS was certified with the Quali’OP a common reference framework of coordination between\nlabel awarded by AFNOR (the French Association for the internal (staff) and external (members) stakeholders,\nStandardisation and Certification) to professional associations Making sure that the rules for ethical and transparent gov-\ncommitted for quality of service; this certification has been .\n- ernance are respected and applied,\nrenewed every year since. a\n> Ensuring that UIC obtains further certifications in relation\nconsolidate this quality management system to help achieve hell. th a € th | f\nthe optimum balance between the UIC’s internal capacities me nutshell, the hehe oe vee t coe IS < te I\nand members’ expectations. the concerned sta eholders to elp ac leve a ‘ig evel o\nprofessionalism in the UIC services and maintain it on a long-\nterm perspective. This aims satisfying member’s expectations\nEfficient organisational structure on the one hand, and enabling UIC to position itself among\na 并 C wr -. the credible and reliable players in the sector at international\n- level, on the other hand.\na . 网\n» ‘ 2 ,\nYs sd\n“Quality Minute” video explaining UIC’s commitments\n: 83.",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 84,
      "text": "COMMUNICATIONS\nThe Communications department The promotion of activities on UIC’s with UIC’s partners, foster relations with\nimplements UIC’s communications social media platforms will increase, potential sponsors over the long-term,\nstrategy in line with the Work — particularly on LinkedIn, which is UIC’s — further strengthen UIC’s image and reach\nProgramme’s five strategic focus most effective social media platform in out to different types of audiences.\nareas and provides each UIC body _— terms of follower growth, while internal\n(department or region) with a clear and external communications will be\nvision of their strategic messages, improved through better-adapted = oe\naudiences and proposed measures’ digital tools for sending the UIC = Pi ae 要 1\nto implement their communication newsletter, marketing campaigns and aa\nactions. internal news updates. aa 11)\nThe department will continue to Having gained more visibility and on\ndeliver a multi-channel strategy of credibility in the field of events over ae UIC ACTIVITY BOOKLET\n. . . ead\ndifferent messages adapted to its the last few years, the department will = ;\nvarious targeted audiences, with implement an official events policy, os yic’\nmore emphasis placed on regional with the aim of developing a more “\ncommunication and activities. This will professional model for the organisation\ninclude the organisation of a regular of UlC events. °\ncycle of regional events to develo . L kk d\nYe , 9 . ae P A sponsorship policy will be put in in e ;\nactivities and to give more visibility to , 8\nthe UIC brand | h place, establishing a common approach\ne rand in each region. . .\ng between all UIC event organisers. The € —_Q UIC - International union of railw... +++\nIn terms of social media strategy, key objective will be to develop a shared\n| 1 | | 人 Voir en tant que membre\nperformance indicators have made it database of contacts, reinforce ties\npossible to assess UIC’s communications Page Statistiques Activité ED\nactions and to decide the next steps. ~\n_ UIC - International union of railways #U...\nWiC” 48 S41 abonnés\n1mois - 图\n人Tue 罗 | #UICrail has just pub!l'shed a short video to promote\n, one of its key publications of 2022: the #Manifesto\n»% | for the VIC centenary. Adopted in July this year, the\n. ae 人 Manifesto is a concrete follow-up to the Vision of Rail\n. ~ v¥ , MANIFESTO 2030 and to the discussions held between Members\nmi . > oo at the UIC Symposium in December 2021. The\nf es Mam UlC certenary\né 六 ne ian document contains Existing and future solutions for\n¢ y* Re rail to serve the planet and people, taking into account\n/mant'festes/ i . 上 the significant role of the railways and the need to:\nNoun\n_ _ . -Transform cities and connect communities\n= a public deciaration y i¢’ -Use clean energy, technology and innovation\nic’ of policy, aims, cae cee once -Promote intermodality and seamless connectians;\nor action olan oN and\n-Transform the customer experience\nUIC Manifesto: Rail solution for a better Future\nRead more in eNews: https://Inkd.infekcJW99Y",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 85,
      "text": "EFFICIENT AND TRANSPARENT MANACEMENT\n和RE |“ so | —\nHUMAN RESOURCES\nThe Human Resources department P Improving processes and HR’s activ- The HR Department will focus on the\naccompanies and supports UIC’s ities throughout each level of UIC, following initiatives:\nstrategy and performance, as well as =» Increasing the employees’ skills > Staff training, including the develop-\nthe transformation of business models through access to continued profes- ment of project management skills,\nleading to changes in UIC’s activities sional development and promoting > Work on the “employer brand” in\nand operating methods. skills management, while taking an order to:\nIts goal is to ensure that UIC has the staff increasingly fluid and digitalised - help retain talented employees,\nnecessary to function and that they do working environment into account, increase loyalty and get them to\ntheir best to improve UIC’s performance especially in light of new challeng- commit to the company’s aims,\nwhile also flourishing. es, such as the spread of work from - increase the attractiveness of the\nhome. ifj\nHR must take employees’ changing den te, Is to wees peor In\nexpectations into account and respond In 2022, the HR Department introduced order to attract new ta ent, ae er\nto the various and ever-increasing @ goal-setting review process. 2023 take or continue HR services’ dig-\nreality of the world of work. This is why the commitment of employees being changes to ne Human Resource\n. . . . 1 .\ntheir areas of action are increasing and recognised. Management System\ntheir missions are diversifying, which a - LU\nmeans that new work organisations 1 a 7 _ ot we\nand new management methods need SSS a orf \\ ee\nto be developed, in particular, taking “KE ~7 ds AN 丛 ar.\ninto account changes in flexibility and i, ee ee | vt 、 A oh ;\nwi | LRRD p.._ PO It , ‘\nwell-being at work and environmental = 0 ee St 二 «|\nand societal issues, as well as providing wt tee es ee Ue!\nsupport for digitalisation. ey a ) ay eee 。 \\ ya\nHR’s strategy will enable the follows ¥. ae: dk ~ ‘eer 8 Na ale iad a ng _ ae —,\nces . ca Cee < ¥ ~~ a ae , , ,\nx i P= > ~ 4 ‘a SS a4 . oe al oh eye 和 ~~ = = zg on? =\ngoals to be met: a! 2 多 了 3 73h, si 了 i or S ‘ aerial = 7)\n> Mobilising employees regarding the 区 | - ge es 1 fer “ ip \"i f Wow\nwork programme, a collaborative ain eat bn) 'y a wile An a a [>a\n> ‘ i) ‘ ne) Gage] > ~ J\nproject which reflects UIC’s values, ; nb Sr 4 全 Gu\n> Taking each person’s talents and Ls } _ ~~. ~\nskills into account in order to FY a _\nachieve UIC’s development goals as - ! DP\nwell as to promote internal flexibil- | Jam SoG SRE SE\n| | . aaa 人 1 =\nity and the employee's professional = --- Y ea a A eT} 2\ndevelopment, ae a ‘ ore . Sas\nStaff gathering in January 2023 for New Year's greetings\n.85 :",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 86,
      "text": "WWW.UIC.OTg\n本出回回Yu\n#UICrail",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": true,
      "garbled_reason": "empty",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 87,
      "text": "ENGAGEMENT\nDE SERVICE\nREF. 166\nAFNOR CERTIFICATION\nwww.afnor.org\nLUIC est une association professionnelle certifiée\npour engagement de qualité de services par\nAFNOR.\nUIC is a professional association certified by\nAFNOR for its commitment to service quality.\nPublished by: UIC Communication Department\nDirector of publication: Marie Plaud-Lombard\nDesign and layout: Coralie Filippini\nPhoto credit: ONCF, JR East, OBB, EFE, RAI,\nAmtrak, UIC, AdobeStock, Présidence Sénégal,\nSNCFT, Camrail, IR, CR, Korail, ZSSK, DB, RhB,\nALAF, VIA RAIL, ISR, CP, PKP, SAR, Rail Freight\nForward\nPrinting: UIC - 16 rue Jean Rey - 75015 Paris\nReproduction of the content is only authorised with\nspecific mention of the source (UIC)\nISBN: 978-2-7461-3260-3\nCopyright Deposit: February 2023, Paris",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 88,
      "text": "INTERNATIONAL UNION\nOF RAILWAYS",
      "source_file": "uic_work_programme_2023-2025.pdf",
      "garbled": true,
      "garbled_reason": "empty",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    }
  ]
}