{
  "doc_id": "e7447812-64d2-456a-b5b9-6c9c992e2774",
  "pages": [
    {
      "page_number": 1,
      "text": "Institution of Railway Signal Engineers\na\n\nBack to basics: SIL explained\nps ay 站 Paul Darlington and Ian Mitchell ae\nSafety Integrity Level (SIL) is an\nindicator of the relative risk-\nreduction provided by a safety\nfunction in a device. A SIL number Safer\nbetween 1 and 4 (SIL 1 being the\nlowest level of safety protection and\nSIL 4 the highest) is used to describe\nthe degree of safety protection\nrequired and the safety reliability of Sh\na system which is needed to achieve a) >.\nthat protection. It should be noted Oo CQ\nthat safety reliability is not the same Y 由\nas performance reliability, as this\nback-to-basics article will explain.\nFor traditional hardware-based\nsystems, safety is typically specified\nand demonstrated in terms of Mean\nTime Between Wrong Side Failure\n(MTBWSF), which can be calculated quantified, and instead it is necessary 。 EN 50126: The specification\nfrom the observed random failure rates to demonstrate safety by means of and demonstration of Reliability,\nof the individual components. When the rigour of the design and validation Availability, Maintainability\nprogrammable systems began to be process for the system and the software. and Safety (RAMS).\nused in safety critical applications, This is inevitably a qualitative (as 。EN 50128: Railway applications\nduplicated or triplicated system opposed to a quantitative) approach and a Communication eanallin\narchitectures were adopted to give very _ the SIL system provides an internationally 了 | 1 g - 3\nhigh MTBWSF as a result of random recognised approach to managing this Soft eer for reilen cont land\nhardware failures. But what about failure issue for safety critical systems. ° ware or rallway Control an\nof the software embedded in these _ protection systems.\nsystems? Software failures may appear The concept of SIL originated in e EN 50129: Railway applications\nto be random, but in fact they are always the International Electrotechnical — Communication, signalling and\nsystematic; if the circumstances are Committee standard IEC 61508: processing systems - Safety related\nrepeated the result will be the same. This Functional Safety of Electrical/ electronic systems for signalling.\nmeans that any attempt to predict safety Electronic/Programmable Electronic Safety Integrity Levels can be assigned to\nfrom observed failure rates of the system Safety related Systems. IEC 61508 Is virtually any function presenting a safety\nis futile — a small change in operating not railway specific and applies to al icy. Typical examples of SIL functions\ncircumstances can reveal or hide alatent Safety engineering disciplines. For the rall forrailare: SIL 1 light metro train speed\ndefect in the software. Industry CENELEC (European Committee monitoring and display, SIL 2 monitoring\n\na . for Electrotechnical Standardisation) of axle box bearin tem erature. SIL 3\nThe solution is to recognise that the derived the following standards depot protecti a 4 et | Ki f\nhazardous failure rate as a result of from IEC 61508 to meet railway €po Pro ee lon, Inter oc Ingo\nthese ‘systematic failures’ cannot be specific requirements. points and signals. The allocation of SIL\n12",
      "source_file": "26_SIL.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 2,
      "text": "IRSE News | Issue 292 | October 2022\nSafety integrity level Tolerable Functional\nFailure Rate per hour\nort. te ~\nWhat the SIL levels mean in terms of tolerable failure rates. AP . “ “NY\ntakes into account the frequency and severity of the risk that oo OZ ; 本 a\nis being managed, and whether there are other systems or aw ie anh \"ee\nmanual processes that can mitigate the effect of a hazardous y 4 . 了 a NX _\nsystem failure. 一 区”一喜事 一\nWhen developing systems to a required SIL, techniques are . wee fA \\ DRO ee\nselected from a list of recommended or mandatory techniques “Za Y) oan A \\j i\ndependent upon the level of SIL. For example, when creating q js \\\\ X\nthe software requirements specification for a SIL 4 system the , 4 站 j ee | , \\ \\ 起\ntechniques include: formal methods, modelling, structured /) f ff \\ \\ NS\nmethodology, and decision tables. Meee i \" a LO\nA common misconception is that individual products or ‘ E f 7 / | Oy 4 、\ncomponents have SIL ratings. But simply buying a SIL suitable 站 ! | ' 7\ncomponent (if possible) does not ensure a SIL system. Rather, 7 . ot 有\nproducts and components may be suitable for use within a\ngiven SIL system, but they are not individually SIL rated.\nSIL levels apply to safety functions and safety systems, and A complex railway system will typically employ systems with different\nproducts and components are only suitable for use in specific SIL levels. Interlocking, train absence detection and automatic train\nSIL applications if the end user can ensure that the overall protection for example may be SIL 4 systems, whilst the automatic\nsafety system is implemented correctly. The equipment train operation and control centre systems may be configured to\nor system must also be operated and used in the way it meet the failure rates of SIL 2.\nwas designed in order to achieve the required safety risk Photo Pixabay/Jan Hlousek.\nreduction level.\nis complicated, time-consuming and expensive, and can lead\nThe owner/operator must determine the acceptable level of to lower levels of overall system performance reliability which\nrisk, based on standards or other factors such as ALARP and has cost implications. It can also be an obstacle to future\nsociety acceptance of the risk. A risk level that one owner enhancements of the system to meet new requirements and\ndetermines is tolerable may be unacceptable to another. operational circumstances.\nUnfortunately, the requirements for a given SIL are not\nconsistent among all of the functional safety standards across For example, some industries outside of rail with a lower safety\ndifferent industries, which does cause some confusion. risk requirement (for example factory production) companies\nwill typically accept designs up to SIL 2. If an assessment\nSome asset owners and project managers may be tempted indicates a requirement for a higher SIL, owners will usually\nto specify a high SIL simply for availability reasons, and SIL require the redesign of the process to lower the intrinsic\nis sometimes mistakenly used to imply that a product has process risk, rather than design the system to achieve SIL 3.\nbetter quality and higher reliability, but this is incorrect. Some\nproducts may be described as ‘SIL rated’, suggesting that they ”In modern railway signalling systems the use of SIL 4 is\nare suitable for use in safety systems, but this depends on usually restricted to those parts of the signalling which are\nmany other aspects of the overall system design. Even when safety critical, for example the interlocking. Other parts of the\na product genuinely complies with SIL requirements, this only _ Signalling system, such as the control panel or workstation, are\nprovides assurance that it is capable of performing a specific usually of a lower SIL value (typically SIL 0 to SIL 2). Network\nrole within a safety system. Its safety reliability may be high, but Rail in the UK has recently reviewed its standards to determine\nits general reliability may not be. where the SIL 4 interlocking could be simplified by deploying\nlower SIL functions in another part of the system.\nAn item is highly available if it does not fail very often and,\nwhen it does, it can be quickly returned to service. A system Further reading\nis considered to be safe if it is reliably performing its safety e Understanding Safety Integrity Levels (SIL) International\nfunction. However, the system may fail much more frequently Technical Committee (ITC) IRSE News October 2015.\nin ways that are considered not to be dangerous (fail safe). irse.info/yahut\nTherefore, a safety system may be less reliable overall (i.e. with » The Use and Misuse of SILs (2009) Roger Short IRSE News\na lower mean time between failures) than a non-safety system er\n, - - February 2009. irse.info/Os8vc\nperforming a similar function.\n\ne Understanding the Use, Misuse and Abuse of Safety\nSelecting the appropriate SIL level must be done carefully. Integrity Levels (2000). Felix Redmill Proceedings of the\nWhole life costs are generally considerably higher in order to Eighth Safety-critical Systems Symposium, Southampton,\nachieve higher SIL levels. This is because designing, testing UK, February 2000. irse.info/1jsow\nand maintaining systems to meet high levels of safety integrity 11/\n\n13",
      "source_file": "26_SIL.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    }
  ]
}