{
  "doc_id": "fd57d3d9-3303-4945-be05-02665f7d84ab",
  "pages": [
    {
      "page_number": 1,
      "text": "Institution of Railway Signal Engineers\nRailway Control & Communications Systems Management\nVersion 6\nA selection of fundamental concepts and methodologies\n(This document is intended for candidates taking Module A of the IRSE Professional Examination. It\nis based on an extract from the 2018 Study Guide v1.3 for Module 7 of the IRSE Professional\nExamination)\n1 Introduction\nA railway is a complex system. All parts of the system must work well together to deliver safe and\nefficient outputs. This means that all sub-systems and their interfaces with each other (and with\nhuman operators) need to be carefully designed. Thinking about this should start at the beginning of\nany project because once equipment is being installed, or is in use, it is usually impractical or\nexpensive to make changes.\nThis document outlines some of the principles and tools of systems management and their application\nto the entire life cycle of assets.\n3-Apr-23 Systems Management article\nv6.docxSystems Management article\nv6.docx",
      "source_file": "21_Railway Systems Mgt v6.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 2,
      "text": "Institution of Railway Signal Engineers\n\n2 Project Life Cycle & Stage Gates\n\n2.1 Life Cycle for the Project\nGood systems do not just happen, they are designed and planned; and they achieve this when\ntheir projects follow a disciplined procedure. This is often called a life-cycle and the ‘V’ life-cycle\nin particular will be discussed in the next section. This will look at the generic steps that a\nproject should go through in order to deliver a well-engineered solution.\nA typical project breakdown is shown in the figure below. It divides the whole project process\nfrom start to finish into a number of discrete steps or phases\n\nProblem and . . 、 , aoe\nRequirement Design Commisstonin Operation and Decommissioni\nEach phase:\n\ne Has a defined start point\n\ne Can be described in terms of its characteristics\n\ne Provides clear boundaries between its neighbouring phases\n\ne Defines the transition to the next phase\n\ne Has a clearly defined end point\n\n2.2 Problem Solution and Definition\nThe problem to be solved should be clearly defined and articulated. The feasibility of the\npotential solutions should be confirmed. The potential solution(s) to be pursued should\nbe selected on the basis of a systematic assessment and comparison of the proposals.\n2.3 Requirements Definition\n\n2.3.1 There are 2 parts to this:\n\ne The business requirements describing the change that is needed. It is often\nexpressed in performance or monetary terms. The business sponsor would define\nthese with major input from operators and maintainers.\n\n° The system requirements which are a technical response to the business\nrequirements. These describe in clear engineering terms what the system will do.\n\n2.3.2 As requirements are captured, there are certain items which the project knows to be true\nand upon which it relies in order to deliver its solution. There are other items about which\nit is not certain or is dependent on others to deliver, either as part of the project, or once\nthe solution has been put into service. These are called Domain Knowledge,\nAssumptions, Dependencies and Caveats which are defined as:\n\ne Domain Knowledge: Things known to be true: e.g. characteristics of signalling\nrelays, typical adhesion values for steel wheels on steel rail;\n\ne Assumptions are statements made about items outside the scope of the\nsystem under consideration, but are relied upon to be true in order for the\nsystem to operate as expected. Once the facts are known an assumption will\neither be deleted, or changed to become domain knowledge, a dependency\nor a caveat;\n\ne A dependency is a requirement for someone or something else to act before\na task can be completed, e.g. if a project is delivering new rolling stock, it\nwould be reasonable to depend upon any necessary depot alterations to be\nmade;\n\ne Caveats are conditions that must be delivered after a system is put into\noperation, e.g. for the same rolling stock project a caveat is that the vehicle is\nmaintained to design standards.\n\n3-Apr-23 Systems Management article\nv6.docxSystems Management article\nv6.docx",
      "source_file": "21_Railway Systems Mgt v6.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 3,
      "text": "Institution of Railway Signal Engineers\n2.4 Design Development\n\nThis phase includes all the design activities that need to be carried out before the system can\nbe realised. The phase results in a design baseline — a design set of documents and\ndrawings. The level of detail in the design is very dependent upon the disciplines\ninvolved and the contractual strategy adopted.\n\n2.5 Implementation/Migration\n\nThe Implementation phase includes all activities that are involved in realising the design,\nincluding all construction works as well as the integration of electronic and mechanical\nsubsystems and delivering software and data. The output will be a physical system\nbaseline and as-built documentation. Technical requirements need to be communicated\nto detailed designers and manufacturers in the form of engineering specifications and\ntechnical standards.\n\n2.6 Verification, Validation and Testing\n\n2.6.1 Verification and validation should be done at the appropriate level. See section 3 for an\nexplanation of these terms. For example, validation of a signalling system should be\nundertaken at the system level, whereas individual components would be validated at the\nsubsystem level.\n\n2.6.2 The products will normally undergo a comprehensive regime of testing, comprising tests\nin the laboratory and factory environment and latterly in their target environment. The\ntests will seek to provide evidence to verify and validate that the products meet their\nrequirements and are fit for purpose and that the safety functionality has been correctly\nimplemented. This may include a set of routine tests for ‘proven’ products and more\ncomprehensive tests for newly developed items of equipment. Testing may comprise the\nfollowing:\n\ne Unit testing — test carried out by the software developer to verify compliance\nof units of software with their requirements. The depth and extent of test\ncoverage will depend on the safety integrity level (SIL) of the item under test.;\n\ne Qualification testing — carried out by the hardware developer to prove correct\nfunctionality of the hardware, and non-functional requirements, such as shock\nand vibration, temperature and humidity, reliability.\n\ne Software functional testing — carried out by the software developer to prove\ncorrect functionality of the software and that it does not exhibit any\nunexpected behaviour or hidden faults;\n\ne Safety functional testing — carried out at all levels of the system assembly to\nprove the correct functionality of the safety functions under normal and failure\nconditions;\n\ne Installation testing — a set of tests conducted on equipment installed in its\nintended location and environment to confirm correct installation;\n\ne Integration test - carried out at a number of test stages to confirm that sub-\nassemblies, products, subsystems and systems are correctly integrated to\nensure that they operate correctly together;\n\ne Interface testing — used to prove correct functioning of the interface between\ntwo or more interfacing pieces of equipment;\n\ne Test and commissioning — testing on the installed system to ensure that it\nperforms the correct functions and does not have any hidden faults. This\nphase of testing may also include testing to ensure that the principles of safe\nrailway operation have been adhered to (‘principles testing’). The final stage\nconfirms that the system will operate as expected with the surrounding\nrailway equipment with which it will interface.\n\n3-Apr-23 Systems Management article\nv6.docxSystems Management article\nv6.docx",
      "source_file": "21_Railway Systems Mgt v6.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 4,
      "text": "Institution of Railway Signal Engineers\n2.7 Commissioning & Handover\n\n2.7.1 This phase includes all activities required to bring the system into full service, including\ntesting and commissioning for signalling and trial running of trains.\n\n2.7.2 There are two linked but separate objectives:\n\ne To demonstrate that the system is ready to be put into service;\n\ne To demonstrate that the railway organisation is ready to accept the system\ninto service. This includes:\n\no Training\n\no Maintenance manuals\no Operation manuals\n\no Correct organisation\no Spares\n\nco Planning\n\n2.7.3 Acceptance and handover of the tested and commissioned system to the operator/user\nwill normally require the satisfactory completion of a number of activities:\n\ne Safety approvals of the system including its operation and maintenance\nsystems by the necessary approval bodies;\n\ne Audit of test records;\n\ne User acceptance tests — acceptance through testing or trials that the system\nmeets its stated requirements and can be operated by the user;\n\ne Processes for checking the competence of staff who have worked on the\nproject;\n\ne Handover operations and maintenance (O&M) systems to the operator and\nmaintainer, including training, O&M manuals, relevant safety case information\nand accurate “as built” records of the design (including version details for\ntraceability purposes).\n\n2.8 Operations & Maintenance\n\nThis phase includes all activities involved with the normal operation of the system. The\nmaintainer is responsible for the safe, whole life performance of the system. This\nincludes replacement of components and subsystems within the system. This phase only\nends when the system is removed from service.\n\nMaintenance testing is needed to ensure that the equipment remains in a safe and reliable\nstate. This includes testing after items of equipment are replaced by similar units. Test\nplans are needed to define the tests required. Technicians doing these tests should be\nmonitored periodically to prevent bad practice or short cuts that omit vital parts of the\ntest. A record should be kept of all maintenance tests.\n\n2.9 Decommissioning & Disposal\n\n2.9.1 The Decommissioning and Disposal phase includes all activities involved in removing the\nsystem from the railway. For most signalling systems, decommissioning coincides with\nor overlaps the commissioning of a new system.\n\n2.9.3 The decommissioning or disposal of a system is as much a change to the railway as the\nintroduction or commissioning of a new system and should be planned and executed\nwith care. These activities must be planned and implemented so as to ensure the safety\nof any train operations that continue through the period of transition.\n\n2.10 Stage Gates or Decision Gates\nThe division of a project into discrete steps or stages, permits those working on the\nproject to stop and check that as a whole the project will deliver what is expected of it. It\nis all too easy for individual disciplines to become separated from the rest of the project\n(particularly where a project is delivered from multiple locations) and develop their\n3-Apr-23 Systems Management article\nv6.docxSystems Management article\nv6.docx",
      "source_file": "21_Railway Systems Mgt v6.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 5,
      "text": "Institution of Railway Signal Engineers\ndesigns without consideration of how it must integrate with others. It is also possible for\nprojects to forget the original problem being solved and begin to move towards offering\nsomething that does not meet the client’s requirements.\n2.11 Uses of Stage Gates\nConsider the following when using stage gates:\n\ne Review the requirements that must be satisfied:\n\ne Provide objective evidence that these requirements are being met;\n\ne Confirm that designs comply (or will comply) with relevant legislation,\nconsents, agreements etc.\n\ne Look for opportunities to approve products or systems that are approved for\nuse on other administrations (with similar functions, environment and\ninterfaces) without the need to examine evidence from first principles.\n\ne Determine that all applicable standards have been identified and any\nnecessary derogations applied for and if possible, granted;\n\ne Ensure that technical risks have been adequately captured, assigned to an\nowner, appropriate mitigations identified and implemented;\n\ne Review the proposed design against the project costs of the project;\n\ne Be assured that interfaces have been identified and properly designed so that\nindividual design elements will integrate and work together as intended;\n\ne Confirm that the proposed design can be constructed given limitations of\ntechnology, available equipment and site conditions;\n\ne Review assurance evidence for each individual item of design;\n\ne Review the programme timescales and apply any remedial action should\ndelays be identified.\n\n2.12 Engineering Approvals\nEngineering approvals of designs, documents and products take place throughout a project's\nlife cycle, but stage gates are an opportunity to check that all engineering controls are in\nplace. Project engineering controls are an essential tool to ensure the delivery of safe and\nefficient outcomes.\n2.13 Cross-acceptance\nThe process of approving a new product or system can be more efficient if it is already in use\nelsewhere (typically on another railway system). This cross-acceptance approach for a\nproduct will need to examine whether it is being used for the same function in a similar\nenvironment and with similar interfaces to the remainder of the system. The quality and\nscope of the acceptance process of the other administration is also relevant.\n3-Apr-23 Systems Management article\nv6.docxSystems Management article\nv6.docx",
      "source_file": "21_Railway Systems Mgt v6.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 6,
      "text": "Institution of Railway Signal Engineers\n\n3. Verification, Validation and the V Model\n\n3.1 Verification and Validation\n\nThese are key concepts in the process of ensuring that a project is delivering a system that meets the\nclient’s requirements and is also fit for purpose.\n\ne Validation. The objective of validation is to provide confirmation, through the provision of\nobjective evidence, that the requirements for a specific intended use or application have\nbeen fulfilled.\n\ne Verification. The objective of verification is to demonstrate that the requirements of each\nlife cycle phase have been fulfilled.\n\n3.2 The V-Model\n\n3.2.1. A V-model is a common graphical representation (as shown in Fig. 1 below) of the\n\nsystem engineering life cycle. The left side of the V represents concept development and the\n\ndecomposition of requirements into function and physical entities that can be designed, and\ndeveloped. The right side of the V represents integration of these entities (including\nappropriate testing to verify that they satisfy the requirements) and their ultimate transition\n\ninto the field, where they are operated and maintained. The V-model can be viewed as a\n\ntime-line in the form of a \"V\". The product moves sequentially from the first phase, \"Concept\",\n\nto the next phase, \"System definition and application conditions\", etc.\n\n3.2.2. Throughout the process, evidence will be gathered from a variety of sources including\n\nthe review of specifications and the results of actual tests.\n\nFig. 1\n| System Definition and 4 | System | Operations and\nApplication Conditions Acceutance Rintenance and Dispozl\n\\ VALIDATION\nSystero $y stem vahdahon\n* Apporteonment of 站 =\n也 . Imolementaton . ~\n\nManufacture\n\n3.2.3. The principal advantage of the V-model is that it shows the relation of verification and\n\nvalidation to the activities in the lifecycle and makes clear their role in finding defects at an\n\nearly stage and preventing the propagation of defects through the lifecycle.\n3-Apr-23 Systems Management article\nv6.docxSystems Management article\nv6.docx",
      "source_file": "21_Railway Systems Mgt v6.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 7,
      "text": "Institution of Railway Signal Engineers\nFor projects incorporating a high degree of novelty or innovation the life-cycle may have to be\nmodified to include prototype testing or proof of concept.\n4. Reliability, Availability, Maintainability and Safety (RAMS).\n4.1 Definitions\ne Reliability is the probability that an item can perform a required function under given\nconditions for a given time period\ne Availability is the ability of a product to be in a state to perform a required function\nunder given conditions at a given instant of time or over a given interval\n° Maintainability is the ability of a system to be retained in, or restored to a state to\nperform as required, under given conditions of use and maintenance. Given\nconditions would include aspects such as: location for maintenance, accessibility,\nmaintenance procedures and maintenance resources”\ne Safety is freedom from unacceptable risk of harm.\n\nThe goal of a railway system is to achieve a defined level of rail traffic in a given time, safely.\n\nFor the demonstration of RAMS, a RAM Programme and Safety plan needs to be developed for\n\nthe project, so that during the system requirements phase, the following analysis needs to be\n\nconsidered within the RAMS programme:\ne Failure Modes Effects Analysis (FMEA), fault tree analysis, for reliability;\ne Data analysis for availability improvement and prediction for availability;\ne Maintenance task analysis, personal safety procedures for maintainability;\ne Defining safety related functional requirements, establish safety management\nprocesses.\n4.2 Systematic and Random Failures\n\n4.2.1 The RAMS of a railway system is influenced in three ways:\n\ne by sources of failure introduced internally within the system at any phase of the system\nlifecycle (system conditions),\n\ne by sources of failure imposed on the system during operation (operating conditions)\nand\n\ne by sources of failure imposed on the system during maintenance activities\n(maintenance conditions).\n\n4.2.2 Failures occurring due to internal disturbances in the system at any phase of system\nlifecycle are systematic failures or random failures. Systematic failures occur due to\nerrors in requirements, design inadequacies, manufacturing deficiencies, software errors,\nhuman errors in installation or maintenance, etc. Random failures occur due to wear out,\nover stress, stress degradation, environment, etc, beyond that which could have\nreasonably been foreseen during the specification and design phases or due to failure of\ncomponents which do not match their intended specification because of deficiencies in\nmanufacture or quality control.\n\n3-Apr-23 Systems Management article\nv6.docxSystems Management article\nv6.docx",
      "source_file": "21_Railway Systems Mgt v6.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 8,
      "text": "Institution of Railway Signal Engineers\n5. Security\n5.1 Protection against Cyber Attacks\n\n5.1.1 From the point of view of cybersecurity, railway signalling and communication systems\nhave much in common with Industrial Control Systems (ICS, also known as Industrial\nAutomation and Control Systems, IACS). They comprise a combination of both cyber\nand physical components, such as sensors and actuators and they incorporate\nnetworking devices and communication protocols; they commonly have long service\nlives, and comprise multiple generations of equipment from a wide range of suppliers;\ntheir software is often custom-written, using bespoke or older, unsupported operating\nsystems. They are both potential targets of cyber-attacks from sources such as viruses,\nhackers, organised criminals, terrorists and state-sponsored groups. Consequently,\ncybersecurity for railway signalling and control applications can benefit from study of\ngood practice and standards in ICS.\n\n5.1.2 For ICT (Information Communication Technology) system, increasing use of IP (Internet\nProtocol) technology and commercial off-the-shelf operating systems in railway systems\nmakes it important to understand the architecture and specific functions of those\nsystems. Consider whether part of the system is networked, or whether there are\ninterfaces with other systems that are. Understand how these systems share data, and\nwhat level of security is in place (passwords, encryption, firewalls, etc.). A system is only\nas secure as its weakest line of defence. Where systems that have been designed\nseparately are connected together (such as railway ICS) a cyber analysis of the whole\nsystem should be carried out. Examples of cyber threats include web application attacks,\nphishing through email, denial of service, malware. Consider whether important\npasswords are secure, review the use of USB flash drives, and establish an incident\nresponse plan in case of an attack. The objectives of a cyber-attack may not be obvious,\nand can range from causing injury or disruption, to undetected data theft and reputational\ndamage.\n\n5.2 Cybersecurity Design Principles\n\n5.2.1 The cybersecurity design principles listed below have been derived from the review of\nbest practice and existing sources and standards undertaken in the course of developing\na European Technical specification addressing cybersecurity within the railway sector.\n\ne Secure the weakest link. This design principle aims to push the designer to\nconsider the security of all the components of the system and not only the most\nobvious, such as the protocols or the interfaces.\n\ne Defence-in-depth (several diverse protections in sequence)\n\ne Fail secure (comparable to fail safe, but sometimes these two principles can be in\nconflict).\n\ne Grant least privilege (each component should have only those privileges to\naccomplish its specified functions, but no more).\n\ne Economise mechanism (avoid redundancies and overlapping of functionalities)\n\ne Authenticate requests (check identity of users, human or devices)\n\ne Control access (grant access only to authorised entities (users, programs,\nprocesses or other systems).\n\ne Assume secrets not safe (assume an attacker knows the details of the system)\n\ne Make security usable (avoid annoying and painful mechanisms)\n\ne Audit and monitor\n\n5.3 Safety and Security\n\n5.3.1 Safety and security have complementary goals but are sometimes in conflict over the\n\nmeans to achieve their respective goals.\n3-Apr-23 Systems Management article\nv6.docxSystems Management article\nv6.docx",
      "source_file": "21_Railway Systems Mgt v6.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 9,
      "text": "Institution of Railway Signal Engineers\n\ne Insafety, frequent changes should be avoided because of the cost of safety\ndemonstration. In security, update should be easy in order to be able to patch the\nsystem in a timely manner.\n\ne From the safety perspective an emergency message (e. g. to immediately shut\ndown or stop a system) should be transmitted as fast as possible and the\nreaction should be executed immediately. From a security perspective the\nmessage should be authenticated to prevent masquerade which might lead at\nleast to denial of service, but the calculation and checking of cryptographic codes\nconsumes time and leads to a delay of the emergency message and the reaction.\n\n5.3.2 Trade-off between safe and secure design is not easy and it can be hard to find an\noptimal solution. Safety and security are different and cannot easily be merged: security\ncannot simply be regarded as an add-on to safety or vice versa. The following principles\nare aimed at achieving a harmonious relationship between security and safety.\n\ne Safety and security are different and should be treated as such\n\ne The security environment should protect essential functions, including safety\n\ne Cybersecurity Threat & Risk Analysis is the main interface with Safety Analysis.\n\ne Separate security and safety as far as possible but coordinate them effectively\n\ne Security should be evaluated on the basis of international standards, e.g. IEC\n62443\n\ne lItis infeasible to evaluate the Security Risk probabilistically.\n\ne Safety and Security Target measures should not be coupled.\n\ne Security is a collaborative continuous effort.\n\n5.4 Protection against Physical Attacks, Theft & Vandalism\nPhysical attacks, theft and vandalism are all potential threats to the safety and availability\nof railway signalling and communications systems. For defence in depth to ensure\ncybersecurity the first barrier should be physical protection; with no trust on who can\naccess the hardware, there is no trust on the data. Vandalism incidents include malicious\ndamage and arson. Theft normally targets high value lineside equipment such as copper\ncables. Both vandalism and theft can adversely affect safety by damaging equipment in\nways not seen as credible in the normal design process, e.g. by causing multiple\nsimultaneous failures.\nMeasures to reduce risk include:\n\ne Fencing\n\ne CCTV\n\ne Cable alarms\n\ne Buried or secure cable routes\n\ne Fibre cable instead of metal\n\ne Security of equipment housings and rooms\n\ne Lighting\n\ne Movement detection\n\n3-Apr-23 Systems Management article\nv6.docxSystems Management article\nv6.docx",
      "source_file": "21_Railway Systems Mgt v6.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 10,
      "text": "Institution of Railway Signal Engineers\n\n6. Obsolescence Management\n\n6.1 Introduction\n\nItems become obsolete when they can no longer adequately perform the function for which they were\ncreated, or when there is a clear advantage in changing to a new product or technology. Three types\nof obsolescence are described below.\n\n6.1.1 Obsolescence affects all products and it impacts upon all stages of their life. The term\nincludes:\n\ne Capital equipment:\ne Infrastructure;\n\ne Consumer durables;\ne Consumables;\n\ne Software products.\n\n6.1.2 Obsolescence is inevitable and it cannot be avoided, but forethought and careful\nplanning can minimise its impact and its potential high costs. The objective of\nobsolescence management is to ensure that obsolescence is managed as an integral\npart of design, development, production and in-service support in order to minimise cost\nand detrimental impact throughout the product life cycle.\n\n6.1.3 Obsolescence presents itself in three ways:\n\ne The item is no longer suitable for current demands; or\ne The item is no longer available from the original manufacturer; or\ne The item can no longer be maintained because people with the necessary\nskills are no longer available.\n6.2 Product Suitability\n\n6.2.1 Asystem or product is designed to meet the requirements of the project at a specific\nmoment in time. Additional functionality can be added to meet a future need. This is\nonly a good idea if that future need is clear and/or the extra functionality does not add too\nmuch cost or complexity. Otherwise it can add design complexity, add cost (including\ndesign effort, manufacture and ongoing maintenance), reduce reliability and in the end,\nmay not be what is actually required.\n\n6.2.2 There is a need for products and systems to be ‘future-proof by which is meant minimal\nchanges are required to enable the product or system to continue in operation for as long\nas possible.\n\n6.2.3. A good approach for ‘future-proofing’ is to take time at the start of the project\nunderstanding what the user’s needs are and how these might realistically change over\ntime. This is not a perfect science, but careful consideration will ensure that all\nreasonable options can be considered and costed, enabling the design to progress.\nIssues that will need to be considered include:\n\ne Increases or decreases in demand;\ne Changes in supporting technology;\ne Changes in customer behaviour and expectations;\ne Legislation changes;\n6.3 Item Availability\n\n6.3.1 The availability of product parts reduces over time as manufacturers cease to make\nthem. Mechanical items can be remade if the drawings are available (or can be re-\ndrawn). And depending on the application, the advent of 3D printing may ease the supply\nof old parts.\n\n3-Apr-23 Systems Management article\nv6.docxSystems Management article\nv6.docx",
      "source_file": "21_Railway Systems Mgt v6.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 11,
      "text": "Institution of Railway Signal Engineers\n\n6.3.2 Electronic components, particularly semi-conductor circuits, are very likely to be hard to\nsource as time moves on. Manufacturers move on to the next iteration of the item and\nmay cease its manufacturing altogether and make something new. It is also possible that\nthe manufacturer can cease trading.\n\n6.3.3 In these cases, an alternative part must be found if the project or system is to remain in\noperation. This requires as full an understanding as possible of the functions and\ninterfaces of the obsolescent item concerned so that a replacement can be properly\nspecified. For legacy items, this is often hard to capture due to lack of appropriate\ndocumentation and loss of staff knowledge (see below). Designers today, should ensure\nthat each item is properly documented to enable its replacement by something suitable in\nthe future should the need arise.\n\n6.3.4 The key functions include:\n\ne Operating environmental conditions (e.g. temperature, humidity, pressure,\npower supply resilience);\n\ne Input timing considerations, particularly for microprocessor and memory\nchips;\n\ne Storage requirements (e.g. temperature, shelf time - especially for batteries,\nhumidity)\n\ne Earthing arrangements;\n\ne Operating sequence, where the receipt of some information before other\ninformation may be critical but undocumented;\n\n6.4 Staff Knowledge\n\n6.4.1 The failure to maintain sufficient corporate knowledge of a product (e.g. its history of\ndevelopment, experience of in-service operation and failures, frequent faults and their\nremedies) can lead to a loss of knowledge about that product. The result can be a\nreduction in reliability, poorly installed products, poor maintenance and badly applied\nmodifications.\n\n6.4.2 This can be particularly relevant to software modifications, especially if it has been\npoorly documented.\n\n6.4.3 The skills of staff need to be maintained because some will retire or move to another\njob. Training, comprehensive documentation and succession planning are tools to\naddress this.\n\n3-Apr-23 Systems Management article\nv6.docxSystems Management article\nv6.docx",
      "source_file": "21_Railway Systems Mgt v6.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 12,
      "text": "Institution of Railway Signal Engineers\n7. Configuration Management\n7.1 Configuration management follows four main principles:\ne Each piece of information or product is uniquely identified, not just by type,\nbut as a unique item in its own right.\ne Each piece of information or product can have a status associated with it, and\na record of its history.\ne The component parts that make up a product or system can be listed, and\nassociated together. Documents can also be similarly related. Examples are a\nset of requirements documents for a system, or plans for related sub-projects.\ne Associations between elements of a wider system can be captured, so that if\none item changes, then it is known that another must also change.\n7.2 Configuration management consists of four basic elements\ne Identification.\ne Change Management\ne Status Accounting\ne Audit and review\n7.3 Identification. Set the identification system for each configured item. This will not\nnecessarily be the same for each item. Documents will almost certainly need a different method\nfrom products for example. Thought should be given to the creation of a document tree, and\nproduct list.\n7.4 Change Management. Changes have to be managed, otherwise people will be\nworking from different sets of uncontrolled information, resulting in costly delays later on in the\nproject. There needs to be a change control process that ALL changes go through. A system of\nversion control is needed for both hardware and software. But the change process should also\ntake into account the different needs of major and minor changes, so that changes are given\nthe appropriate scrutiny and then authorisation. Baselines provide a useful means of controlling\nthe issue of information, particularly where there are several pieces of information that are\nrelated (e.g. various different product specifications for one system). This enables others to\nwork from a common set of information, and all changes and their impacts to be compared\nagainst a known position. Finally, any information that is out of date, must be withdrawn, and\nthe change management process should enable this to take place and to demonstrate that is\nhas occurred.\n7.5 Status Accounting. This provides a view of the current status of configuration items\n(number of changes, those pending, actioned etc.). People can see what changes have\noccurred, and when they occurred. They can also see which proposed changes have been\nrejected.\n7.6 Audit and review There is often pressure to deliver the job now and update the\ndocuments later. In the long term, this attitude can be costly to a project. Performing audits and\nreviews challenges people to adhere to the process. It also provides a record that the process\nhas been followed.\n3-Apr-23 Systems Management article\nv6.docxSystems Management article\nv6.docx",
      "source_file": "21_Railway Systems Mgt v6.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    },
    {
      "page_number": 13,
      "text": "Institution of Railway Signal Engineers\n\n8. Use of DRACAS and FRACAS\n\n8.1 Introduction\n\ne The terms DRACAS (Defect Recording, Analysis and Corrective Action System) and\nFRACAS (Fault Reporting, Analysis and Corrective Action System) are often used\ninterchangeably. While they overlap, they are different.\n\ne FRACAS specifically addresses faults and failures, i.e. when something is no longer\nperforming its intended function. Such a system would typically be used by a maintenance\norganisation to manage and record in-service failures. Analysis of these failures can lead to\nquicker repair times as common faults can be highlighted and appropriate repair mechanisms\nor preventative measures put in place.\n\ne DRACAS has a wider remit, embracing not only faults, but other incidents and observations\nwhich, combined with faults, provides a richer picture of equipment performance and can lead\nto a significant improvement in reliability. Such a system would typically be used by a design\norganisation as the item under consideration is developed for in-service operation. It may also\nbe used by a maintenance organisation. It is good to start using a DRACAS as early in the\nlifecycle as possible to capture defects as they occur throughout design.\n\n8.2 Defect Recording / Fault Reporting\n\n8.2.1 The first step in the process is to record the defect (or record the fault). The initial details\nnecessary are:\n\ne Observed defect / fault\n\ne The effect of the default/fault on the operation of the equipment and, if\nrelevant, the safe operation of the railway;\n\ne Date, time and location of where and when the defect was first observed;\n\ne Details of what was happening at the time;\n\ne Details of the equipment involved (type, model, manufacturer, serial number,\nsoftware version)\n\ne Details of personnel involved;\n\ne Details of the person making the report;\n\n8.2.2 The report record then needs to be stored. Supporting this should be a process that\ntakes the recorded information and makes it available for relevant personnel. Such\npersonnel could include:\n\ne Designers;\n\ne Maintainers;\n\ne Operators;\n\ne Safety engineer.\n\n8.2.3. The information should then be used (alongside data from previous faults) for analysis\n\nand corrective actions to improve future performance.\n\n3-Apr-23 Systems Management article\nv6.docxSystems Management article\nv6.docx",
      "source_file": "21_Railway Systems Mgt v6.pdf",
      "garbled": false,
      "garbled_reason": "ok",
      "ocr_used": true,
      "ocr_engine": "tesseract"
    }
  ]
}